[
    {
        "chapterName": "学而第一",
        "introduction": "此为书之首篇，故所记多务本之意乃入经之门，积德之基，学者之先务也。凡十六章。",
        "paragraphs": [
          [{"originalText": "子曰：“学而时习之，不亦说乎！”", "explain": "学，是仿效。凡致知力行，皆仿效圣贤之所为，以明善而复其初也。习，是温习。说，是喜悦。孔子说道：“人之为学，常苦其难而不悦者，以其学之不熟，而未见意趣也。若既学矣，又能时时温习而不间断其功，则所学者熟，义理浃洽，中心喜好，而其进自不能已矣。所以说不亦说乎！”"},
          {"originalText": "“有朋自远方来，不亦乐乎？”", "explain": "朋，是朋友。乐，是欢乐。夫学既有得，人自信从，将见那同类的朋友皆自远方而来，以求吾之教诲。夫然则吾德不孤，斯道有传，得英才而教育之，自然情意宣畅可乐，莫大乎此也。所以说不亦乐乎！"},
          {"originalText": "“人不知而不愠，不亦君子乎！”", "explain": "愠，是含怒的意思。君子，是成德的人。夫以善及人，固为可乐，苟以人或不见知，而遂有不乐焉，则犹有近名之累，其德未完，未足以为君子也。是以虽名誉不著而人不知我，亦惟处之泰然，略无一毫含怒之意。如此则其心纯乎为己，而不求人知，其学诚在于内，而不愿乎外，识趣广大，志向高明，盖粹然成德之人也。所以说不亦君子乎！夫学，由说以进于乐，而至于能为君子，则希贤希圣，学之能事毕矣！"}],
          [{"originalText": "有子曰：“其为人也孝弟，而好犯上者，鲜矣；不好犯上而好作乱者，未之有也。”", "explain": "有子，是孔子弟子，姓有，名若。善事父母，叫做孝；善事兄长，叫做弟。犯，是干犯。鲜，是少。作乱，是悖逆争斗的事。有子说：“天下的人莫不有父母兄长，则莫不有孝弟的良心。人惟不能孝弟，则其心不和不顺，小而犯上，大而作乱，无所不至矣。若使他平昔为人，于父母则能孝，尽得为子的道理，于兄长则能弟，尽得卑幼的道理，则心里常是和顺，而所为自然循礼，若说他敢去干犯那在上的人，这样事断然少矣。”夫犯上，是不顺之小者，且不肯为，却乃好为悖逆争斗大不顺的事，天下岂有是理哉！夫人能孝弟而自不为非如此，可以见孝弟之当务矣。"},
          {"originalText": "“君子务本，本立而道生。孝弟也者，其为仁之本与！”", "explain": "务，是专力。本，是根本。为仁，是行仁。有子又说：“天下之事，有本有末，若徒务其末，则博而寡要，劳而无功。所以君子凡事只在根本，切要处专用其力。根本既立，则事事物物处之各当，道理自然发生，譬如树木一般。”根本牢固，则枝叶未有不茂盛者。本之当务如此。则吾所谓孝弟也者，乃是行仁之本与。盖仁具于心，只是恻怛慈爱的道理，施之爱亲敬长，固是此心推之仁民爱物，亦是此心。人能孝弟，则亲吾之亲，可以及人之亲，长吾之长，可以及人之长，至于抚安万民，养育万物，都从此充拓出来，而仁不可胜用矣！然则行仁之本，岂有外于孝弟乎！学者务此，则仁道自此而生矣！《孝经》孔子说：“爱敬尽于事亲，而德教加于百姓，刑于四海，此天子之孝也。”有若之言，其有得于孔子之训欤？"}],
          [{"originalText": "子曰：“巧言令色，鲜矣仁！”", "explain": "巧，是好。令，是善。鲜字，解做少字。仁，是心之德。孔子说：“辞气容色，皆心之符，最可以观人。那有德的人，辞色自无不正。若乃善为甘美之辞，迁就是非，便佞阿谀，而使听之者喜，这便是巧言。务为卑谄之色，柔顺侧媚，迎合人意，而使见之者悦，这便是令色。这等的人，其仁必然少矣。”盖仁乃本心之德，心存，则仁存也。今徒致饰于外，务以悦人，则心驰于外，而天理之斫丧者多矣，岂不鲜仁矣乎！然孔子所谓鲜仁，特言其丧德于己耳。若究其害，则又足以丧人之德。盖人之常情，莫不喜于顺己。彼巧言令色之人，最能逢迎取悦，阿徇取容，人之听其言，见其貌者，未有不喜而近之者也。既喜之而不觉其奸，由是变乱是非，中伤善类，以至覆人之邦家者，往往有之矣！夫以尧舜至圣，尚畏夫巧言令色之孔壬，况其他乎！用人者不可不察也。"}],
          [{"originalText": "曾子曰：“吾日三省吾身，为人谋而不忠乎？与朋友交而不信乎？传不习乎？”", "explain": "曾子，是孔子弟子，名参。省，是省察。忠，是尽心的意思。信，是诚实。传，是传授。习，是习熟。曾子说：“我于一日之间，常以三件事省察己身。三者维何？凡人自己谋事，未有不尽其心者，至于为他人谋，便苟且粗略，而不肯尽心，是不忠也。我尝自省，为人谋事，或亦有不尽其心者乎？交友之道，贵于信，若徒面交，而不以实心相与，是不信也。我尝自省，与朋友交，或亦有虚情假意，而不信于人者乎？受业于师，便当习熟于己，若徒面听，而不肯着实学习，是负师之教也。我尝自省，受之于师者，或亦有因循怠惰，而不加学习者乎？以此三者，自省察其身，有则改之，无则加勉，盖未尝敢以一日而少懈也。”盖曾子之学，随事精察而力行之，故其用功之密如此。然古之帝王，若尧之兢兢，舜之业业，成汤之日新又新，检身不及，亦此心也，此学也。故《大学》曰：“自天子以至于庶人，壹是皆以修身为本。”从事于圣学者，可不知所务哉！"}],
          [{"originalText": "子曰：“道千乘之国，敬事而信，节用而爱人，使民以时。”", "explain": "道，是治。乘，是兵车。四马驾一车，叫做一乘。千乘之国，是地方百里，可出兵车千乘的大国。时，是农功闲暇之时。孔子说：“千乘的大国，事务繁难，人民众多，不易治也。”若欲治之，其要道有五件。其一要敬事。盖人君日有万几，一念不敬，或贻四海之忧，一时不敬，或致千百年之患。必须兢兢业业，事无大小，皆极其敬慎，不敢有怠忽之心，则所处皆当，而自无有于败事矣。其一要信。盖信者，人君之大宝，若赏罚不信，则人不服从，号令不信，则人难遵守。必须诚实不贰，凡一言一动都要内外相孚，始终一致，而足以取信于人，则人皆用情，而自不至于欺罔矣。其一要节用。盖天地生财止有此数，用若不节，岂能常盈。必须量入为出，加意撙节。凡奢侈的用度，冗滥的廪禄，不急的兴作，无名的赏赐都裁省了。只是用其所当用，则财常有余，而不至于匮乏矣。其一要爱人。盖君者，民之父母，不能爱人，何以使众。必须视之如伤，保之如子，凡鳏寡孤独、穷苦无依的，水旱灾伤、饥寒失所的，都加意周恤，使皆得遂其生，则人心爱戴，而仰上如父母矣。其一要使民以时。盖国家有造作营建，兴师动众的事，固不免于使民，然使之不以其时，则妨民之业，而竭民之力矣。必待那农事已毕之后，才役使他，不误他的耕种，不碍他的收成，则务本之民，皆得以尽力于田亩，而五谷不可胜食矣。这五者都是治国的要道，若能体而行之，则四海之广，兆民之众，治之无难，岂特千乘之国而已哉！为人君者，所当深念也。"}],
          [{"originalText": "子曰：“弟子入则孝，出则弟，谨而信，泛爱众而亲仁。行有余力，则以学文。”", "explain": "弟子，是指凡为弟为子的说。谨，是行的有常。信，是言的有实。泛字，解做广字。众，是众人。亲，是亲近。仁，是仁厚有德的人。余力，是余剩的工夫。文，是《诗》、《书》六艺之文。孔子教人说：“但凡为人弟为人子的，入在家庭之内，要善事父母以尽其孝；出在宗族乡党之间，要善事兄长以尽其弟。凡行一件事，必慎始慎终，而行之有常；凡说一句话，必由中达外，而发之信实。于那寻常的众人都一体爱之，不要有憎嫌忌刻之心；于那有德的仁人却更加亲厚，务资其熏陶切磋之益。这六件，是身心切要的工夫。学者须要着实用力，而不可少有一时之懈。若六事之外，尚有余力，则学夫《诗》、《书》六艺之文。”盖《诗》、《书》所载，皆圣贤教人为人之道，而礼、乐、射、御、书、数亦日用之不可阙者。未有余力，固不暇为此，既有余工，则又不可不博求广览，以为修德之助也。先德行而后文艺，弟子之职，当如此矣。然孔子此言，虽泛为弟子者说，要之上下皆通。古之帝王，自为世子时，而问安视膳，入学让齿，以至前后左右，莫非正人，礼乐诗书，皆有正业，亦不过孝弟、谨信、爱众、亲仁与夫学文之事也。至其习与性成，而元良之德具，万邦之贞，由此出矣。孔子之言，岂非万世之明训哉！"}],
          [{"originalText": "子夏曰：“贤贤易色，事父母能竭其力，事君能致其身，与朋友交言而有信。虽曰未学，吾必谓之学矣。”", "explain": "子夏，是孔子弟子，姓卜名商，字子夏。上一个贤字解做好字，下一个贤字，是有德的贤人。易，是移易。竭，是尽。致其身，是委弃其身，不肯爱惜的意思。子夏说：“人之为学，只在纲常伦理上见得明白，才是根本切要的工夫。如人之见贤，谁不知好，但不能着实去好他。若使贤人之贤，而能移易其好色之心，大贤则事之为师，次贤则亲之为友，真知笃信，就如好好色的一般，则好善极其诚矣。人于父母，谁无孝心，但未能着实去尽孝，若使委曲承顺，尽那为子的道理，凡力量到得的去处，都竭尽而无遗，则事亲极其诚矣。事君不可以不忠，但人都自爱其身，则其忠必不尽。若能实心任事，把自家的身子，委弃于君，虽烦剧也不辞，虽患难也不避，一心只是要忠君报国，而不肯求便其身图，则事君极其诚矣。交友不可以不信，但轻诺者多，全信者少，若能诚心相与，但与朋友说的都是着实的言语，内不欺己，外不欺人，虽久远而不至于失信，则交友极其诚矣。这四件都是人伦之大者，而行之皆尽其诚，这就是见道分明，践履笃实的去处，学问之道不过如此。人虽说他未曾为学，我必谓之已学矣。若使未尝学问，而但出于资性之聪明，则不过一事之偶合，一时之袭取而已，岂能事事尽美，而厚于人伦如是乎。此可见古人之为学，皆用力于根本切要之地，而不专在于言语文字之末也。”"}],
          [{"originalText": "子曰：“君子不重则不威，学则不固。主忠信，无友不如己者。过则勿惮改。”", "explain": "重，是厚重。威，是威严。固，是坚固。忠信，是诚实。无字、勿字都是禁止之辞。惮，是畏难的意思。孔子说：“君子为学必养成个深厚凝重的气质，然后外貌威严，而所学的道理自然坚固。若是轻浮浅露，不能厚重，则见于外者，无威之可畏，而其所学者亦不能实有诸己，虽得之，必失之矣。岂能以坚固乎！然立身固要厚重，而存心又在忠信。人不忠信，则事皆无实，何以为学。故又当以诚实不欺为主，而无有一毫之虚伪，然后可以进德也。所交的朋友必胜过我的人，方为有益。若是不如我的，或便佞善柔之类，这样的人，不但无益而且有损，切不可与之为友也。人不能无过，而贵于能改。过而惮改，则过将日甚矣。所以但遇有过，或闻人谏正，或自家知觉，便当急急改之，不可畏其难改，而苟且以自安也。以厚重为质，以忠信为主，又辅之以胜己之人，行之以改过之勇，则内外人己，交养互发，而自修之功全矣。学者可不勉哉！”"}],
          [{"originalText": "曾子曰：“慎终追远，民德归厚矣。”", "explain": "慎，是谨慎。终，是亲之既殁。追，是追思。曾子说：“人伦以亲为重，人之事生，或有能孝者，至于送终，则以亲为既死也，而丧葬之事不能尽礼者，多矣。初丧之时，或有能思念者，至于岁时既远，则其心遂忘，而祭祀之礼，不能尽诚者多矣。此皆民心之薄，由在上之人无以倡之也。若为上者能致谨于亲终之时，不徒哀而已，而每事尽礼，不使少有后日之悔。又能追思于久远之后，不徒祭而已，而致其诚敬，不敢少有玩怠之心，则己之德厚矣。由是百姓每，自然感化，皆兴仁孝之心。丧也，尽其礼；祭也，尽其诚，而其德亦归于厚矣。此可见孝者，人心之所同。君者，下民之表率。欲化民成俗者，可不知所以自尽也哉！”"}],
          [{"originalText": "子禽问于子贡曰：“夫子至于是邦也，必闻其政，求之与，抑与之与？”", "explain": "子禽，姓陈名亢。子贡，姓端木名赐，都是孔子弟子。抑，是反语词。与，是疑词。子禽问于子贡说：“夫子周流四方，每到一国必然就知这一国的政事，果是夫子访求于人，然后得而闻之与？或是各国的君自以其政事说与夫子而知之与？”子禽之问，盖亦不善观圣人者矣！"},
          {"originalText": "子贡曰：“夫子温良恭俭让以得之，夫子之求之也，其诸异乎人之求之与！”", "explain": "其诸，是语词。子贡答子禽说“夫子所以得闻国政，不是夫子有心去求，也不是时君无故而与。盖夫子盛德充积于中，而光辉自发于外。故其容貌词气之间，但见其温而和厚，无一些粗暴；良而易直，无一些矫饰；恭而庄敬，无一些惰慢；俭而节制，无一些纵弛；让而谦逊，无一些骄傲。有这五者德容之盛，感动乎人，所以各国的君，自然敬之而不忽，信之而不疑。都把他国中的政事，可因可革的，来访问于夫子，故夫子因而闻之耳。就汝所谓求者而论之，这等样求，岂不异于他人之求之者与。盖他人之求必待访问于人而后得。夫子之闻政，则以盛德感人而自致，岂可以一概论哉！”子贡之言，不惟足以破子禽之疑，而使万世之下，犹可以想见圣人之气象，此所以为善言德行也。"}],
          [{"originalText": "子曰：“父在观其志，父没观其行，三年无改于父之道，可谓孝矣。”", "explain": "志，是志向。行，是行事。三年，是言其久。孔子说“人子事亲，有承受而无专擅，有巽顺而无违拂，故当其父在之日，凡事都禀命而行，不敢自专，即欲知其人，亦但观其志向何如耳。其行事不可概见也。至于父没之后，则分得以自专，然后其行事昭然可见，得就其行而观之焉。然父没之后，虽凡事得以自专，而其所行，犹如父在之时，至于三年之久，亦不敢有所改易。斯则思亲之念，不渝于始终，顺亲之心，无间于存没，如是而后可谓之为孝也。否则虽能致敬于亲在之时，而不能不变于亲终之后，岂所谓终身而慕者乎。”抑孔子所谓无改于父之道，亦自其合于道而可以未改者言之耳。若于道有未合焉，则虽速改可也，何待三年！故善述其事孝也，克盖前愆亦孝也。观圣人之言者，不可以执一求之。"}],
          [{"originalText": "有子曰：“礼之用，和为贵，先王之道斯为美，小大由之。”", "explain": "礼，是尊卑上下的礼节。和，是从容不迫的意思。斯字，解做此字，指和说。小大，是小事大事。由，是行。有子说：“礼之在人，如尊卑上下，等级隆杀，一定而不可易，其体固是至严。然其为用，必和顺从容，无勉强乖戾之意，乃为可贵。如君尊臣卑，固有定分，然情意也要流通。父坐子立，固有常规，然欢爱也要浃洽。这才是顺乎天理，合乎人情，而为礼之所贵者也。古先圣王之制礼，惟其皆出于和，此所以尽善尽美，万世无弊。凡天下之事，小而动静食息之间，大而纲常伦理之际，都率而行之，无所阻滞，礼之贵于和如此。”"},
          {"originalText": "“有所不行，知和而和，不以礼节之，亦不可行也。”", "explain": "承上文说，礼贵于和，则宜无不可行者。然也有行不得的，这是为何？盖所谓和者，是在品节限制之中，有从容自然之意，所以可行。若但知和之为贵而一于和，率意任情，侈然自肆，全不把那礼体来节制他，则是流荡忘返，而尊卑上下皆失其伦矣。如何可以行之哉？此可见礼之体虽严，而不至于拘迫，其用虽和，而亦不至于放纵。古之圣王，能以礼治身，而又能推之以治天下者，用此道也。"}],
          [{"originalText": "有子曰：“信近于义，言可复也。恭近于礼，远耻辱也。因不失其亲，亦可宗也。”", "explain": "信，是约信。义，是事理之宜。复，是践言。恭，是恭敬。礼，是礼节。因，是依倚人的意思。亲，是有道义可亲近的人。宗，是主。有子说：“天下之事，必须谨之于初，而后可善其后。”如与人以言语相约，本是要践行其言，但其所言者，若不合于义理之宜，将来行不将去，则必至爽约失信矣！故起初与人相约之时，就要思量，必其所言者皆合乎天理之宜，而与义相近，则今日所言的，他日皆可见之于行，而自不至于失信矣。所以说言可复也。待人之礼，固当恭敬，然亦自有当然之节。若恭不中礼，则为足恭，而反以致人之轻贱矣。故凡施敬于人之时，就要斟酌，务合乎礼之节文，而不过其则。则内不失己，外不失人，自不至于卑贱而取羞辱矣。所以说远耻辱也。与人相依，本图交久，但所依的不是好人，则始虽暂合，终必乖离。故当其结交之初，就要审择，不可失了那有道义可亲近的人，则不但一时相依，自后亦倚靠得着，可以为宗而主之矣。所以说亦可宗也。此可见人之言行交际皆当谨之于始，而虑其所终。不然，则因循苟且之间，将有不胜其自失之悔者矣。"}],
          [{"originalText": "子曰：“君子食无求饱，居无求安，敏于事而慎于言，就有道而正焉，可谓好学也已。”", "explain": "敏，是急速的意思。就，是亲近。有道，是有德的贤人。正，是考正。孔子说：“凡人之为学，厌怠者多，笃好者少，所以不能成就。惟君子之于学，专心致志，无一毫外慕之私。就是食以养生，也不去求饱；居以容身，也不去求安。盖志有所在而不暇及也。行事常患其不足，则勉力自强，汲汲然见之于行，不敢有一些怠缓。言语常患其有余，则谨慎收敛，讷讷然如不出口，不敢有一些放肆。这等样着实用功，必然有所得了。然犹不敢自以为是，又必亲近那有道德的贤人，以考正吾之是非，凡一言一行都要讲究得道理明白，不至于差谬而后已焉。夫志向已是精专，功夫已是切实，而又加以谦抑之心，常存不足之虑，盖真见夫义理之无穷，学问之有趣，其心欣慕爱乐，有不能自已者，这才是好学的人，所以说可谓好学也已。”学而至于能好，则聪明日开，闻见日广，进而为贤为圣，何难之有哉！《商书·说命篇》：“惟学逊志，务时敏。”《周颂》说：“学有缉熙于光明。”皆是此意，可见“好学”二字，不但学者之所当知，为人君者尤不可不加之意也。"}],
          [{"originalText": "子贡曰：“贫而无谄，富而无骄，何如？”子曰：“可也。未若贫而乐，富而好礼者也。”", "explain": "谄，是卑屈。骄，是矜肆。可，是仅可而有所未尽之辞。乐，是安乐。好礼，是喜好礼节，自然循理的意思。子贡问于孔子说：“凡人贫者，易至于卑谄，富者易至于矜骄，此人情之常也。若能处贫而无卑屈之意，处富而无矜肆之心，这等的人其所得为何如？”孔子答说：“常人溺于贫富之中，多不能有以自守，故必有谄骄之病。今曰无谄无骄，则能自守，而于学亦有得矣，是亦可也。然而非其至者。盖贫而无谄，虽不为贫所困，然犹知有贫也，不如那贫而乐的人，心广体胖，欣然自忘其贫，是身虽处乎贫之中，而心已超于贫之外也。此岂无谄者之可及乎！富而无骄，虽不为富所溺，然犹知有富也。不如那富而好礼的人，乐善循理，初不自知其富，是身虽处乎富之中，而心已超乎富之外也。此岂无骄者之可及乎？”夫子答子贡之问如此，善许其所已能，而勉其所未至也。"},
          {"originalText": "子贡曰：“《诗》云‘如切如磋，如琢如磨’，其斯之谓与？”", "explain": "《诗》，是《卫风·淇澳》之篇。孔子既教子贡以贫而无谄者之不如贫而乐，富而无骄者之不如好礼。子贡闻言而悟，遂引《诗》以证之，说道：“《卫风·淇澳》之诗有言，君子之学，就如治骨角的，既切以刀锯，又磋以鑢铴，是已精而益求其精也。又如治玉石的，既琢以椎凿，又磨以沙石，是已密而益求其密也。诗人之言如此，其即夫子所言之谓与。”盖贫而无谄，我固自以为至矣，岂知无谄之外，更有所谓乐乎。富而无骄，我亦自以为足矣，岂知无骄之外，更有所谓好礼乎！可见道理本无终穷，学问不可自足，必如治骨角玉石者，求到至精至密之地而后可，《诗》言圣教何以异乎！子贡因论学而知《诗》如此，真可谓善悟者矣。"},
          {"originalText": "子曰：“赐也，始可与言《诗》已矣。告诸往而知来者。”", "explain": "赐，是子贡的名。往，是已曾说过的。来，是未曾言及的。孔子因子贡引《诗》证学，遂称许之说：“《诗》有三百篇之多，其言词微婉，意味深长，非有颖悟之资者，不足以说此也。如赐也才可与言诗也已矣。”盖处贫处富的道理，是我所已言的，切磋琢磨的意思，是我所未言的。今因我已言的道理，就知我未言的意思，这等样聪明的人，与之论诗，必能触类旁通，而不至于以词害意矣！岂不可与言《诗》矣乎。然子贡悟性虽高，而学力未至，犹不得闻性与天道之妙，此可见美质之难恃，而学问之当勉也。"}],
          [{"originalText": "子曰：“不患人之不己知，患不知人也。”", "explain": "患，是忧患。孔子说：“君子之学，专务为己，而不求人知。”如上不见知于君，而爵位不显；下不见知于友，而名誉不彰。此务外好名者之所忧患也。君子则以为学问在己，知与不知在人，何患之有。惟是我不知人，则贤否混淆，是非颠倒。在上而用人，则不能辨其孰为可进，孰为可退。在下而交友，则不能辨其孰为有损，孰为有益。这是理有不明，心有所蔽，岂非人之所当深患者乎。然人才固未易知，知人最为难事。必居敬穷理，使此心至公至明，然后如镜之照物，好丑毕呈，如称之称物，低昂自定。欲知人者，尤当以清心为本也。"}]
        ]
    },
    {
        "chapterName": "为政第二",
        "introduction": "凡二十四章。",
        "paragraphs": [
          [{"originalText": "子曰：“为政以德，譬如北辰，居其所而众星共之。”", "explain": "政，是法令，所以正人之不正者。德，是躬行心得的道理。北辰，是天上的北极。共，是向。孔子说：“人君居万民之上，要使那不正的人都归于正，必有法制禁令以统治之。这叫做政。然使不务修德以为行政之本，则己身不正，安能正人，虽令而不从矣。所以人君为政，惟要躬行实践，以身先之。如纲常伦理，先自家体备于身，然后敷教以化导天下；纪纲法度，先自家持守于上，然后立法以整齐天下，这才是以德而为政。如此，则出治有本，感化有机。由是身不出乎九重，而天下的百姓，自然心悦诚服，率从其教化。譬如北极，居天下之中，凝然不动，只见那天上许多星宿，四面旋绕，都拱向他。是人君修德于上，而恭己南面，就如北辰之居所一般，万民之观感于下，而倾心向化，就如那众星之拱极一般。”此古之帝王所以笃恭而天下平者，用此道也。图治者可不务修德以端，出治之本哉！"},
          {"originalText": "子曰：“《诗》三百，一言以蔽之，曰思无邪。”", "explain": "诗，是《诗经》。蔽字，解做盖字。思，是心思。无邪，是心思之正。孔子说：“《诗》之为经，凡三百篇。一篇自为一事，一事自有一义，可谓多矣。然就中有一句言语足以尽盖其义而无余。《鲁颂·駉》篇之词有曰：思无邪。”是说人之思念皆出于天理之正，而无人欲之邪曲也。只这一言就足以尽盖三百篇之义。盖诗人之言有美有刺。善者美之，所以感发人之善心；恶者刺之，所以惩创人之恶念。只是要人为善去恶，得其性情之正而已。人之心若能念念皆正，而无邪曲之私，则其所为，自然有善而无恶，有可美而无可刺，而诗人之所为以劝以惩者，包括而无遗矣。然则思无邪之一言，岂不可以尽盖三百篇之义乎。此可见学者必务知要，而其功莫切于慎思也。"},
          {"originalText": "子曰：“道之以政，齐之以刑，民免而无耻。”", "explain": "道，是率先引导的意思。政，是法制禁令。齐，是齐一。刑，是刑罚。孔子说：“人君之治天下，不过是要人为善，禁人为恶而已。”但出之有本，而致之有机。若不知本原所在，只把法制禁令去开导他。如事亲则禁约他不孝，事长则禁约他不弟，使之奉行遵守。其有不从教令的，便加之以刑罚，使一齐都归于孝弟，无有违犯。这等样治民，虽则能使民不敢为恶，然只是惧怕刑罚，苟免于一时，而其中不知愧耻，为恶的心依旧还在，岂能久而不犯乎！所以说民免而无耻。"},
          {"originalText": "“道之以德，齐之以礼，有耻且格。”", "explain": "德，是行道而有得。礼，是制度品节。耻，是愧耻。格字，解做至字。孔子说：“治以政刑，民固苟免而无耻矣。”若使君之导民，不徒以其法也，而皆本于躬行之实。如欲民兴孝，必先自尽孝道以事亲；欲民兴弟，必先自尽弟道以事长。如此，则民既有所观感而兴起矣。而其间所得有浅深厚薄之不一者，则又有礼以齐之。亲疏上下，都有个节文。日用云为，都有个仪则。使贤者不得以太过，不肖者不得以不及，而皆协于一焉。这等样治民，将见那百姓每良心自然感发，不但知恶之可耻，而绝不肯为，又且知善之当为，而皆力行以至于善矣。岂特求免刑罚而已乎！所以说，有耻且格，盖德礼政刑，固皆所以适于治之路，而出之有本末，获效有浅深，故孔子第而言之，欲为人君者，审其本末轻重之辨也。"},
          {"originalText": "子曰：“吾十有五而志于学，三十而立，四十而不惑，五十而知天命，六十而耳顺，七十而从心所欲，不踰矩。”", "explain": "从字，解做随字。踰，是过。矩，是为方的器具。孔子自序其从少至老，进学的次第，说道：“我从十五岁的时节，就有志于圣贤大学之道。凡致知力行之事，修己治人之方，都着实用功，至忘寝食。盖念念在此，而为之不厌矣。到三十的时节，学既有得，自家把捉得定，世间外物都动摇我不得，盖守之固，而无所事志矣。进而至于四十，则于事物当然之理，表里精粗，了然明白，无所疑惑。盖见之明，而无所事守矣。进而至于五十，则于天所赋的性命之理，有以充其精微，探其本原，而知乎所以然之故矣。又进而至于六十，则涵养愈久，而智能通微。闻人之言，方入乎耳，而所言之理，即契于心，随感随悟，无有违逆而不通者矣。又进而至于七十，则工夫愈孰而行能入妙，凡有所为，随其心之所欲，不待检点，无所持循而自然不越于规矩法度之外，盖庶几乎浑化而无迹者矣。是吾自少至老，无一念而不在学，无一时而不在于学，故其所得与年而俱进，过此以往，未之或知矣。”夫圣人生知安行，本无积累之渐，犹自言其进德之序如此，然则希圣希天者，岂可少懈于日新之功哉！"},
          {"originalText": "孟懿子问孝，子曰：“无违。”", "explain": "孟懿子，是鲁国的大夫。违，是违悖。孟懿子尝问于孔子说：“人子事亲，如何才叫做孝？”孔子答说：“孝亲之道，只在无违而已。”孔子所谓无违，是说人子事亲，有个当然不易的道理，不可有一些违悖，不是说从亲之令，便谓之孝也。只因懿子不能再问，故孔子未及明言其意耳。"},
          {"originalText": "樊迟御，子告之曰：“孟孙问孝于我，我对曰‘无违’。”", "explain": "樊迟，是孔子弟子。御，是御车。孟孙，即是懿子。孔子因懿子不能再问，怕他错认做从亲之令，便是无违。故因樊迟御车，乃告他说：“孟孙曾问孝于我，我对说孝在无违。”盖欲启樊迟之问，以发明所言之意也。"},
          {"originalText": "樊迟曰：“何谓也？”子曰：“生，事之以礼；死，葬之以礼，祭之以礼。”", "explain": "礼，是天理之节文。樊迟闻孔子之言，就问说，如何叫做无违。孔子答说：“所谓无违，只是不违乎礼而已。”盖人子事亲，心虽无穷，而分则有限，随其尊卑上下，各有一定的礼节。如父母在生之时，凡朝夕定省，左右奉养，都依着这礼。亲没之时，凡殡葬之具，必诚必信，也都依着这礼。到祭祀之时，外则备物，内则尽志，又都依着这礼。自始至终，无一毫苟且之意，这才是无违，才叫做孝。若礼所当为而不肯为，则谓之简而不敬其亲。礼不当为而必欲为，则谓之僭，而陷亲于有过，是岂得谓之孝哉！当时鲁国大夫僭用君上之礼，故孔子以是警之。盖自天子以至于庶人，皆当以孝为本，以礼为节，不可有太过不及之弊也。"},
          {"originalText": "孟武伯问孝，子曰：“父母唯其疾之忧。”", "explain": "孟武伯，是孟懿子之子，名彘。问于孔子说：“人子事亲，如何才是孝。”孔子说：“欲知人子事亲之理，当观父母爱子之心。凡人父母，未有不爱其子者，惟爱之也切，故忧之也深。常恐其有疾病，或起居之不时，或饮食之不节，或风寒暑湿之见侵，与夫少之未戒于色，壮之未戒于斗之类。凡足以致疾者，皆切切然以为忧。若为子者能体父母之心，慎起居，节饮食，戒色戒斗，兢兢焉不至于疾，以贻父母之忧，则自然身体康宁，而有以慰亲之心矣。岂不可谓之孝乎！”孔子之意，盖以武伯生于富贵之家，长于逸乐之地，易以致疾而忧其亲，故因问而警之如此。至若天子以一身而为天地神人之主，其所以培养寿命，而昌延国祚者，又当万倍于此矣。孔子之言，岂特为孟武伯告哉！"},
          {"originalText": "子游问孝。子曰：“今之孝者，是谓能养，至于犬马，皆能有养。不敬，何以别乎！”", "explain": "子游，是孔子弟子，姓言名偃。养，是饮食供奉。别，是分别。子游问于孔子说：“人子事亲，如何叫做孝？”孔子答说：“子之事亲，固要饮食供奉，以养其口体。然必内有尊敬的诚心，外有恭敬的礼节，然后可以言孝。如今世俗之所谓孝者，只是说能以饮食供奉父母便了，殊不知饮食供奉，岂但父母为然，虽至于犬马之贱，一般与他饮食，都能有以养之。若事亲者，不能尽尊敬奉承的道理，而徒以饮食供奉为事，则与那养犬马的何所分别乎？”然则世俗之所谓孝者，不足以为孝也。夫子游圣门高弟，何至以犬马待其亲，而孔子犹告戒之如此者，盖凡父母之于子，怜悯姑息之情常胜，故子之于父母狎恩恃爱之意常多，其始虽无轻慢之心，其后渐成骄傲之习，遂至于无所忌惮，不顾父母者有之。孔子之言，所以深究人情之偏，而预防其渐也。若推其极，则必如帝舜之以天下养而夔夔斋栗，文王之问安视膳，而翼翼小心，然后谓之能养能敬，而为天下之大孝也与！"},
          {"originalText": "子夏问孝。子曰：“色难。有事，弟子服其劳；有酒食，先生馔，曾是以为孝乎？”", "explain": "色，是容。先生，是父兄之称。子夏问于孔子说：“人子事亲，如何才叫做孝。”孔子答说：“事亲之际，惟是有那愉悦和婉的容色，最为难能。盖人之色，生于心者也。子于父母，必有深爱笃孝之心根于中，而后有愉悦和婉之色著于外。是凡事皆可以勉强，而色不可以伪为，所以为最难，事亲有此而后可谓之真孝也。若夫父兄有事，为子弟的替他代劳，子弟有酒饭，将来与父兄饮馔，此则力之所可勉，而事之无难为者，曾是而可以为孝乎！”前章子游问孝，夫子教以敬亲。此章子夏问孝，夫子教以爱亲。盖子游、子夏都是圣门高弟，其于服劳供奉之礼，不患其不尽，但恐其敬爱之心未能真切恳至耳，故皆言此以警之。使知事亲之道不在于文，而在于实，不当求之于外，而当求之于心也。凡为人子者，宜深思焉。"},
          {"originalText": "子曰：“吾与回言终日，不违如愚。退而省其私，亦足以发，回也不愚。”", "explain": "回，是孔子弟子颜回。不违，是意不相背。愚，是昏愚。退，是退去。省，是察。私，是私居。发，是发明。孔门弟子，惟颜回最能悟道。故孔子抑扬其词，以称之说：“世间有上等聪明的人，凡事无所疑惑，不须问难，也有昏愚的人，心里不会疑惑，不知问难。这两等人，其心虽异，其迹则同。今我与颜回，终日间讲论道理，不止一端。他只是默然听受，不曾有一些相背，也未尝有一语问难。看他气象，却似那昏愚无知的一般。及其退去之时，我省察他间居独处的去处。但见他一动一静，一语一默，都是我所言的道理，躬行实践，件件都发挥出来，乃知回之不违者，是其心领神会，见道分明，无所疑而不必问，非不能疑而不知问也。”然则回也岂真昏愚者哉！然颜子既是上智，又能好学，故其悟道之妙，至于如此。若未及颜子者，必须能疑而知问，然后可以讲明义理，开发聪明，而进于圣贤之域也。"},
          {"originalText": "子曰：“视其所以，观其所由，察其所安，人焉廋哉？人焉廋哉？”", "explain": "以字，解做为字。由，是意所从来。安，是心所喜乐。廋，是藏匿。孔子说：“人不可以不知人，而知之甚难，然亦自有个法则。”盖人之所为，非善则恶，必须先看他所为的何如？为善的便是君子。若为恶，便是小人，其大略可知也。所以说视其所以。夫所为之不善者，固不必言，而所为善者，亦未知其出于诚实否也。故又当观其意之所从来者如何？果真心实意而为己者欤？抑饰貌伪言以欺人者欤？果出于心之真实则善矣，不然，则亦伪耳，岂得为君子哉！夫所由之不善者，固不足言，而所谓善者，亦未知其出于自然否也。故又当察其心之所乐者如何。果中心好之而无所矫强者欤？抑或畏威怀利而有不得不然者欤？果出于心之所乐，则善矣，不然则亦暂为之耳，岂能久而不变哉！夫自以而由，而安，在人者既从外而深探其内。自视，而观而察，在我者又因略而渐致其详。虽是人藏其心，不可测度，然能饰所以而逃吾之视，必不能饰所由而逃吾之观，能饰所由而逃吾之观，必不能饰所安而逃吾之察。人何得而藏匿之哉？人何得而藏匿之哉？重言之者，以见其必不能隐也。孔子观人之法如此。人君明此以观察臣下之行事心术，则凡为正为邪，为忠为佞皆莫逃于坐照之下矣。"},
          {"originalText": "子曰：“温故而知新，可以为师矣。”", "explain": "温，是温习。故，是旧所闻。新，是今所得。师，是师范。孔子说：“天下之义理无穷，而人之闻见有限。若专靠记问，则胸中所得，能有几何？若能于旧日所闻的时时温习，如读过的《诗》、《书》，听过的讲论，都要反复玩味，而不使遗忘，又能触类旁通，每有新得，就是未曾知道的，也都渐渐理会过来。将见义理日益贯通，学问日益充足。人有来问的，便能与之应答而不竭。有疑惑的，便能与之剖析而无遗矣。岂不可以为人之师矣乎？”此可见君子之学，不以记诵为工，而在于能明乎理，不以闻见为博，而在于善反诸心，学者不可以不勉也。"},
          {"originalText": "子曰：“君子不器。”", "explain": "器，是器皿。孔子说：“人有一材一艺的，非无可用，然或宜于小，不宜于大。能于此，不能于彼。譬如器皿一般，虽各有用处，终是不能相通，非全才也。惟是君子的人，识见高明，涵养深邃，其体既无所不具，故其用自无所不周。大之可以任经纶匡济之业，小之可以理钱谷甲兵之事，守常达变，无往不宜，岂若器之各适于用，而不能相通者哉！所以说君子不器。”夫此不器之君子，是乃天下之全才。人君得之固当大任，至于一材一艺者，亦必因人而器使之，不可过于求备也。"},
          {"originalText": "子贡问君子。子曰：“先行其言，而后从之。”", "explain": "子贡问于孔子说：“君子是成德之人。学者如何用功才到得这个地位。”孔子答说：“凡人言常有余，行常不足。若未行先言，则言行不相照顾，如何成得君子。惟君子的人，凡事务躬行实践。如子臣弟友之道，仁义礼智之德。凡是口所欲言的，一一先见之于行，无一毫亏欠，然后举其所行者，从而言之，议论所发，件件都实有诸己，而不为空言也。是行常在于言前，言常在于行后，岂不为笃实之君子乎！”孔子因子贡多言，故警之以此，其实躬行君子常少，言不顾行者常多。学者之省身固当敏于行而慎于言，人君之用人，亦当听其言而观其行也。"},
          {"originalText": "子曰：“君子周而不比，小人比而不周。”", "explain": "周，是普遍。比，是偏党。孔子说：“君子、小人，固皆有所亲厚，但其立心不同，故其所亲厚亦异。盖君子之心公，惟其公也，故能视天下犹一家，视众人犹一身。理所当爱的，皆有以爱之，而不必其附于己；恩所当施的，即有以施之，而不待其求于己。是其与人亲厚周偏广阔，而不为偏党之私，此所以为君子也。至于小人则不然，盖小人之心私，惟其私也。故惟有势者则附之，有利者则趋之，或喜其意见之偶同，而任情以为好，或乐其同恶之相济而交结以为援。是其与人亲厚偏党私暱而无有乎普遍之公，此所以为小人也。”夫周与比其迹相似，而其实不同，只在此心公私之间而已，欲辨君子、小人者，可不慎察于此哉！"},
          {"originalText": "子曰：“学而不思则罔，思而不学则殆。”", "explain": "罔，是昏而无得。殆，是危而不安。孔子教人说：“天下的道理，散在万事，而统会于吾心。惟其散于万事，故必加致知格物、躬行实践的工夫，而后能实有诸己，这叫做学；惟其会于一心，故必加沉潜反复，研究求索的工夫，而后能穷其精微，这叫做思。这两件阙一不可。若徒知务学，而不思索其义，则理不明于心，其所学者，不过卤莽之粗迹，终于昏昧而已，所以说学而不思则罔；若徒知思索，而不用力于学，则功不究其实，其所思者不过想像之虚见，终于危殆而已，所以说思而不学则殆。”可见学必要思，学了又能思，则所学的方才透彻；思必要学，思了又能学，则所思的方才着实。二者偏废，则各有其弊矣。求道者可不知所务哉！"},
          {"originalText": "子曰：“攻乎异端，斯害也已。”", "explain": "攻，是专治。非圣人之道而别为一端者，叫做异端。如杨氏、墨氏，及今道家、佛家之类，皆是害，是伤害。孔子说：“自古圣人继往开来，只是一个平正通达的道理，其伦则君臣、父子、夫妇、长幼、朋友，其德则仁、义、礼、智、信，其民则士、农、工、商，其事则礼、乐、刑、政。可以修己，可以治人。世道所以太平，人心所以归正，都由于此。舍此之外，便是异端，便与圣人之道相悖。人若惑于其术，专治而欲精之，造出一种议论，要高过乎人，别立一个教门，要大行于世，将见其心既已陷溺，其说必然偏邪，以之修己，便坏了自己的性情；以之治人，便坏了天下的风俗。世道必不太平，人心必不归正，其害有不可胜言者，所以说斯害也已。”当时杨墨之道，犹未盛行，然孔子深恶而预绝之如此。至于后世道家之说，全似杨朱；佛家之说，全似墨翟，尤足以眩惑人心，而伤害世道。深信而笃好，如宋徽宗、梁武帝者，不免丧身亡国，为后世之所非笑。则异端之为害，岂非万世之所当深戒哉！"},
          {"originalText": "子曰：“由！诲女，知之乎？知之为知之，不知为不知，是知也。”", "explain": "由，是孔子弟子仲由，字子路。诲，是教诲。子路好勇，凡事只要胜人，盖有强不知以为知者。故孔子呼其名而告之说：“由也有志于知，我今教汝，以求知之道乎。盖人于天下之义理有所知，必有所不知。自家心里本是明白，有不可得而自昧者，若但以有所不知为耻，而遮护隐讳，不论知不知，都强以为知，这便是欺了自家的心，而知有所蔽矣。汝但于所知的，即认以为已知，于所不知的，即说是我尚未知。则虽不能尽知天下之理，而此心不敢自欺，于真知的本体，不曾昏昧，这就是知的道理了，何必无所不知而后谓之知乎！所以说是知也。”此可见天下之道理无穷，虽圣人亦有不能尽知者，但圣人之心，至虚至明，固不以不知者自强，亦不以已知者自是，故稽众从人，好问好察，此尧舜之知所以为大也。"},
          {"originalText": "子张学干禄。", "explain": "子张，是孔子弟子，姓颛孙，名师。干，是求。昔子张从学于圣门，以干求俸禄为意。"},
          {"originalText": "子曰：“多闻阙疑，慎言其余，则寡尤；多见阙殆，慎行其余，则寡悔。言寡尤，行寡悔，禄在其中矣。”", "explain": "疑，是所未信者。尤，是罪过。殆，是所未安者。悔，是懊悔。凡言在其中者，皆不求而自至之辞。孔子教子张说道：“君子学以为己，不可有干禄之心，且学自有得禄之理，亦不必容心以求之也。若能多闻天下之理，以为所言之资，而于多闻之中有疑惑而未信的，姑阙之而不敢言。其余已信的，又慎言而不敢轻忽，则所言皆当，而人无厌恶，外来的罪过自然少了，岂不寡尤。多见天下之事，以为所行之资，而于多见之中，有危殆而未安的，姑阙之而不敢行。其余已安的，又慎行而不敢怠肆，则所行皆当，而己无愧怍，心里的懊悔自然少了，岂不寡悔。言能寡尤，行能寡悔，便是有德的贤人。名誉昭彰，必有举而用之者，虽不去干求那俸禄，而俸禄自在其中矣。又何必先有求之之心哉！”尝观古之学者，修其言行，而禄自从之，是以世多敬事后食之臣；后之学者，言行不修，而庸心干禄，是以世少先劳后禄之士。然则学术之所系，诚非细故矣。作民君师者，可不以正士习为先务乎！"},
          {"originalText": "哀公问曰：“何为则民服？”孔子对曰：“举直错诸枉，则民服；举枉错诸直，则民不服。”", "explain": "哀公，是鲁国之君。举，是举用。直，是正直的君子。错，是舍置而不用。诸字，解做众字。枉，是邪枉的小人。鲁哀公问于孔子说：“人君以一身而居乎群臣百姓之上，不知何所作为，才能使众人每个都心服？”孔子对说：“人君若要服民，不是严刑可以驱之，小惠可以结之者，只要顺民好恶之公心而已。大凡臣下有心术光明行事端慎的，便是正直君子，必然人人爱敬他，望他得位行道。有心地奸险，行事乖方的，便是邪枉小人，必然人人憎恶他，怕他误国害民。这是好善恶恶的良心，人之所同有也。人君若能举用那正直的君子，授之以政，而凡邪枉的小人都舍置之，不使参于其间，则用舍各当，正合了人心好恶之公，百姓每自然欢欣爱戴，无一人之不服矣！若人君举用了邪枉的小人，使之在位，而凡正直的君子，却舍置之不能有所简拔，则用舍颠倒，便拂了人心好恶之公，百姓每必然心非口议，虽欲强其服从而不可得矣！”夫民之服与不服，只在用舍之公与不公，然则人君于用人之际，可不慎哉。"},
          {"originalText": "季康子问：“使民敬、忠以劝，如之何？”子曰：“临之以庄则敬，孝慈则忠，举善而教不能则劝。”", "explain": "季康子，是鲁国的大夫。敬，是恭敬。忠，是尽心不欺的意思。劝，是劝勉。季康子问于孔子说：“为人上者要使百姓每敬事于我而不敢慢，尽忠于我而不敢欺，相劝于为善而不敢为恶，果何道以使之乎？”孔子答说：“为民上者，不可要诸在人，只当尽其在我。诚能于临民之时，容貌端庄，而无有惰慢，则有威可畏，有仪可象，民之得于瞻仰者，自然敬畏而不敢怠慢矣！孝以事亲而无有悖违；慈以使众而无有残刻，则其德既足以为民之表，而其恩又足以结民之心。民之得观感者，自能尽忠于我，而不敢欺悖矣。于那为善的，举而用之，使他得行其志。不能的，教诲他使之为善，不要轻弃绝之。如此，则善者益进于善，而不怠、不能者亦将勉强企及，而无有不劝者矣。”是则季康子之问，专求诸民。孔子之答，专求诸己。盖人同此理，吾能自尽其理，而人岂有不感化者哉！"},
          {"originalText": "或谓孔子曰：“子奚不为政？”", "explain": "奚字，解做何字。为政，是出仕而理国政。鲁定公初年，孔子不仕，或人问于孔子说：“夫子有这等抱负，正当乘时有为，何故不肯出仕而理国政乎？”盖当时季氏擅权，阳虎作乱，不能尊信孔子，故孔子不肯轻于求仕，而或人不知也。"},
          {"originalText": "子曰：“《书》云‘孝乎惟孝，友于兄弟，施于有政。’是亦为政，奚其为为政？”", "explain": "《书》，是《周书·君陈》篇。友，相亲爱的意思。孔子不仕之意有难以告人者，故只托词以答之说。汝疑我之不肯为政，岂不闻《周书》所言之孝乎？他说“君陈”能孝顺父母，友爱兄弟。又能推此孝友之心，以为一家之政，使长幼尊卑都欢然和睦，肃然整齐，无有不归于正者。《书》之所言如此。这等看来，人处家庭之间，能帅人以正，就是为政了。何必居官任职，乃谓之为政乎！盖所谓政者，只是正人之不正而已，施之于国，使一国的人，服从教化，固是为政，修之于家，使一家之人，遵守礼法，也是为政。这虽是孔子托词，其实道理不过如此。所以《大学》说“欲治其国者，先齐其家”，亦是此意。然则人君之为政，若能以孝友之德，修身正家，则治国平天下之道，岂外是哉！"},
          {"originalText": "子曰：“人而无信，不知其可也。大车无輗，小车无軏，其何以行之哉？”", "explain": "信，是诚实。大车，是平地任载的车。輗，是辕前的横木，缚轭以驾牛者。小车，是田车、兵车、乘车。軏，是辕上的曲木，钩衡以驾马者。孔子说：“立心诚实，乃万事的根本，人若无了信实，便事事都是虚妄，吾不知其如何而可也。何也，人必有信而后可行，譬如车必有輗軏，而后可行也。若大车无，则无以驾牛；小车无軏，则无以驾马。轮辕虽具，一步也运动不得，其何以行之哉？若存心不诚，言语无实，则人皆贱恶之。在家则不可行于家，在国则不可行于国，盖无所往而不见阻矣，与车无輗軏者，何以异哉！”孔子此言，只是要人言行相顾，事事着实，不可少有虚妄的意思。然信之一字，尤为人君之大宝，是以为治者，必使政教号令之出，皆信如四时，无或朝更而夕改，然后民信从，而天下治也。孔子之言，岂非万世之明训哉！"},
          {"originalText": "子张问：“十世可知也？”", "explain": "凡朝代更换，叫做一世。子张问于孔子说：“有一代之兴，必有一代的事迹。但已往者易见，将来者难知，不知自今以后，朝代兴亡，至于十世之远，其事迹亦可得而前知否乎？”"},
          {"originalText": "子曰：“殷因于夏礼，所损益可知也；周因于殷礼，所损益可知也；其或继周者，虽百世可知也。”", "explain": "因，是相袭而不改。礼，是君臣、父子、夫妇之三纲。仁义礼智信之五常，这其中都有节文，故叫做礼。损，是减损。益，是增益。孔子答子张说：“后之视今，亦犹今之视昔。要知将来，但观既往便可知矣。比先夏有天下四百余年，而殷汤继之。殷家所行之礼，如修人纪以正万邦，都只是因袭夏家的，不曾改易。至于制度文为，有余不足的，则或损或益，稍有不同。如殷道尚质，殷正建丑之类，是其所因与所损益，可考而知也。殷有天下六百余年，而周文武继之。周家所行之礼，如建皇极以锡庶民，也只是依着殷家的，不曾变更。至于制度文为，太过不及的，则或损或益，也有不同。如周道尚文，周正建子之类，是其所因与所损益，亦可考而知也。此可见纲常伦理，是立国的根本，万世不可改易。制度文为，是为治的节目，随时可以变通，自今以后，或有继我周而王天下的，其所因与所损益，不过如此。虽百世之远，无不可知，岂但十世而已哉！”"},
          {"originalText": "子曰：“非其鬼而祭之，谄也。见义不为，无勇也。”", "explain": "非其鬼，是所不当祭的鬼神。谄，是求媚的意思。义，是事之宜，凡道理上所当行的便是。勇，是勇敢。孔子说：“人之祭享鬼神，各有其分。如天子祭天地，诸侯祭山川，大夫祭五祀，庶人祭其先，是乃当然之分，祭之可也。若是不当祭的鬼神也去祭他，这便是谄媚鬼神以求福利，不是孝享的正礼，所以谓之谄也。人于道理上当为的事，便着实做将去，这才是有勇。若真见得这事是道理所当为的，却乃因循退缩，不能毅然为之，这是委靡不振，无勇往直前之气，怯懦甚矣，所以谓之无勇也。”夫此二者，一则不当为而为，一则当为而不为。孔子并举而言之者，盖欲人不惑于鬼神之难知，而专用力于人道之所宜也。"}]
        ]
    },
    {
        "chapterName": "八佾第三",
        "introduction": "凡二十六章。通前篇末二章皆论礼乐之事。",
        "paragraphs": [
          [{"originalText": "孔子谓：“季氏八佾舞于庭，是可忍也，孰不可忍也。”", "explain": "季氏，是鲁国大夫。佾，是乐舞的行列。古者乐舞之数，天子用八行，每行八人，叫做八佾。诸侯六佾，大夫四佾。各有等差，不容僭越。当初成王以周公有大勋劳，特赐天子礼乐以祭周公之庙，其后世群公都因循僭用，已是失礼。季氏，是鲁桓公子孙，他在家庙中祭祖，也僭用八佾之舞于庭，故孔子非之说：“礼莫严于名分，罪莫大于僭窃。夫祭用生者之爵禄，乃我王朝一定之礼。季氏本是大夫，只该用四佾之舞，而今乃用八佾之舞于家庙之庭，则是以大夫而僭天子礼，法之所不容诛，罚之所必及，人臣之罪孰有大于此者。这等大罪也都容忍过了，不加纠正，则别样的小罪，孰不可忍乎！”盖鲁以相忍为国，凡事惟务姑息含忍，而其弊乃至于下陵其上，臣僭其君，礼法荡然，冠屦倒置如此。盖优柔姑息之过也，故孔子非之。其后孔子为司寇，摄相事，即堕三都以强公室，陈恒弑其君，则沐浴而朝，请兵讨之，此可以观圣人之志矣。而鲁终不能用。卒之三家共分公室，政在陪臣，而周公之祚遂衰矣。然则纪纲法度，有国者其可一日而不振举之乎！"},
          {"originalText": "三家者以《雍》彻。子曰：“‘相维辟公，天子穆穆’，奚取于三家之堂？”", "explain": "三家，是鲁国的大夫孟孙、叔孙、季孙之家。雍，是《周颂》篇名。彻，是彻馔。相，是助祭。辟公，是诸侯。穆穆，是深远的意思。“相维辟公，天子穆穆。”是《雍》诗中两句说话。昔者周天子祭祀宗庙，祭毕之时，则歌《雍》诗以撤馔。及鲁大夫孟孙、叔孙、季孙祭其家庙，于收俎豆的时节，也歌《雍》诗，是僭用天子之礼矣。故孔子讥之，说道：“《雍》诗中有云‘相维辟公，天子穆穆’，是说天子宗庙之中，助祭的是列国的诸侯，主祭者是天子，其敬德之容，则穆穆然幽深而玄远。盖本天子之事，故于撤馔歌之，道其实也。今三家之堂，助祭者不过陪臣，亦有辟公之相助乎？主祭者不过大夫，亦有天子之穆穆乎？既无此事，则何取于此义而歌之于堂乎？是不惟僭妄可恶，而其无谓亦甚矣。”盖礼所以辨上下之分，不可毫发僭差，人臣而敢僭用君上之礼，则妄心一生，何所不至。攘夺之祸，必由此起。孔子前一节非季氏之舞八佾，此一节讥三家之歌《雍》诗，皆所以立万世人臣之大防也。"},
          {"originalText": "子曰：“人而不仁，如礼何？人而不仁，如乐何？”", "explain": "仁，是心之德，敬而将之以仪文，叫做礼。和而达之于声容，叫做乐。如礼何？如乐何？譬如说没奈他何一般，是不相为用的意思。孔子说：“仁之在人，乃本心之全德，人能全此心德，使心里常是恭敬，则行出来的仪文便都是礼。心里常是和平，则播之于声容，便都是乐。”是礼不虚行，必仁人而后可行也。人而不仁，则其心放逸而不能敬，礼之本先失了。那陈设的玉帛，升降的威仪，不过是虚文耳。礼岂为之用乎？所以说如礼何。乐不徒作，必仁人而后能作也。人而不仁，则其心乖戾而不和。乐之本先失了，那钟鼓之声，羽旄之舞不过是虚器耳，乐岂为之用乎？所以说如乐何。盖礼乐不可斯须而或去，人心不可顷刻而不存，欲用礼乐者，求之心焉可也。"},
          {"originalText": "林放问礼之本。子曰：“大哉问！礼，与其奢也，宁俭；丧，与其易也，宁戚。”", "explain": "林放，是鲁国人。易，是节文习熟。戚，是哀痛。鲁人有林放者，见世人行礼，繁文太盛，以为制礼之初意，恐不如此，故问礼之本于孔子。孔子以时俗方逐末，而放独究心于礼之本，可谓不为习俗所移，而有志于返本复古者矣，所以称美之说：“大哉汝之问也！夫礼之全体有质有文。譬如饮食之礼，起初只是太羹、玄酒，汗尊抔饮而已，这叫做本质。先王以为太简，始制为笾豆簠簋之器，揖让周旋之仪，这叫做文。又如居丧之礼，起初只是伤痛哭泣，思慕悲哀而已，这叫做本质。先王以为太直，始制为擗踊哭泣之节，衰麻服制之等，这叫做文。文质得中，乃礼之全体，到后来习俗日侈，却只在仪文节度上究心，而制礼之初意，荡然无存矣。然则今之礼者，与其趋尚繁华，而流为奢侈，宁可敦崇朴素，而失于俭啬。盖俭啬无文，虽未合于礼之中，而犹不失为淳古之风，是即本之所在也。所以说与其奢也，宁俭。居丧者与其习熟于仪节，而无惨怛之诚，宁可过于哀痛，而少品节之制。盖徒戚虽未合于礼之中，而犹自率其天性之真，是即本之所在也。所以说与其易也，宁戚。”夫曰宁俭，曰宁戚，皆孔子不得已而矫俗之意。盖天下事物，每自质而趋文。而世之将衰，必多文而灭质。故孔子他日赞易，又以用过乎俭，丧过乎哀为言，而其论礼乐，则曰吾从先进。皆厌周末文盛而欲矫之以合于中也。有维持世教之责者，尚鉴兹哉！"},
          {"originalText": "子曰：“夷狄之有君，不如诸夏之亡也。”", "explain": "夷狄，是化外之地。东夷、西戎、南蛮、北狄，总叫做夷狄。诸夏，是中国。诸，是众。夏，是大。以其人民众而地方大，故称诸夏。亡字，与有无的无字同。当孔子时，季氏以大夫僭用八佾，三家以大夫僭歌《雍》诗，上下陵夷，不知有君臣之分。故孔子一日叹息说道：“中国所以尊于夷狄者，以其名分定而上下不乱也。今夷狄之国，在上的统领其下，在下的顺从其上，尚且有个君长，到不似我中夏之国，君弱臣强，以诸侯胁天子者有之，以陪臣专国政者有之，恣为僭窃，反无上下之分也。”夫以中国同于夷狄，犹且不可，况反不如乎，可慨也已。孔子此言，岂真轻中国而称夷狄哉！盖甚为之词，以见上下之分，不可一日不明于天下也。"},
          {"originalText": "季氏旅于泰山。子谓冉有曰：“女弗能救与？”对曰：“不能。”子曰：“呜呼！曾谓泰山不如林放乎？”", "explain": "旅，是祭告。泰山，是东岳泰山，在鲁地。冉有，是孔子弟子冉求。救，是救正。古者祭祀之礼，天子祭天地，诸侯祭山川。泰山在鲁国境内，惟鲁君当祭。季氏是鲁大夫，也要行祭告之礼于泰山之神，则其越礼犯分，僭上无君甚矣。孔子以冉求是他的家臣，有匡救之责，故问他说：“季氏此一事，甚为非礼，汝为家臣，固宜尽言匡正。今乃坐视其失礼而不能救之与？”冉求对说：“他的意思已定，吾力不能挽回之也。”孔子于是叹息说：“季氏此举只要谄事鬼神，以求福佑，殊不知礼不可僭，神不可欺。且如林放，鲁人，也知问礼之本，不肯随俗。况泰山是五岳之尊，其神聪明正直，必然知礼，岂肯享季氏非礼之祭，而反不如林放之知礼乎？”是季氏之祭泰山，非惟分不当为，而且神必不享，则亦何益之有哉！孔子此言，一则要使季氏知其无益，犹可中止；一则要使冉求以不如林放为耻，而知所以自励也。"},
          {"originalText": "子曰：“君子无所争，必也射乎！揖让而升，下而饮，其争也君子。”", "explain": "争，是争竞。射，是大射之礼。升，是升堂。饮，是饮酒。孔子说：“有德行的君子，他心平气和，与人恭逊，无有争竞。求他有争竞处，必也观之于行射礼之时乎！盖射有中者，有不中者，中有多者，有少者，胜负相形，似乎有所争也。然观其将射之初，则三揖三让而后升堂。既射之后，则与那同射的人，都下堂来，胜者却揖那不胜者使他升堂，自取爵盏，立饮罚酒。射礼之行如此。是虽有胜负之相较量，然自始至终，雍容揖逊，是其争也，乃君子之争，非若小人专以血气相尚，而为角力之争也。夫以射才有争而其争又如此，则君子之无所争可见矣。”"},
          {"originalText": "子夏问曰：“‘巧笑倩兮，美目盼兮，素以为绚兮。’何谓也？”", "explain": "“巧笑倩兮”这三句都是逸诗之词。倩，是好口辅。盼，是黑白分明。素，是粉地。绚，是彩色。逸诗上说：“人于笑时，口辅端好，其眼目黑白分明，有此自然的美质，而又妆饰以华彩，就如素地上加以彩色的一般，愈为美好矣！”子夏未达素以为绚之旨，疑其反以素为饰，乃问于孔子说：“逸诗有言：‘巧笑倩兮，美目盼兮，素以为绚兮。’夫素则无文，绚乃华饰，今言素以为绚，其言果何谓也？”"},
          {"originalText": "子曰：“绘事后素。”", "explain": "绘，是绘画。孔子答子夏说：“诗言素以为绚，不是说素即是绚，乃是说因素为绚耳。如今绘画之工，必先有了质素的粉地，然后加以各样彩色，是素在于先，绚在于后。犹人之相貌，必先生得自然美好，然后可加以华饰也。”"},
          {"originalText": "曰：“礼后乎？”子曰：“起予者商也！始可与言《诗》已矣。”", "explain": "起予，是起发我之志意。商，是子夏的名。子夏一闻孔子之言，遂有悟于心，说道：“观绘画之事，素地在先，彩色在后，可见素而非绘，固无以备其文采，绘而非素，则虽有彩色亦将安施？然则世之所谓礼文者，其犹在于后乎？必有为之先者矣。”盖礼也者，因人情而为之节文者也。如玉帛交错，揖让周旋，宾礼也。然必先有恭敬之实心，而后以是将之，是敬在于先，礼在于后矣。又如擗踊哭泣，衰麻服制，丧礼也。然必先有哀痛之本情，而后以是节之，是哀在于先，礼在于后矣。故情实者素地也。礼文者彩色也，非礼，固无以为人情之节文。然苟情不至而徒求之于礼焉，是犹画者不先布素地，而欲施文采也，有是理乎？夫孔子以绘画明，素绚之意，不过只就书旨上发挥，而子夏礼后之言，则圣言之所未及者。可谓闻一知二，触类旁通者矣。故孔子喜而称之，说道：“能起发我之志意者，是汝商也。”盖诗人之言，其旨甚微，而寓意深远。善说诗者，能求之于言语之外，而不拘泥于文字之末，乃为得之，似你这等聪明颖悟，才可与论诗也已，盖深喜之之辞也。按此章之旨，与前章林放问礼之意，大略相同。林放求礼之本，而子夏以礼为后，皆有反本尚质，挽回世道之意。故孔子于林放则以大哉称之，于子夏则以启予许之，此又圣贤未发之旨也。学者宜致思焉。"},
          {"originalText": "子曰：“夏礼吾能言之，杞不足徵也；殷礼吾能言之，宋不足徵也。文献不足故也，足则吾能徵之矣。”", "explain": "杞、宋是二国名。杞，是夏之后。宋，是殷之后。文，是书籍。献，是贤人。徵字，解做证字。孔子说：“昔者禹有天下，其制度文章为有夏一代之礼者，我能言其大略，然必有证而后人信之。今夏之后代，虽有杞国尚存，然不足取以为证矣。汤有天下，其制度文章为有殷一代之礼者，我亦能言其大略，然亦必有证而后人信之。今殷之后代，虽有宋国尚存，然亦不足取以为证矣。盖礼非书籍不能记载，非贤人不能诵习。今夏殷二代，传世久远，杞宋两国世祚衰微，既无书籍可以考究，又无贤人可以谘访，将何所取以证吾之言耶！若使二国之书籍尚存，贤人未谢，则考究谘访皆有所据，而吾能取之以为证，人皆信之矣。惜乎！今之不能也。”盖孔子当时，欲斟酌三代之礼，以立万世常行之法，而夏殷不可考，故为是叹息之词如此。然三纲五常古今不易，所损所益，百世可知，则二代之礼又不以杞宋无徵而遂泯也。有仪礼制度之责者，宜究心焉。"},
          {"originalText": "子曰：“禘自既灌而往者，吾不欲观之矣。”", "explain": "禘，是祭祀之名。古者天子既祭其始祖，又推始祖所自出之帝，祭于太庙，而以始祖配之，这礼五年一举，叫做禘。成王以周公有大勋劳，赐鲁重祭，使鲁国以周公为始祖，以文王为所自出之帝，而以周公配之，故鲁国得禘祭其先。然以诸侯而僭行天子之祭，实为非礼也。灌，是奠酒于地以降神。往字，解做后字。孔子说：“我鲁国君臣举行禘祭，我也曾在太庙中，观其行礼何如，但是他未曾降神之先，诚敬尚在，犹有可观。及到那灌地降神之后，君臣之间都懈怠了，虽有陈设的俎豆，升降的威仪，全是虚文，无一些恭敬诚恪的意思。到这时节，我之心不欲观之矣。”夫鲁国本是诸侯，僭用王者之大祭，已是失礼，及举祭之时，又不诚敬，是失礼之中又失礼焉。故孔子叹之如此。"},
          {"originalText": "或问禘之说。子曰：“不知也。知其说者之于天下也，其如示诸斯乎！”指其掌。", "explain": "示，与看视的视字同。斯字，解做此字。掌，是手掌。或人见鲁国尝行禘祭之礼，而不知当初制礼之意，故以禘之说问于孔子。孔子以禘乃国家之重典，先王所以报本追远之意，其妙固未易言。况又是王者之大祭，鲁国因循而僭用之，其失又所当讳。这意思有难以显言者，故只答他说：“不知也。盖以禘之为祭，礼仪重大，意义深远，知之甚不易也。若有能知其说的，则理无不明，诚无不格，识见自是广阔，精神自会运量，看得天下的道理，灿然都在目前，岂不如视诸斯之至易乎！”门人遂记说：“夫子所谓视诸斯者，乃自指其手掌而言，以其明白易见，就如看自家的手掌一般，初无难事也。”此可见幽明只是一理，神人本无二道，幽而知所以事神，则明而治人，亦何难之有哉！然非先王不能作，亦非圣人不能知，如或人者，何足以语此，此孔子所以不轻告之也。"},
          {"originalText": "祭如在，祭神如神在。子曰：“吾不与祭，如不祭。”", "explain": "祭，是祭先祖。祭神，是祭外神。吾不与祭，如不祭，是孔子平日的言语。门人记说：“祭以诚为主，而他人则不能。惟吾夫子，观其在家祭先祖的时节，则孝心纯笃，就如先祖在上的一般。其在官祭外神的时节，则敬心专一，就如神明在上的一般。夫鬼神无形与声，岂真有所见，乃心极其诚，故如有所见耳。”考其平日尝说：“吾于祭祀，必亲行之，乃慊于心。若或有故，不得已，而使人代之，则不得以伸吾之孝敬，故礼虽已行，而此心缺然，还似不曾祭的一般。即此言观之，则其祭祀必致如在之诚可知矣。”这是门人记孔子祭祀之诚敬如此。若天子一身，为天地宗庙百神之主，尤不可不致其诚。所以古之帝王，郊庙之祭，必躬必亲，致斋之日，或存或著，然后郊则天神格，庙则人鬼享，而实受其福也。承大祭者，宜致谨焉。"},
          {"originalText": "王孙贾问曰：“‘与其媚于奥，宁媚于灶。’何谓也？”", "explain": "王孙贾，是卫大夫。媚，是亲顺。奥，是室之西南隅。灶，是灶神。古者夏月祭灶，必先祭主于灶陉。然后迎尸入奥，而设馔以祭。是祭于奥则似尊崇，祭于灶则似卑亵。故当时俗语说：“奥虽有常尊，而非祭之主，灶虽卑贱，然日用饮食所司，当时用事，所以说媚奥不如媚灶。”盖奥以比君之势分崇高，难以自结；灶以比臣之专权用事，容易干求。时俗之见，浅陋如此。王孙贾乃问孔子说：“俗语有云‘与其求媚于奥，宁可求媚于灶’。夫奥本尊崇，灶甚卑亵，今乃言媚奥不如媚灶，其意果何谓也？”贾疑孔子在卫，有求仕之心，欲求附己以进用，故以此讽之耳。"},
          {"originalText": "子曰：“不然。获罪于天，无所祷也。”", "explain": "获字，解做得字。祷，是祈祷。孔子答王孙贾说：“俗语所谓媚奥不如媚灶，我甚不以为然。盖天下之至尊而无对者，惟天而已。作善则降之以福，作不善则降之以祸，感应之理毫发不差。顺理而行，自然获福，若是立心行事，逆了天理，便是得罪于天矣。天之所祸，谁能逃之，岂祈祷于奥灶所能免乎！”此可见人当顺理以事天，非惟不当媚灶，亦不可媚于奥也。孔子此言，逊而不迫，正而不阿，世之欲以祷祀而求福者，视此可以为鉴矣！"},
          {"originalText": "子曰：“周监于二代，郁郁乎文哉！吾从周。”", "explain": "监字，解做视字。二代，指夏商。郁郁，是文盛的模样。孔子说：“比先夏商之有天下，固皆有一代的典章法度，但其立法未能尽善尽美，而其流弊亦皆偏向失中。自我周之兴，有文武为之君，周公为之相，于是监视夏商之礼，或损其太过，或益其不足，是以制度仪章纤悉具备，兄行于朝廷，施于邦国，达于闺门闾巷之间者，皆尽善尽美。郁郁乎文采之盛，殆非夏商所能及也。我也生周之世，为周之民，时王之制，固当遵承而不悖，况其礼文之盛又如此。然则吾之当从者，舍周其何适哉？所以说吾从周。”尝观孔子之在当时，礼乐则从先进，梦寐不忘周公，与夫修鲁史而尊天王，此其从周之志，有未尝一日忘者，所谓圣人之为下不倍也。然则生今之世而欲反古之道者，岂不谬哉！"},
          {"originalText": "子入太庙，每事问。或曰：“孰谓鄹人之子知礼乎？入太庙，每事问。”子闻之，曰：“是礼也。”", "explain": "太庙，是鲁周公之庙。鄹，是邑名。鄹人之子，指孔子说。孔子父叔梁纥，曾为鄹邑大夫。故当时叫孔子为鄹人之子。昔孔子仕鲁之时，尝陪祭于周公之庙，与执事焉。那庙中陈设的器数，如笾豆、玉帛之类，周旋的仪节，如灌献酬酢之类，每事都详细访问，却似不曾知道的一般，盖惟其敬之至，故其问之详如此。或人不知而疑之，说道：“鄹人之子孔丘，素以知礼见称于人，如今看来，谁说他知礼？”盖知者不待于问，问者必有不知。观他在太庙之中，事事都问过，则其不知礼也明矣。世固有无其实而有其名者乎！孔子闻而解之说道：“礼莫大于祭，祭莫先于敬。今太庙之中陈设的都是礼器，周旋的都是礼仪，若一毫知得不真，行得不当，便是轻忽放肆，而非所以为敬矣！今我每事访问者，正以对越奔走之际，当有恭敬严肃之心，固不敢强其所不知以为知，亦不敢恃其所已知而不问，是乃所以为礼也。或人之言，岂知我者哉！”此可见圣人之心极其敬慎，故祭祀之礼尤加谨严。圣人之心极其谦虚，故每事问人，不厌详细，其与尧之钦明，舜之问察，一而已矣。学圣人者，当于此求之。"},
          {"originalText": "子曰：“射不主皮，为力不同科，古之道也。”", "explain": "射，是射箭。皮，是皮革。射不主皮，这一句是《乡射礼》中的说话。科字，解做等字。孔子说：“《乡射礼》有云，射以观德。但主于中的，不必穿透皮革，然后为能。所以然者，盖为人之气力，有强有弱，其等不同。若必主皮，则惟强者能之，而弱者必不能矣。此所以不主皮也。然这是古昔盛时，尚德而不尚力，其道如此。今世衰礼废，列国兵争，惟以强力为尚，虽礼射亦主于贯革，而尚德之风，不可复见矣。”可胜叹哉！孔子思古伤今之意如此。"},
          {"originalText": "子贡欲去告朔之饩羊。", "explain": "告，是告庙。朔，是正朔。饩，是牲牢。古时天子以季冬颁来岁十二月之朔于诸侯。诸侯受而藏之祖庙。每遇月朔，则以特羊告庙，请而行之。鲁自文公以后，把这告朔之礼，废而不行了，而有司每月犹照常办备此羊。子贡以此礼今既不行，饩羊徒为靡费，故欲去之，以省费焉。是徒知一羊之可惜，而不知制礼之初意矣。"},
          {"originalText": "子曰：“赐也！尔爱其羊，我爱其礼。”", "explain": "爱，是爱惜。孔子呼子贡之名而晓之说：“赐也！尔之欲去乎饩羊者，岂以告朔之礼既废，饩羊之供无实。爱惜此羊而欲去之矣乎！自我观之，所爱尤有甚于羊者。盖正朔颁于天子，所以示天下之有君，告朔行于诸侯，所以示天下之有亲，最为礼之大者。今此礼虽废，而饩羊犹存，后之人，或有因羊以求礼，举而行之者，若将此羊一并去了，则告朔之礼，随羊以亡，自此天子不复颁朔，而人不知有君，诸侯不复视朔，而人不知有亲矣。是礼之亡不尤为可惜耶？”夫孔子之意在于存礼，而子贡之言，唯求省费，圣贤度量之广狭，用心之大小，区以别矣。"},
          {"originalText": "子曰：“事君尽礼，人以为谄也。”", "explain": "礼，是恭敬之见于仪文者，乃道理当然的去处。谄，是求媚。孔子说：“臣之于君，既有尊卑上下的定分，便自有恭敬奉承的定礼。这礼，是先王所制，万世通行，不可违越者也。今我之事君，心里极其敬谨，不敢有一毫轻慢，故每事依着礼节，不敢有一些差失，这不过尽那礼之当然者而已，非有加于礼之外也。时人不知，乃以为求媚取悦而然，是岂知事君之礼者乎！”盖当时公室衰微，强臣僭窃，上下之际，多不循礼，惟孔子欲明礼法以挽回之。如过位则色勃，升堂则屏气，违众而拜堂下，闻命而不俟车，这等循礼，当时反以为谄，则礼法之不明于天下可知。故孔子之言如此。然尽礼与谄，其迹相似，而其心不同。君子之事君，其礼固无不尽，然却不肯阿谀顺从，如责难以为恭，陈善以为敬，一心只要成就君上的美名，干办国家的大事，这便真是尽礼。小人之事君，外面虽似尽礼，然心里未必忠实，如阿顺以为容，逢迎以为悦，一心只要干求君上的恩宠，保全自家的官爵，这便真是谄媚。君子尽礼，小人以为谄，小人谄媚，亦自以为尽礼。心术之邪正，迥然不同，人君不可不察也。"},
          {"originalText": "定公问：“君使臣，臣事君，如之何？”孔子对曰：“君使臣以礼，臣事君以忠。”", "explain": "定公，是鲁国之君。礼，是有节文，不简慢的意思。忠，是竭尽己心，不欺罔的意思。定公一日问于孔子说：“为人君的使令臣下，为人臣的奉事君上，都有个道理，不知当如之何？”孔子对说：“为人君者，以尊临卑，易至于简慢忽略，若简慢忽略，便失了为君的道理，是以人君之于臣下，使之须要以礼。如使之为大臣，则待之如股肱；使之居言责，则待之如耳目；使之为将帅，则有推毂命将之礼；使之为使臣，则有皇华遣使之礼，务加以礼貌，待以至诚，这乃是使臣的道理。为人臣者，以下事上，易至于欺罔隐蔽。若欺罔隐蔽，便失了为臣的道理。是以人臣之于君上，事之须要以忠。如居辅导赞襄之职，则尽心以启沃，而一毫无所隐；有官守言责之寄，则尽心以纳忠，而一事不敢欺。遇有难处之事，则虽劳瘁而不辞；遇有患难之日，则虽致命而不避。务内尽其心，外尽其力，这乃是事君的道理。”君尽君道，固非有私于臣，而所以劝下之忠者，亦在是矣。臣尽臣道，固非有要于君，而所以报上之礼者，亦在是矣！上下交而德业成，天下其有不治者哉！"},
          {"originalText": "子曰：“《关雎》乐而不淫，哀而不伤。”", "explain": "《关雎》，是《国风》诗之首篇。孔子说：“凡乐音不和乐，则不足以畅意；不哀婉，则不能以感人。然又贵于得中，若乐之过，则有淫荡邪僻之声；哀之过，则有忧思燋杀之病，而失其性情之正矣。惟有《关雎》之诗，其发之咏歌，而被之管弦者，优柔平中，虽欣然和乐，而不至于淫荡，虽凄然哀婉，而不至于悲伤。听之使人欲心平，躁心释，而足以为养德之助，诚盛世之遗音也。”盖诗本性情，乐以彰德。《关雎》之诗，咏后妃之德也。昔周文王之妃太姒，有圣德，不妒忌，忧在进贤，不淫于色，旁求淑女以配君子。求之未得，至于寤寐反侧而不能安；求之既得，则以钟鼓琴瑟乐之而致其喜，其德之盛如此。故其发为声诗，自然中正和平，而无过淫过伤之病，是乐音之和，本于后妃柔顺之德，后妃之德，又本之文王刑于之化。学者玩其辞，审其音，则所以基化闺门，而御于家邦者，必有得于言意之表矣。"},
          {"originalText": "哀公问社于宰我，宰我对曰：“夏后氏以松，殷人以柏，周人以栗。曰，使民战栗。”", "explain": "哀公，是鲁君。社，是为坛以祭地。宰我，是孔子弟子。战栗，是恐惧的模样。哀公问于宰我说：“有国家者，必有社以祭地，不知其义何如？”宰我对说：“古之立社者，必栽树木。夏后氏立社，则以松树。殷人立社，则以柏树。周人立社，则以栗树。然所以用栗树者，取于战栗之义。盖戮人必于社，欲使民见之而战栗恐惧也。”夫祭地以报其功，乃立社之本意，至于所栽的树木，则各因其土之所宜，而非有取义于其间也。宰我不知而对，谬妄甚矣。"},
          {"originalText": "子闻之，曰：“成事不说，遂事不谏，既往不咎。”", "explain": "遂事，是事虽未成，而势不能已者。谏，是谏正。咎，是罪责。孔子闻宰我使民战栗之言，以其所对，既非先王立社之本意，又启鲁君杀伐之心，因厉言以责之曰：“大凡事之未成者，犹可以言语说之，若事既成者，说之何益？所以不说。事之未遂者，犹可以谏诤止之，若事既遂者，谏之何益？所以不谏。事之未往者，犹可咎而罪之，若事之既往，咎之何益？所以不复追咎。今汝使民战栗之言，已出之口，而告之于君，是事之已成，已遂，已往者也。吾又何以责汝乎！”孔子以为不足责者，正所以深责之，欲其知言之不可妄发，而致谨于将来耳。"},
          {"originalText": "子曰：“管仲之器小哉？”", "explain": "管仲，是齐大夫，名夷吾。器，指人之局量规模说。器小，譬如说小家样。管仲相齐桓公，九合诸侯，一匡天下。当时皆以为莫大之功，然出于权谋功利之私，而不本于圣贤大学之道。故孔子讥之说：“管仲虽有大功，然其为人，局量褊浅，规模狭隘，没有正大光明的气象，其器不亦小哉！”盖深责备之词也。"},
          {"originalText": "或曰：“管仲俭乎？”曰：“管氏有三归，官事不摄，焉得俭？”", "explain": "三归，是台名。摄字，解做兼字。孔子以管仲为器小，或人不知而疑之说：“吾闻俭约之人，凡事吝啬，却似器小的模样。夫子以管仲为器小，得非以其俭约而然乎？”孔子答说：“凡人俭约者，必能制节谨度。今管仲筑三归之台，以为游观之所，其兴作之靡费可知。又多设官属，使每人各治一事，不相兼摄，其廪禄之冗滥可知。观其行事如此，岂得谓之俭乎？夫以俭为器小，失之远矣。”"},
          {"originalText": "“然则管仲知礼乎？”曰：“邦君树塞门，管氏亦树塞门。邦君为两君之好，有反坫，管氏亦有反坫。管氏而知礼，孰不知礼？”", "explain": "邦君，是有国的诸侯。树，是门屏。塞，是遮蔽。好，是宴会。坫，是放酒杯的案。凡宾主献酬饮毕，必反置酒杯于此，故谓之反坫。孔子斥管仲为非俭。或人又不知而疑之，说道：“吾闻知礼之人，凡事备具，不肯苟简，却似奢侈的模样，然则管仲之不俭，得非以知礼而然乎！”孔子答说：“礼莫大于名分，分莫大于君臣，不可一毫僭差者也。且如有国的诸侯，才得设屏于门，以蔽内外，非大夫所宜有者。今管氏也设屏于门以蔽内外，与邦君一般，其僭礼一也。诸侯为两国的宴会，那时献酬，有反爵之坫，非大夫所宜用者。今管氏也有反爵之坫，与邦君一般，其僭礼二也。这等僭上，决不是知礼的人。若说管氏知礼，则天下之人，谁是不知礼者乎？”盖人之器量大小，固不在于行事之广狭。大禹恶衣菲食，不害为圣。周公之富，不病其奢。或人既以器小为俭，又以不俭为知礼，其心愈惑，而失之愈远矣。然孔子竟亦未明言器小之意，岂或人之浅陋，不足以语此欤？"},
          {"originalText": "子语鲁大师乐，曰：“乐其可知也。始作，翕如也；从之，纯如也，皦如也，绎如也，以成。”", "explain": "语，是告语。鲁大师，是鲁国掌乐之官。翕，是合。从，是放。纯，是和。皦，是明白。绎，是相续不绝的意思。成，是乐之一终。当时鲁国衰微，音乐废阙，乐官多失其职者。故孔子告鲁大师以作乐之道说：“汝为典乐之官，必知道乐之节奏，然后可以作乐。今先王之乐，犹未尽亡，其始终条理之妙，可得而知也。吾试为汝言之。盖乐有六律、五声、八音，有一不备，不足以言乐。故始作之时，必须声音律吕，件件都全，而翕然其合焉。然备而不和，亦不足以言乐，故乐之既放，必须清浊高下，皆中其节，而纯然其和焉。和，则易至于混乱，又必一音自为一音，而皦然其明白。皦，则易至于间断，又必众音相为起伏，而绎然其连续。夫翕合之后有纯和，纯和之中有明白，明白之中无间断。自始至终，曲尽条理节奏之妙，是乃乐之一成也。由此而至于九成，其道理不过如此，汝太师岂可以不知乎？”盖声音之道，与政相通，不但可以养人之性情，而亦可以移易天下之风俗，所系甚重。故孔子自卫反鲁，既汲汲于正乐，而其于太师，又谆谆以告戒之如此。"},
          {"originalText": "仪封人请见，曰：“君子之至于斯也，吾未尝不得见也。”从者见之。出曰：“二三子何患于丧乎？天下之无道也久矣，天将以夫子为木铎。”", "explain": "仪，是卫邑名。封人，是掌封疆之官。见，是相见。从者，是随从，孔子的门人。丧，是失位去国。木铎，是古人施政教时，用以警众的器具。其器金口木舌，摇之则有声，即今之铃是也。昔孔子周流四方，到卫国之仪邑，有个掌封疆的官，来请见说：“敬贤者，吾之素心。凡贤人君子来到这地方，我必求见，未尝拒我而不得见也。今夫子幸至于此，独不容我一见乎？”门人以其求见之诚，为之引见于孔子。封人既见孔子而出，乃对门人说：“夫子之失位去国，固其一时之不遇，然二三子何必以此为忧乎？盖治乱相因，是乃必然之数，而易乱为治，必待非常之人。今世教陵夷，人心陷溺，天下之无道，亦已久矣。世无终乱之理，必当复治。吾观夫子之道德，正可以易乱而为治者。天生斯人，岂是偶然，必将使之得位行道，施政教于四方，以开生民之耳目，以觉天下之愚昧，就如那警众的木铎一般，岂终于不遇也哉！”夫圣人盛德感人，能使封人尊敬而笃信之如此。然当时列国之君，不能委国而授之以政。至于辙环天下，卒老于行，此春秋之时，所以终不能挽而为唐虞之世也欤！"},
          {"originalText": "子谓《韶》：“尽美矣，又尽善也。”谓《武》：“尽美矣，未尽善也。”", "explain": "韶，是舜的乐名。武，是武王的乐名。尽美，是说声容到极盛的去处。尽善，是说盛美之中到极妙的去处。门人记说：“自古帝王有成功盛德于天下，则必作乐以宣之，故观乐之情文，便可以知其功德，然其间自有不同。吾夫子尝说，帝舜之乐，叫做《大韶》。他作于绍尧致治之后，其声音舞蹈至于九成，固极其盛美而可观矣。然不但尽美，而美之中又极其善焉。盖舜以生知安行之圣人，雍容揖逊而有天下，故心和气和，而天地之和应之。至于格神人，舞鸟兽，其妙有不可形容者，所以说又尽善也。武王之乐，叫做《大武》。他作于伐暴救民之日，其节奏行列，至于六成，固极其盛美而可观矣。然就其美之中而求之，则有未极其善者焉。盖武王以反身修德之圣人，征诛杀戮而得天下，故虽顺成和动之内，未免有发扬蹈厉之情，比于韶乐，则微有所不足者，所以说未尽善也。”然孔子此言，虽评论古乐之不同，而二圣之优劣，亦可概见矣。"},
          {"originalText": "子曰：“居上不宽，为礼不敬，临丧不哀，吾何以观之哉？”", "explain": "孔子说：“凡事有本，必得其本，而后其末有可观。且如宽弘简重，乃居上之体也；恭敬严肃，乃行礼之实也；伤痛悲哀，乃临丧之道也。这都是本之所在，有其本，则推之于行事者，自然可观。若使居上的，苛刻琐碎，而不知宽弘之大体；行礼的怠惰简慢，而无恭敬之实意；临丧的专事矫饬，而无哀痛之真情，则其本已先失了。虽其政教号令之施、进退周旋之节，缞麻擗踊之文，未必尽无可观。然大本既失，则末节无可言者，吾何以观之哉？”盖甚言其不足取也。盖当时王道不举，而苛政至子残民，古礼不复，而繁文至于灭质，故孔子矫时之敝如此。"}]
        ]
    },
    {
        "chapterName": "八佾第三",
        "introduction": "凡二十六章。通前篇末二章皆论礼乐之事。",
        "paragraphs": [
          []
        ]
    }
]
