[
  {
    "chapterName": "学而第一",
    "introduction": "此为书之首篇，故所记多务本之意乃入经之门，积德之基，学者之先务也。凡十六章。",
    "paragraphs": [
      [
        {
          "originalText": "子曰：“学而时习之，不亦说乎！”",
          "explain": "学，是仿效。凡致知力行，皆仿效圣贤之所为，以明善而复其初也。习，是温习。说，是喜悦。孔子说道：“人之为学，常苦其难而不悦者，以其学之不熟，而未见意趣也。若既学矣，又能时时温习而不间断其功，则所学者熟，义理浃洽，中心喜好，而其进自不能已矣。所以说不亦说乎！”"
        },
        {
          "originalText": "“有朋自远方来，不亦乐乎？”",
          "explain": "朋，是朋友。乐，是欢乐。夫学既有得，人自信从，将见那同类的朋友皆自远方而来，以求吾之教诲。夫然则吾德不孤，斯道有传，得英才而教育之，自然情意宣畅可乐，莫大乎此也。所以说不亦乐乎！"
        },
        {
          "originalText": "“人不知而不愠，不亦君子乎！”",
          "explain": "愠，是含怒的意思。君子，是成德的人。夫以善及人，固为可乐，苟以人或不见知，而遂有不乐焉，则犹有近名之累，其德未完，未足以为君子也。是以虽名誉不著而人不知我，亦惟处之泰然，略无一毫含怒之意。如此则其心纯乎为己，而不求人知，其学诚在于内，而不愿乎外，识趣广大，志向高明，盖粹然成德之人也。所以说不亦君子乎！夫学，由说以进于乐，而至于能为君子，则希贤希圣，学之能事毕矣！"
        }
      ],
      [
        {
          "originalText": "有子曰：“其为人也孝弟，而好犯上者，鲜矣；不好犯上而好作乱者，未之有也。”",
          "explain": "有子，是孔子弟子，姓有，名若。善事父母，叫做孝；善事兄长，叫做弟。犯，是干犯。鲜，是少。作乱，是悖逆争斗的事。有子说：“天下的人莫不有父母兄长，则莫不有孝弟的良心。人惟不能孝弟，则其心不和不顺，小而犯上，大而作乱，无所不至矣。若使他平昔为人，于父母则能孝，尽得为子的道理，于兄长则能弟，尽得卑幼的道理，则心里常是和顺，而所为自然循礼，若说他敢去干犯那在上的人，这样事断然少矣。”夫犯上，是不顺之小者，且不肯为，却乃好为悖逆争斗大不顺的事，天下岂有是理哉！夫人能孝弟而自不为非如此，可以见孝弟之当务矣。"
        },
        {
          "originalText": "“君子务本，本立而道生。孝弟也者，其为仁之本与！”",
          "explain": "务，是专力。本，是根本。为仁，是行仁。有子又说：“天下之事，有本有末，若徒务其末，则博而寡要，劳而无功。所以君子凡事只在根本，切要处专用其力。根本既立，则事事物物处之各当，道理自然发生，譬如树木一般。”根本牢固，则枝叶未有不茂盛者。本之当务如此。则吾所谓孝弟也者，乃是行仁之本与。盖仁具于心，只是恻怛慈爱的道理，施之爱亲敬长，固是此心推之仁民爱物，亦是此心。人能孝弟，则亲吾之亲，可以及人之亲，长吾之长，可以及人之长，至于抚安万民，养育万物，都从此充拓出来，而仁不可胜用矣！然则行仁之本，岂有外于孝弟乎！学者务此，则仁道自此而生矣！《孝经》孔子说：“爱敬尽于事亲，而德教加于百姓，刑于四海，此天子之孝也。”有若之言，其有得于孔子之训欤？"
        }
      ],
      [
        {
          "originalText": "子曰：“巧言令色，鲜矣仁！”",
          "explain": "巧，是好。令，是善。鲜字，解做少字。仁，是心之德。孔子说：“辞气容色，皆心之符，最可以观人。那有德的人，辞色自无不正。若乃善为甘美之辞，迁就是非，便佞阿谀，而使听之者喜，这便是巧言。务为卑谄之色，柔顺侧媚，迎合人意，而使见之者悦，这便是令色。这等的人，其仁必然少矣。”盖仁乃本心之德，心存，则仁存也。今徒致饰于外，务以悦人，则心驰于外，而天理之斫丧者多矣，岂不鲜仁矣乎！然孔子所谓鲜仁，特言其丧德于己耳。若究其害，则又足以丧人之德。盖人之常情，莫不喜于顺己。彼巧言令色之人，最能逢迎取悦，阿徇取容，人之听其言，见其貌者，未有不喜而近之者也。既喜之而不觉其奸，由是变乱是非，中伤善类，以至覆人之邦家者，往往有之矣！夫以尧舜至圣，尚畏夫巧言令色之孔壬，况其他乎！用人者不可不察也。"
        }
      ],
      [
        {
          "originalText": "曾子曰：“吾日三省吾身，为人谋而不忠乎？与朋友交而不信乎？传不习乎？”",
          "explain": "曾子，是孔子弟子，名参。省，是省察。忠，是尽心的意思。信，是诚实。传，是传授。习，是习熟。曾子说：“我于一日之间，常以三件事省察己身。三者维何？凡人自己谋事，未有不尽其心者，至于为他人谋，便苟且粗略，而不肯尽心，是不忠也。我尝自省，为人谋事，或亦有不尽其心者乎？交友之道，贵于信，若徒面交，而不以实心相与，是不信也。我尝自省，与朋友交，或亦有虚情假意，而不信于人者乎？受业于师，便当习熟于己，若徒面听，而不肯着实学习，是负师之教也。我尝自省，受之于师者，或亦有因循怠惰，而不加学习者乎？以此三者，自省察其身，有则改之，无则加勉，盖未尝敢以一日而少懈也。”盖曾子之学，随事精察而力行之，故其用功之密如此。然古之帝王，若尧之兢兢，舜之业业，成汤之日新又新，检身不及，亦此心也，此学也。故《大学》曰：“自天子以至于庶人，壹是皆以修身为本。”从事于圣学者，可不知所务哉！"
        }
      ],
      [
        {
          "originalText": "子曰：“道千乘之国，敬事而信，节用而爱人，使民以时。”",
          "explain": "道，是治。乘，是兵车。四马驾一车，叫做一乘。千乘之国，是地方百里，可出兵车千乘的大国。时，是农功闲暇之时。孔子说：“千乘的大国，事务繁难，人民众多，不易治也。”若欲治之，其要道有五件。其一要敬事。盖人君日有万几，一念不敬，或贻四海之忧，一时不敬，或致千百年之患。必须兢兢业业，事无大小，皆极其敬慎，不敢有怠忽之心，则所处皆当，而自无有于败事矣。其一要信。盖信者，人君之大宝，若赏罚不信，则人不服从，号令不信，则人难遵守。必须诚实不贰，凡一言一动都要内外相孚，始终一致，而足以取信于人，则人皆用情，而自不至于欺罔矣。其一要节用。盖天地生财止有此数，用若不节，岂能常盈。必须量入为出，加意撙节。凡奢侈的用度，冗滥的廪禄，不急的兴作，无名的赏赐都裁省了。只是用其所当用，则财常有余，而不至于匮乏矣。其一要爱人。盖君者，民之父母，不能爱人，何以使众。必须视之如伤，保之如子，凡鳏寡孤独、穷苦无依的，水旱灾伤、饥寒失所的，都加意周恤，使皆得遂其生，则人心爱戴，而仰上如父母矣。其一要使民以时。盖国家有造作营建，兴师动众的事，固不免于使民，然使之不以其时，则妨民之业，而竭民之力矣。必待那农事已毕之后，才役使他，不误他的耕种，不碍他的收成，则务本之民，皆得以尽力于田亩，而五谷不可胜食矣。这五者都是治国的要道，若能体而行之，则四海之广，兆民之众，治之无难，岂特千乘之国而已哉！为人君者，所当深念也。"
        }
      ],
      [
        {
          "originalText": "子曰：“弟子入则孝，出则弟，谨而信，泛爱众而亲仁。行有余力，则以学文。”",
          "explain": "弟子，是指凡为弟为子的说。谨，是行的有常。信，是言的有实。泛字，解做广字。众，是众人。亲，是亲近。仁，是仁厚有德的人。余力，是余剩的工夫。文，是《诗》、《书》六艺之文。孔子教人说：“但凡为人弟为人子的，入在家庭之内，要善事父母以尽其孝；出在宗族乡党之间，要善事兄长以尽其弟。凡行一件事，必慎始慎终，而行之有常；凡说一句话，必由中达外，而发之信实。于那寻常的众人都一体爱之，不要有憎嫌忌刻之心；于那有德的仁人却更加亲厚，务资其熏陶切磋之益。这六件，是身心切要的工夫。学者须要着实用力，而不可少有一时之懈。若六事之外，尚有余力，则学夫《诗》、《书》六艺之文。”盖《诗》、《书》所载，皆圣贤教人为人之道，而礼、乐、射、御、书、数亦日用之不可阙者。未有余力，固不暇为此，既有余工，则又不可不博求广览，以为修德之助也。先德行而后文艺，弟子之职，当如此矣。然孔子此言，虽泛为弟子者说，要之上下皆通。古之帝王，自为世子时，而问安视膳，入学让齿，以至前后左右，莫非正人，礼乐诗书，皆有正业，亦不过孝弟、谨信、爱众、亲仁与夫学文之事也。至其习与性成，而元良之德具，万邦之贞，由此出矣。孔子之言，岂非万世之明训哉！"
        }
      ],
      [
        {
          "originalText": "子夏曰：“贤贤易色，事父母能竭其力，事君能致其身，与朋友交言而有信。虽曰未学，吾必谓之学矣。”",
          "explain": "子夏，是孔子弟子，姓卜名商，字子夏。上一个贤字解做好字，下一个贤字，是有德的贤人。易，是移易。竭，是尽。致其身，是委弃其身，不肯爱惜的意思。子夏说：“人之为学，只在纲常伦理上见得明白，才是根本切要的工夫。如人之见贤，谁不知好，但不能着实去好他。若使贤人之贤，而能移易其好色之心，大贤则事之为师，次贤则亲之为友，真知笃信，就如好好色的一般，则好善极其诚矣。人于父母，谁无孝心，但未能着实去尽孝，若使委曲承顺，尽那为子的道理，凡力量到得的去处，都竭尽而无遗，则事亲极其诚矣。事君不可以不忠，但人都自爱其身，则其忠必不尽。若能实心任事，把自家的身子，委弃于君，虽烦剧也不辞，虽患难也不避，一心只是要忠君报国，而不肯求便其身图，则事君极其诚矣。交友不可以不信，但轻诺者多，全信者少，若能诚心相与，但与朋友说的都是着实的言语，内不欺己，外不欺人，虽久远而不至于失信，则交友极其诚矣。这四件都是人伦之大者，而行之皆尽其诚，这就是见道分明，践履笃实的去处，学问之道不过如此。人虽说他未曾为学，我必谓之已学矣。若使未尝学问，而但出于资性之聪明，则不过一事之偶合，一时之袭取而已，岂能事事尽美，而厚于人伦如是乎。此可见古人之为学，皆用力于根本切要之地，而不专在于言语文字之末也。”"
        }
      ],
      [
        {
          "originalText": "子曰：“君子不重则不威，学则不固。主忠信，无友不如己者。过则勿惮改。”",
          "explain": "重，是厚重。威，是威严。固，是坚固。忠信，是诚实。无字、勿字都是禁止之辞。惮，是畏难的意思。孔子说：“君子为学必养成个深厚凝重的气质，然后外貌威严，而所学的道理自然坚固。若是轻浮浅露，不能厚重，则见于外者，无威之可畏，而其所学者亦不能实有诸己，虽得之，必失之矣。岂能以坚固乎！然立身固要厚重，而存心又在忠信。人不忠信，则事皆无实，何以为学。故又当以诚实不欺为主，而无有一毫之虚伪，然后可以进德也。所交的朋友必胜过我的人，方为有益。若是不如我的，或便佞善柔之类，这样的人，不但无益而且有损，切不可与之为友也。人不能无过，而贵于能改。过而惮改，则过将日甚矣。所以但遇有过，或闻人谏正，或自家知觉，便当急急改之，不可畏其难改，而苟且以自安也。以厚重为质，以忠信为主，又辅之以胜己之人，行之以改过之勇，则内外人己，交养互发，而自修之功全矣。学者可不勉哉！”"
        }
      ],
      [
        {
          "originalText": "曾子曰：“慎终追远，民德归厚矣。”",
          "explain": "慎，是谨慎。终，是亲之既殁。追，是追思。曾子说：“人伦以亲为重，人之事生，或有能孝者，至于送终，则以亲为既死也，而丧葬之事不能尽礼者，多矣。初丧之时，或有能思念者，至于岁时既远，则其心遂忘，而祭祀之礼，不能尽诚者多矣。此皆民心之薄，由在上之人无以倡之也。若为上者能致谨于亲终之时，不徒哀而已，而每事尽礼，不使少有后日之悔。又能追思于久远之后，不徒祭而已，而致其诚敬，不敢少有玩怠之心，则己之德厚矣。由是百姓每，自然感化，皆兴仁孝之心。丧也，尽其礼；祭也，尽其诚，而其德亦归于厚矣。此可见孝者，人心之所同。君者，下民之表率。欲化民成俗者，可不知所以自尽也哉！”"
        }
      ],
      [
        {
          "originalText": "子禽问于子贡曰：“夫子至于是邦也，必闻其政，求之与，抑与之与？”",
          "explain": "子禽，姓陈名亢。子贡，姓端木名赐，都是孔子弟子。抑，是反语词。与，是疑词。子禽问于子贡说：“夫子周流四方，每到一国必然就知这一国的政事，果是夫子访求于人，然后得而闻之与？或是各国的君自以其政事说与夫子而知之与？”子禽之问，盖亦不善观圣人者矣！"
        },
        {
          "originalText": "子贡曰：“夫子温良恭俭让以得之，夫子之求之也，其诸异乎人之求之与！”",
          "explain": "其诸，是语词。子贡答子禽说“夫子所以得闻国政，不是夫子有心去求，也不是时君无故而与。盖夫子盛德充积于中，而光辉自发于外。故其容貌词气之间，但见其温而和厚，无一些粗暴；良而易直，无一些矫饰；恭而庄敬，无一些惰慢；俭而节制，无一些纵弛；让而谦逊，无一些骄傲。有这五者德容之盛，感动乎人，所以各国的君，自然敬之而不忽，信之而不疑。都把他国中的政事，可因可革的，来访问于夫子，故夫子因而闻之耳。就汝所谓求者而论之，这等样求，岂不异于他人之求之者与。盖他人之求必待访问于人而后得。夫子之闻政，则以盛德感人而自致，岂可以一概论哉！”子贡之言，不惟足以破子禽之疑，而使万世之下，犹可以想见圣人之气象，此所以为善言德行也。"
        }
      ],
      [
        {
          "originalText": "子曰：“父在观其志，父没观其行，三年无改于父之道，可谓孝矣。”",
          "explain": "志，是志向。行，是行事。三年，是言其久。孔子说“人子事亲，有承受而无专擅，有巽顺而无违拂，故当其父在之日，凡事都禀命而行，不敢自专，即欲知其人，亦但观其志向何如耳。其行事不可概见也。至于父没之后，则分得以自专，然后其行事昭然可见，得就其行而观之焉。然父没之后，虽凡事得以自专，而其所行，犹如父在之时，至于三年之久，亦不敢有所改易。斯则思亲之念，不渝于始终，顺亲之心，无间于存没，如是而后可谓之为孝也。否则虽能致敬于亲在之时，而不能不变于亲终之后，岂所谓终身而慕者乎。”抑孔子所谓无改于父之道，亦自其合于道而可以未改者言之耳。若于道有未合焉，则虽速改可也，何待三年！故善述其事孝也，克盖前愆亦孝也。观圣人之言者，不可以执一求之。"
        }
      ],
      [
        {
          "originalText": "有子曰：“礼之用，和为贵，先王之道斯为美，小大由之。”",
          "explain": "礼，是尊卑上下的礼节。和，是从容不迫的意思。斯字，解做此字，指和说。小大，是小事大事。由，是行。有子说：“礼之在人，如尊卑上下，等级隆杀，一定而不可易，其体固是至严。然其为用，必和顺从容，无勉强乖戾之意，乃为可贵。如君尊臣卑，固有定分，然情意也要流通。父坐子立，固有常规，然欢爱也要浃洽。这才是顺乎天理，合乎人情，而为礼之所贵者也。古先圣王之制礼，惟其皆出于和，此所以尽善尽美，万世无弊。凡天下之事，小而动静食息之间，大而纲常伦理之际，都率而行之，无所阻滞，礼之贵于和如此。”"
        },
        {
          "originalText": "“有所不行，知和而和，不以礼节之，亦不可行也。”",
          "explain": "承上文说，礼贵于和，则宜无不可行者。然也有行不得的，这是为何？盖所谓和者，是在品节限制之中，有从容自然之意，所以可行。若但知和之为贵而一于和，率意任情，侈然自肆，全不把那礼体来节制他，则是流荡忘返，而尊卑上下皆失其伦矣。如何可以行之哉？此可见礼之体虽严，而不至于拘迫，其用虽和，而亦不至于放纵。古之圣王，能以礼治身，而又能推之以治天下者，用此道也。"
        }
      ],
      [
        {
          "originalText": "有子曰：“信近于义，言可复也。恭近于礼，远耻辱也。因不失其亲，亦可宗也。”",
          "explain": "信，是约信。义，是事理之宜。复，是践言。恭，是恭敬。礼，是礼节。因，是依倚人的意思。亲，是有道义可亲近的人。宗，是主。有子说：“天下之事，必须谨之于初，而后可善其后。”如与人以言语相约，本是要践行其言，但其所言者，若不合于义理之宜，将来行不将去，则必至爽约失信矣！故起初与人相约之时，就要思量，必其所言者皆合乎天理之宜，而与义相近，则今日所言的，他日皆可见之于行，而自不至于失信矣。所以说言可复也。待人之礼，固当恭敬，然亦自有当然之节。若恭不中礼，则为足恭，而反以致人之轻贱矣。故凡施敬于人之时，就要斟酌，务合乎礼之节文，而不过其则。则内不失己，外不失人，自不至于卑贱而取羞辱矣。所以说远耻辱也。与人相依，本图交久，但所依的不是好人，则始虽暂合，终必乖离。故当其结交之初，就要审择，不可失了那有道义可亲近的人，则不但一时相依，自后亦倚靠得着，可以为宗而主之矣。所以说亦可宗也。此可见人之言行交际皆当谨之于始，而虑其所终。不然，则因循苟且之间，将有不胜其自失之悔者矣。"
        }
      ],
      [
        {
          "originalText": "子曰：“君子食无求饱，居无求安，敏于事而慎于言，就有道而正焉，可谓好学也已。”",
          "explain": "敏，是急速的意思。就，是亲近。有道，是有德的贤人。正，是考正。孔子说：“凡人之为学，厌怠者多，笃好者少，所以不能成就。惟君子之于学，专心致志，无一毫外慕之私。就是食以养生，也不去求饱；居以容身，也不去求安。盖志有所在而不暇及也。行事常患其不足，则勉力自强，汲汲然见之于行，不敢有一些怠缓。言语常患其有余，则谨慎收敛，讷讷然如不出口，不敢有一些放肆。这等样着实用功，必然有所得了。然犹不敢自以为是，又必亲近那有道德的贤人，以考正吾之是非，凡一言一行都要讲究得道理明白，不至于差谬而后已焉。夫志向已是精专，功夫已是切实，而又加以谦抑之心，常存不足之虑，盖真见夫义理之无穷，学问之有趣，其心欣慕爱乐，有不能自已者，这才是好学的人，所以说可谓好学也已。”学而至于能好，则聪明日开，闻见日广，进而为贤为圣，何难之有哉！《商书·说命篇》：“惟学逊志，务时敏。”《周颂》说：“学有缉熙于光明。”皆是此意，可见“好学”二字，不但学者之所当知，为人君者尤不可不加之意也。"
        }
      ],
      [
        {
          "originalText": "子贡曰：“贫而无谄，富而无骄，何如？”子曰：“可也。未若贫而乐，富而好礼者也。”",
          "explain": "谄，是卑屈。骄，是矜肆。可，是仅可而有所未尽之辞。乐，是安乐。好礼，是喜好礼节，自然循理的意思。子贡问于孔子说：“凡人贫者，易至于卑谄，富者易至于矜骄，此人情之常也。若能处贫而无卑屈之意，处富而无矜肆之心，这等的人其所得为何如？”孔子答说：“常人溺于贫富之中，多不能有以自守，故必有谄骄之病。今曰无谄无骄，则能自守，而于学亦有得矣，是亦可也。然而非其至者。盖贫而无谄，虽不为贫所困，然犹知有贫也，不如那贫而乐的人，心广体胖，欣然自忘其贫，是身虽处乎贫之中，而心已超于贫之外也。此岂无谄者之可及乎！富而无骄，虽不为富所溺，然犹知有富也。不如那富而好礼的人，乐善循理，初不自知其富，是身虽处乎富之中，而心已超乎富之外也。此岂无骄者之可及乎？”夫子答子贡之问如此，善许其所已能，而勉其所未至也。"
        },
        {
          "originalText": "子贡曰：“《诗》云‘如切如磋，如琢如磨’，其斯之谓与？”",
          "explain": "《诗》，是《卫风·淇澳》之篇。孔子既教子贡以贫而无谄者之不如贫而乐，富而无骄者之不如好礼。子贡闻言而悟，遂引《诗》以证之，说道：“《卫风·淇澳》之诗有言，君子之学，就如治骨角的，既切以刀锯，又磋以鑢铴，是已精而益求其精也。又如治玉石的，既琢以椎凿，又磨以沙石，是已密而益求其密也。诗人之言如此，其即夫子所言之谓与。”盖贫而无谄，我固自以为至矣，岂知无谄之外，更有所谓乐乎。富而无骄，我亦自以为足矣，岂知无骄之外，更有所谓好礼乎！可见道理本无终穷，学问不可自足，必如治骨角玉石者，求到至精至密之地而后可，《诗》言圣教何以异乎！子贡因论学而知《诗》如此，真可谓善悟者矣。"
        },
        {
          "originalText": "子曰：“赐也，始可与言《诗》已矣。告诸往而知来者。”",
          "explain": "赐，是子贡的名。往，是已曾说过的。来，是未曾言及的。孔子因子贡引《诗》证学，遂称许之说：“《诗》有三百篇之多，其言词微婉，意味深长，非有颖悟之资者，不足以说此也。如赐也才可与言诗也已矣。”盖处贫处富的道理，是我所已言的，切磋琢磨的意思，是我所未言的。今因我已言的道理，就知我未言的意思，这等样聪明的人，与之论诗，必能触类旁通，而不至于以词害意矣！岂不可与言《诗》矣乎。然子贡悟性虽高，而学力未至，犹不得闻性与天道之妙，此可见美质之难恃，而学问之当勉也。"
        }
      ],
      [
        {
          "originalText": "子曰：“不患人之不己知，患不知人也。”",
          "explain": "患，是忧患。孔子说：“君子之学，专务为己，而不求人知。”如上不见知于君，而爵位不显；下不见知于友，而名誉不彰。此务外好名者之所忧患也。君子则以为学问在己，知与不知在人，何患之有。惟是我不知人，则贤否混淆，是非颠倒。在上而用人，则不能辨其孰为可进，孰为可退。在下而交友，则不能辨其孰为有损，孰为有益。这是理有不明，心有所蔽，岂非人之所当深患者乎。然人才固未易知，知人最为难事。必居敬穷理，使此心至公至明，然后如镜之照物，好丑毕呈，如称之称物，低昂自定。欲知人者，尤当以清心为本也。"
        }
      ]
    ]
  },
  {
    "chapterName": "为政第二",
    "introduction": "凡二十四章。",
    "paragraphs": [
      [
        {
          "originalText": "子曰：“为政以德，譬如北辰，居其所而众星共之。”",
          "explain": "政，是法令，所以正人之不正者。德，是躬行心得的道理。北辰，是天上的北极。共，是向。孔子说：“人君居万民之上，要使那不正的人都归于正，必有法制禁令以统治之。这叫做政。然使不务修德以为行政之本，则己身不正，安能正人，虽令而不从矣。所以人君为政，惟要躬行实践，以身先之。如纲常伦理，先自家体备于身，然后敷教以化导天下；纪纲法度，先自家持守于上，然后立法以整齐天下，这才是以德而为政。如此，则出治有本，感化有机。由是身不出乎九重，而天下的百姓，自然心悦诚服，率从其教化。譬如北极，居天下之中，凝然不动，只见那天上许多星宿，四面旋绕，都拱向他。是人君修德于上，而恭己南面，就如北辰之居所一般，万民之观感于下，而倾心向化，就如那众星之拱极一般。”此古之帝王所以笃恭而天下平者，用此道也。图治者可不务修德以端，出治之本哉！"
        },
        {
          "originalText": "子曰：“《诗》三百，一言以蔽之，曰思无邪。”",
          "explain": "诗，是《诗经》。蔽字，解做盖字。思，是心思。无邪，是心思之正。孔子说：“《诗》之为经，凡三百篇。一篇自为一事，一事自有一义，可谓多矣。然就中有一句言语足以尽盖其义而无余。《鲁颂·駉》篇之词有曰：思无邪。”是说人之思念皆出于天理之正，而无人欲之邪曲也。只这一言就足以尽盖三百篇之义。盖诗人之言有美有刺。善者美之，所以感发人之善心；恶者刺之，所以惩创人之恶念。只是要人为善去恶，得其性情之正而已。人之心若能念念皆正，而无邪曲之私，则其所为，自然有善而无恶，有可美而无可刺，而诗人之所为以劝以惩者，包括而无遗矣。然则思无邪之一言，岂不可以尽盖三百篇之义乎。此可见学者必务知要，而其功莫切于慎思也。"
        },
        {
          "originalText": "子曰：“道之以政，齐之以刑，民免而无耻。”",
          "explain": "道，是率先引导的意思。政，是法制禁令。齐，是齐一。刑，是刑罚。孔子说：“人君之治天下，不过是要人为善，禁人为恶而已。”但出之有本，而致之有机。若不知本原所在，只把法制禁令去开导他。如事亲则禁约他不孝，事长则禁约他不弟，使之奉行遵守。其有不从教令的，便加之以刑罚，使一齐都归于孝弟，无有违犯。这等样治民，虽则能使民不敢为恶，然只是惧怕刑罚，苟免于一时，而其中不知愧耻，为恶的心依旧还在，岂能久而不犯乎！所以说民免而无耻。"
        },
        {
          "originalText": "“道之以德，齐之以礼，有耻且格。”",
          "explain": "德，是行道而有得。礼，是制度品节。耻，是愧耻。格字，解做至字。孔子说：“治以政刑，民固苟免而无耻矣。”若使君之导民，不徒以其法也，而皆本于躬行之实。如欲民兴孝，必先自尽孝道以事亲；欲民兴弟，必先自尽弟道以事长。如此，则民既有所观感而兴起矣。而其间所得有浅深厚薄之不一者，则又有礼以齐之。亲疏上下，都有个节文。日用云为，都有个仪则。使贤者不得以太过，不肖者不得以不及，而皆协于一焉。这等样治民，将见那百姓每良心自然感发，不但知恶之可耻，而绝不肯为，又且知善之当为，而皆力行以至于善矣。岂特求免刑罚而已乎！所以说，有耻且格，盖德礼政刑，固皆所以适于治之路，而出之有本末，获效有浅深，故孔子第而言之，欲为人君者，审其本末轻重之辨也。"
        },
        {
          "originalText": "子曰：“吾十有五而志于学，三十而立，四十而不惑，五十而知天命，六十而耳顺，七十而从心所欲，不踰矩。”",
          "explain": "从字，解做随字。踰，是过。矩，是为方的器具。孔子自序其从少至老，进学的次第，说道：“我从十五岁的时节，就有志于圣贤大学之道。凡致知力行之事，修己治人之方，都着实用功，至忘寝食。盖念念在此，而为之不厌矣。到三十的时节，学既有得，自家把捉得定，世间外物都动摇我不得，盖守之固，而无所事志矣。进而至于四十，则于事物当然之理，表里精粗，了然明白，无所疑惑。盖见之明，而无所事守矣。进而至于五十，则于天所赋的性命之理，有以充其精微，探其本原，而知乎所以然之故矣。又进而至于六十，则涵养愈久，而智能通微。闻人之言，方入乎耳，而所言之理，即契于心，随感随悟，无有违逆而不通者矣。又进而至于七十，则工夫愈孰而行能入妙，凡有所为，随其心之所欲，不待检点，无所持循而自然不越于规矩法度之外，盖庶几乎浑化而无迹者矣。是吾自少至老，无一念而不在学，无一时而不在于学，故其所得与年而俱进，过此以往，未之或知矣。”夫圣人生知安行，本无积累之渐，犹自言其进德之序如此，然则希圣希天者，岂可少懈于日新之功哉！"
        },
        {
          "originalText": "孟懿子问孝，子曰：“无违。”",
          "explain": "孟懿子，是鲁国的大夫。违，是违悖。孟懿子尝问于孔子说：“人子事亲，如何才叫做孝？”孔子答说：“孝亲之道，只在无违而已。”孔子所谓无违，是说人子事亲，有个当然不易的道理，不可有一些违悖，不是说从亲之令，便谓之孝也。只因懿子不能再问，故孔子未及明言其意耳。"
        },
        {
          "originalText": "樊迟御，子告之曰：“孟孙问孝于我，我对曰‘无违’。”",
          "explain": "樊迟，是孔子弟子。御，是御车。孟孙，即是懿子。孔子因懿子不能再问，怕他错认做从亲之令，便是无违。故因樊迟御车，乃告他说：“孟孙曾问孝于我，我对说孝在无违。”盖欲启樊迟之问，以发明所言之意也。"
        },
        {
          "originalText": "樊迟曰：“何谓也？”子曰：“生，事之以礼；死，葬之以礼，祭之以礼。”",
          "explain": "礼，是天理之节文。樊迟闻孔子之言，就问说，如何叫做无违。孔子答说：“所谓无违，只是不违乎礼而已。”盖人子事亲，心虽无穷，而分则有限，随其尊卑上下，各有一定的礼节。如父母在生之时，凡朝夕定省，左右奉养，都依着这礼。亲没之时，凡殡葬之具，必诚必信，也都依着这礼。到祭祀之时，外则备物，内则尽志，又都依着这礼。自始至终，无一毫苟且之意，这才是无违，才叫做孝。若礼所当为而不肯为，则谓之简而不敬其亲。礼不当为而必欲为，则谓之僭，而陷亲于有过，是岂得谓之孝哉！当时鲁国大夫僭用君上之礼，故孔子以是警之。盖自天子以至于庶人，皆当以孝为本，以礼为节，不可有太过不及之弊也。"
        },
        {
          "originalText": "孟武伯问孝，子曰：“父母唯其疾之忧。”",
          "explain": "孟武伯，是孟懿子之子，名彘。问于孔子说：“人子事亲，如何才是孝。”孔子说：“欲知人子事亲之理，当观父母爱子之心。凡人父母，未有不爱其子者，惟爱之也切，故忧之也深。常恐其有疾病，或起居之不时，或饮食之不节，或风寒暑湿之见侵，与夫少之未戒于色，壮之未戒于斗之类。凡足以致疾者，皆切切然以为忧。若为子者能体父母之心，慎起居，节饮食，戒色戒斗，兢兢焉不至于疾，以贻父母之忧，则自然身体康宁，而有以慰亲之心矣。岂不可谓之孝乎！”孔子之意，盖以武伯生于富贵之家，长于逸乐之地，易以致疾而忧其亲，故因问而警之如此。至若天子以一身而为天地神人之主，其所以培养寿命，而昌延国祚者，又当万倍于此矣。孔子之言，岂特为孟武伯告哉！"
        },
        {
          "originalText": "子游问孝。子曰：“今之孝者，是谓能养，至于犬马，皆能有养。不敬，何以别乎！”",
          "explain": "子游，是孔子弟子，姓言名偃。养，是饮食供奉。别，是分别。子游问于孔子说：“人子事亲，如何叫做孝？”孔子答说：“子之事亲，固要饮食供奉，以养其口体。然必内有尊敬的诚心，外有恭敬的礼节，然后可以言孝。如今世俗之所谓孝者，只是说能以饮食供奉父母便了，殊不知饮食供奉，岂但父母为然，虽至于犬马之贱，一般与他饮食，都能有以养之。若事亲者，不能尽尊敬奉承的道理，而徒以饮食供奉为事，则与那养犬马的何所分别乎？”然则世俗之所谓孝者，不足以为孝也。夫子游圣门高弟，何至以犬马待其亲，而孔子犹告戒之如此者，盖凡父母之于子，怜悯姑息之情常胜，故子之于父母狎恩恃爱之意常多，其始虽无轻慢之心，其后渐成骄傲之习，遂至于无所忌惮，不顾父母者有之。孔子之言，所以深究人情之偏，而预防其渐也。若推其极，则必如帝舜之以天下养而夔夔斋栗，文王之问安视膳，而翼翼小心，然后谓之能养能敬，而为天下之大孝也与！"
        },
        {
          "originalText": "子夏问孝。子曰：“色难。有事，弟子服其劳；有酒食，先生馔，曾是以为孝乎？”",
          "explain": "色，是容。先生，是父兄之称。子夏问于孔子说：“人子事亲，如何才叫做孝。”孔子答说：“事亲之际，惟是有那愉悦和婉的容色，最为难能。盖人之色，生于心者也。子于父母，必有深爱笃孝之心根于中，而后有愉悦和婉之色著于外。是凡事皆可以勉强，而色不可以伪为，所以为最难，事亲有此而后可谓之真孝也。若夫父兄有事，为子弟的替他代劳，子弟有酒饭，将来与父兄饮馔，此则力之所可勉，而事之无难为者，曾是而可以为孝乎！”前章子游问孝，夫子教以敬亲。此章子夏问孝，夫子教以爱亲。盖子游、子夏都是圣门高弟，其于服劳供奉之礼，不患其不尽，但恐其敬爱之心未能真切恳至耳，故皆言此以警之。使知事亲之道不在于文，而在于实，不当求之于外，而当求之于心也。凡为人子者，宜深思焉。"
        },
        {
          "originalText": "子曰：“吾与回言终日，不违如愚。退而省其私，亦足以发，回也不愚。”",
          "explain": "回，是孔子弟子颜回。不违，是意不相背。愚，是昏愚。退，是退去。省，是察。私，是私居。发，是发明。孔门弟子，惟颜回最能悟道。故孔子抑扬其词，以称之说：“世间有上等聪明的人，凡事无所疑惑，不须问难，也有昏愚的人，心里不会疑惑，不知问难。这两等人，其心虽异，其迹则同。今我与颜回，终日间讲论道理，不止一端。他只是默然听受，不曾有一些相背，也未尝有一语问难。看他气象，却似那昏愚无知的一般。及其退去之时，我省察他间居独处的去处。但见他一动一静，一语一默，都是我所言的道理，躬行实践，件件都发挥出来，乃知回之不违者，是其心领神会，见道分明，无所疑而不必问，非不能疑而不知问也。”然则回也岂真昏愚者哉！然颜子既是上智，又能好学，故其悟道之妙，至于如此。若未及颜子者，必须能疑而知问，然后可以讲明义理，开发聪明，而进于圣贤之域也。"
        },
        {
          "originalText": "子曰：“视其所以，观其所由，察其所安，人焉廋哉？人焉廋哉？”",
          "explain": "以字，解做为字。由，是意所从来。安，是心所喜乐。廋，是藏匿。孔子说：“人不可以不知人，而知之甚难，然亦自有个法则。”盖人之所为，非善则恶，必须先看他所为的何如？为善的便是君子。若为恶，便是小人，其大略可知也。所以说视其所以。夫所为之不善者，固不必言，而所为善者，亦未知其出于诚实否也。故又当观其意之所从来者如何？果真心实意而为己者欤？抑饰貌伪言以欺人者欤？果出于心之真实则善矣，不然，则亦伪耳，岂得为君子哉！夫所由之不善者，固不足言，而所谓善者，亦未知其出于自然否也。故又当察其心之所乐者如何。果中心好之而无所矫强者欤？抑或畏威怀利而有不得不然者欤？果出于心之所乐，则善矣，不然则亦暂为之耳，岂能久而不变哉！夫自以而由，而安，在人者既从外而深探其内。自视，而观而察，在我者又因略而渐致其详。虽是人藏其心，不可测度，然能饰所以而逃吾之视，必不能饰所由而逃吾之观，能饰所由而逃吾之观，必不能饰所安而逃吾之察。人何得而藏匿之哉？人何得而藏匿之哉？重言之者，以见其必不能隐也。孔子观人之法如此。人君明此以观察臣下之行事心术，则凡为正为邪，为忠为佞皆莫逃于坐照之下矣。"
        },
        {
          "originalText": "子曰：“温故而知新，可以为师矣。”",
          "explain": "温，是温习。故，是旧所闻。新，是今所得。师，是师范。孔子说：“天下之义理无穷，而人之闻见有限。若专靠记问，则胸中所得，能有几何？若能于旧日所闻的时时温习，如读过的《诗》、《书》，听过的讲论，都要反复玩味，而不使遗忘，又能触类旁通，每有新得，就是未曾知道的，也都渐渐理会过来。将见义理日益贯通，学问日益充足。人有来问的，便能与之应答而不竭。有疑惑的，便能与之剖析而无遗矣。岂不可以为人之师矣乎？”此可见君子之学，不以记诵为工，而在于能明乎理，不以闻见为博，而在于善反诸心，学者不可以不勉也。"
        },
        {
          "originalText": "子曰：“君子不器。”",
          "explain": "器，是器皿。孔子说：“人有一材一艺的，非无可用，然或宜于小，不宜于大。能于此，不能于彼。譬如器皿一般，虽各有用处，终是不能相通，非全才也。惟是君子的人，识见高明，涵养深邃，其体既无所不具，故其用自无所不周。大之可以任经纶匡济之业，小之可以理钱谷甲兵之事，守常达变，无往不宜，岂若器之各适于用，而不能相通者哉！所以说君子不器。”夫此不器之君子，是乃天下之全才。人君得之固当大任，至于一材一艺者，亦必因人而器使之，不可过于求备也。"
        },
        {
          "originalText": "子贡问君子。子曰：“先行其言，而后从之。”",
          "explain": "子贡问于孔子说：“君子是成德之人。学者如何用功才到得这个地位。”孔子答说：“凡人言常有余，行常不足。若未行先言，则言行不相照顾，如何成得君子。惟君子的人，凡事务躬行实践。如子臣弟友之道，仁义礼智之德。凡是口所欲言的，一一先见之于行，无一毫亏欠，然后举其所行者，从而言之，议论所发，件件都实有诸己，而不为空言也。是行常在于言前，言常在于行后，岂不为笃实之君子乎！”孔子因子贡多言，故警之以此，其实躬行君子常少，言不顾行者常多。学者之省身固当敏于行而慎于言，人君之用人，亦当听其言而观其行也。"
        },
        {
          "originalText": "子曰：“君子周而不比，小人比而不周。”",
          "explain": "周，是普遍。比，是偏党。孔子说：“君子、小人，固皆有所亲厚，但其立心不同，故其所亲厚亦异。盖君子之心公，惟其公也，故能视天下犹一家，视众人犹一身。理所当爱的，皆有以爱之，而不必其附于己；恩所当施的，即有以施之，而不待其求于己。是其与人亲厚周偏广阔，而不为偏党之私，此所以为君子也。至于小人则不然，盖小人之心私，惟其私也。故惟有势者则附之，有利者则趋之，或喜其意见之偶同，而任情以为好，或乐其同恶之相济而交结以为援。是其与人亲厚偏党私暱而无有乎普遍之公，此所以为小人也。”夫周与比其迹相似，而其实不同，只在此心公私之间而已，欲辨君子、小人者，可不慎察于此哉！"
        },
        {
          "originalText": "子曰：“学而不思则罔，思而不学则殆。”",
          "explain": "罔，是昏而无得。殆，是危而不安。孔子教人说：“天下的道理，散在万事，而统会于吾心。惟其散于万事，故必加致知格物、躬行实践的工夫，而后能实有诸己，这叫做学；惟其会于一心，故必加沉潜反复，研究求索的工夫，而后能穷其精微，这叫做思。这两件阙一不可。若徒知务学，而不思索其义，则理不明于心，其所学者，不过卤莽之粗迹，终于昏昧而已，所以说学而不思则罔；若徒知思索，而不用力于学，则功不究其实，其所思者不过想像之虚见，终于危殆而已，所以说思而不学则殆。”可见学必要思，学了又能思，则所学的方才透彻；思必要学，思了又能学，则所思的方才着实。二者偏废，则各有其弊矣。求道者可不知所务哉！"
        },
        {
          "originalText": "子曰：“攻乎异端，斯害也已。”",
          "explain": "攻，是专治。非圣人之道而别为一端者，叫做异端。如杨氏、墨氏，及今道家、佛家之类，皆是害，是伤害。孔子说：“自古圣人继往开来，只是一个平正通达的道理，其伦则君臣、父子、夫妇、长幼、朋友，其德则仁、义、礼、智、信，其民则士、农、工、商，其事则礼、乐、刑、政。可以修己，可以治人。世道所以太平，人心所以归正，都由于此。舍此之外，便是异端，便与圣人之道相悖。人若惑于其术，专治而欲精之，造出一种议论，要高过乎人，别立一个教门，要大行于世，将见其心既已陷溺，其说必然偏邪，以之修己，便坏了自己的性情；以之治人，便坏了天下的风俗。世道必不太平，人心必不归正，其害有不可胜言者，所以说斯害也已。”当时杨墨之道，犹未盛行，然孔子深恶而预绝之如此。至于后世道家之说，全似杨朱；佛家之说，全似墨翟，尤足以眩惑人心，而伤害世道。深信而笃好，如宋徽宗、梁武帝者，不免丧身亡国，为后世之所非笑。则异端之为害，岂非万世之所当深戒哉！"
        },
        {
          "originalText": "子曰：“由！诲女，知之乎？知之为知之，不知为不知，是知也。”",
          "explain": "由，是孔子弟子仲由，字子路。诲，是教诲。子路好勇，凡事只要胜人，盖有强不知以为知者。故孔子呼其名而告之说：“由也有志于知，我今教汝，以求知之道乎。盖人于天下之义理有所知，必有所不知。自家心里本是明白，有不可得而自昧者，若但以有所不知为耻，而遮护隐讳，不论知不知，都强以为知，这便是欺了自家的心，而知有所蔽矣。汝但于所知的，即认以为已知，于所不知的，即说是我尚未知。则虽不能尽知天下之理，而此心不敢自欺，于真知的本体，不曾昏昧，这就是知的道理了，何必无所不知而后谓之知乎！所以说是知也。”此可见天下之道理无穷，虽圣人亦有不能尽知者，但圣人之心，至虚至明，固不以不知者自强，亦不以已知者自是，故稽众从人，好问好察，此尧舜之知所以为大也。"
        },
        {
          "originalText": "子张学干禄。",
          "explain": "子张，是孔子弟子，姓颛孙，名师。干，是求。昔子张从学于圣门，以干求俸禄为意。"
        },
        {
          "originalText": "子曰：“多闻阙疑，慎言其余，则寡尤；多见阙殆，慎行其余，则寡悔。言寡尤，行寡悔，禄在其中矣。”",
          "explain": "疑，是所未信者。尤，是罪过。殆，是所未安者。悔，是懊悔。凡言在其中者，皆不求而自至之辞。孔子教子张说道：“君子学以为己，不可有干禄之心，且学自有得禄之理，亦不必容心以求之也。若能多闻天下之理，以为所言之资，而于多闻之中有疑惑而未信的，姑阙之而不敢言。其余已信的，又慎言而不敢轻忽，则所言皆当，而人无厌恶，外来的罪过自然少了，岂不寡尤。多见天下之事，以为所行之资，而于多见之中，有危殆而未安的，姑阙之而不敢行。其余已安的，又慎行而不敢怠肆，则所行皆当，而己无愧怍，心里的懊悔自然少了，岂不寡悔。言能寡尤，行能寡悔，便是有德的贤人。名誉昭彰，必有举而用之者，虽不去干求那俸禄，而俸禄自在其中矣。又何必先有求之之心哉！”尝观古之学者，修其言行，而禄自从之，是以世多敬事后食之臣；后之学者，言行不修，而庸心干禄，是以世少先劳后禄之士。然则学术之所系，诚非细故矣。作民君师者，可不以正士习为先务乎！"
        },
        {
          "originalText": "哀公问曰：“何为则民服？”孔子对曰：“举直错诸枉，则民服；举枉错诸直，则民不服。”",
          "explain": "哀公，是鲁国之君。举，是举用。直，是正直的君子。错，是舍置而不用。诸字，解做众字。枉，是邪枉的小人。鲁哀公问于孔子说：“人君以一身而居乎群臣百姓之上，不知何所作为，才能使众人每个都心服？”孔子对说：“人君若要服民，不是严刑可以驱之，小惠可以结之者，只要顺民好恶之公心而已。大凡臣下有心术光明行事端慎的，便是正直君子，必然人人爱敬他，望他得位行道。有心地奸险，行事乖方的，便是邪枉小人，必然人人憎恶他，怕他误国害民。这是好善恶恶的良心，人之所同有也。人君若能举用那正直的君子，授之以政，而凡邪枉的小人都舍置之，不使参于其间，则用舍各当，正合了人心好恶之公，百姓每自然欢欣爱戴，无一人之不服矣！若人君举用了邪枉的小人，使之在位，而凡正直的君子，却舍置之不能有所简拔，则用舍颠倒，便拂了人心好恶之公，百姓每必然心非口议，虽欲强其服从而不可得矣！”夫民之服与不服，只在用舍之公与不公，然则人君于用人之际，可不慎哉。"
        },
        {
          "originalText": "季康子问：“使民敬、忠以劝，如之何？”子曰：“临之以庄则敬，孝慈则忠，举善而教不能则劝。”",
          "explain": "季康子，是鲁国的大夫。敬，是恭敬。忠，是尽心不欺的意思。劝，是劝勉。季康子问于孔子说：“为人上者要使百姓每敬事于我而不敢慢，尽忠于我而不敢欺，相劝于为善而不敢为恶，果何道以使之乎？”孔子答说：“为民上者，不可要诸在人，只当尽其在我。诚能于临民之时，容貌端庄，而无有惰慢，则有威可畏，有仪可象，民之得于瞻仰者，自然敬畏而不敢怠慢矣！孝以事亲而无有悖违；慈以使众而无有残刻，则其德既足以为民之表，而其恩又足以结民之心。民之得观感者，自能尽忠于我，而不敢欺悖矣。于那为善的，举而用之，使他得行其志。不能的，教诲他使之为善，不要轻弃绝之。如此，则善者益进于善，而不怠、不能者亦将勉强企及，而无有不劝者矣。”是则季康子之问，专求诸民。孔子之答，专求诸己。盖人同此理，吾能自尽其理，而人岂有不感化者哉！"
        },
        {
          "originalText": "或谓孔子曰：“子奚不为政？”",
          "explain": "奚字，解做何字。为政，是出仕而理国政。鲁定公初年，孔子不仕，或人问于孔子说：“夫子有这等抱负，正当乘时有为，何故不肯出仕而理国政乎？”盖当时季氏擅权，阳虎作乱，不能尊信孔子，故孔子不肯轻于求仕，而或人不知也。"
        },
        {
          "originalText": "子曰：“《书》云‘孝乎惟孝，友于兄弟，施于有政。’是亦为政，奚其为为政？”",
          "explain": "《书》，是《周书·君陈》篇。友，相亲爱的意思。孔子不仕之意有难以告人者，故只托词以答之说。汝疑我之不肯为政，岂不闻《周书》所言之孝乎？他说“君陈”能孝顺父母，友爱兄弟。又能推此孝友之心，以为一家之政，使长幼尊卑都欢然和睦，肃然整齐，无有不归于正者。《书》之所言如此。这等看来，人处家庭之间，能帅人以正，就是为政了。何必居官任职，乃谓之为政乎！盖所谓政者，只是正人之不正而已，施之于国，使一国的人，服从教化，固是为政，修之于家，使一家之人，遵守礼法，也是为政。这虽是孔子托词，其实道理不过如此。所以《大学》说“欲治其国者，先齐其家”，亦是此意。然则人君之为政，若能以孝友之德，修身正家，则治国平天下之道，岂外是哉！"
        },
        {
          "originalText": "子曰：“人而无信，不知其可也。大车无輗，小车无軏，其何以行之哉？”",
          "explain": "信，是诚实。大车，是平地任载的车。輗，是辕前的横木，缚轭以驾牛者。小车，是田车、兵车、乘车。軏，是辕上的曲木，钩衡以驾马者。孔子说：“立心诚实，乃万事的根本，人若无了信实，便事事都是虚妄，吾不知其如何而可也。何也，人必有信而后可行，譬如车必有輗軏，而后可行也。若大车无，则无以驾牛；小车无軏，则无以驾马。轮辕虽具，一步也运动不得，其何以行之哉？若存心不诚，言语无实，则人皆贱恶之。在家则不可行于家，在国则不可行于国，盖无所往而不见阻矣，与车无輗軏者，何以异哉！”孔子此言，只是要人言行相顾，事事着实，不可少有虚妄的意思。然信之一字，尤为人君之大宝，是以为治者，必使政教号令之出，皆信如四时，无或朝更而夕改，然后民信从，而天下治也。孔子之言，岂非万世之明训哉！"
        },
        {
          "originalText": "子张问：“十世可知也？”",
          "explain": "凡朝代更换，叫做一世。子张问于孔子说：“有一代之兴，必有一代的事迹。但已往者易见，将来者难知，不知自今以后，朝代兴亡，至于十世之远，其事迹亦可得而前知否乎？”"
        },
        {
          "originalText": "子曰：“殷因于夏礼，所损益可知也；周因于殷礼，所损益可知也；其或继周者，虽百世可知也。”",
          "explain": "因，是相袭而不改。礼，是君臣、父子、夫妇之三纲。仁义礼智信之五常，这其中都有节文，故叫做礼。损，是减损。益，是增益。孔子答子张说：“后之视今，亦犹今之视昔。要知将来，但观既往便可知矣。比先夏有天下四百余年，而殷汤继之。殷家所行之礼，如修人纪以正万邦，都只是因袭夏家的，不曾改易。至于制度文为，有余不足的，则或损或益，稍有不同。如殷道尚质，殷正建丑之类，是其所因与所损益，可考而知也。殷有天下六百余年，而周文武继之。周家所行之礼，如建皇极以锡庶民，也只是依着殷家的，不曾变更。至于制度文为，太过不及的，则或损或益，也有不同。如周道尚文，周正建子之类，是其所因与所损益，亦可考而知也。此可见纲常伦理，是立国的根本，万世不可改易。制度文为，是为治的节目，随时可以变通，自今以后，或有继我周而王天下的，其所因与所损益，不过如此。虽百世之远，无不可知，岂但十世而已哉！”"
        },
        {
          "originalText": "子曰：“非其鬼而祭之，谄也。见义不为，无勇也。”",
          "explain": "非其鬼，是所不当祭的鬼神。谄，是求媚的意思。义，是事之宜，凡道理上所当行的便是。勇，是勇敢。孔子说：“人之祭享鬼神，各有其分。如天子祭天地，诸侯祭山川，大夫祭五祀，庶人祭其先，是乃当然之分，祭之可也。若是不当祭的鬼神也去祭他，这便是谄媚鬼神以求福利，不是孝享的正礼，所以谓之谄也。人于道理上当为的事，便着实做将去，这才是有勇。若真见得这事是道理所当为的，却乃因循退缩，不能毅然为之，这是委靡不振，无勇往直前之气，怯懦甚矣，所以谓之无勇也。”夫此二者，一则不当为而为，一则当为而不为。孔子并举而言之者，盖欲人不惑于鬼神之难知，而专用力于人道之所宜也。"
        }
      ]
    ]
  },
  {
    "chapterName": "八佾第三",
    "introduction": "凡二十六章。通前篇末二章皆论礼乐之事。",
    "paragraphs": [
      [
        {
          "originalText": "孔子谓：“季氏八佾舞于庭，是可忍也，孰不可忍也。”",
          "explain": "季氏，是鲁国大夫。佾，是乐舞的行列。古者乐舞之数，天子用八行，每行八人，叫做八佾。诸侯六佾，大夫四佾。各有等差，不容僭越。当初成王以周公有大勋劳，特赐天子礼乐以祭周公之庙，其后世群公都因循僭用，已是失礼。季氏，是鲁桓公子孙，他在家庙中祭祖，也僭用八佾之舞于庭，故孔子非之说：“礼莫严于名分，罪莫大于僭窃。夫祭用生者之爵禄，乃我王朝一定之礼。季氏本是大夫，只该用四佾之舞，而今乃用八佾之舞于家庙之庭，则是以大夫而僭天子礼，法之所不容诛，罚之所必及，人臣之罪孰有大于此者。这等大罪也都容忍过了，不加纠正，则别样的小罪，孰不可忍乎！”盖鲁以相忍为国，凡事惟务姑息含忍，而其弊乃至于下陵其上，臣僭其君，礼法荡然，冠屦倒置如此。盖优柔姑息之过也，故孔子非之。其后孔子为司寇，摄相事，即堕三都以强公室，陈恒弑其君，则沐浴而朝，请兵讨之，此可以观圣人之志矣。而鲁终不能用。卒之三家共分公室，政在陪臣，而周公之祚遂衰矣。然则纪纲法度，有国者其可一日而不振举之乎！"
        },
        {
          "originalText": "三家者以《雍》彻。子曰：“‘相维辟公，天子穆穆’，奚取于三家之堂？”",
          "explain": "三家，是鲁国的大夫孟孙、叔孙、季孙之家。雍，是《周颂》篇名。彻，是彻馔。相，是助祭。辟公，是诸侯。穆穆，是深远的意思。“相维辟公，天子穆穆。”是《雍》诗中两句说话。昔者周天子祭祀宗庙，祭毕之时，则歌《雍》诗以撤馔。及鲁大夫孟孙、叔孙、季孙祭其家庙，于收俎豆的时节，也歌《雍》诗，是僭用天子之礼矣。故孔子讥之，说道：“《雍》诗中有云‘相维辟公，天子穆穆’，是说天子宗庙之中，助祭的是列国的诸侯，主祭者是天子，其敬德之容，则穆穆然幽深而玄远。盖本天子之事，故于撤馔歌之，道其实也。今三家之堂，助祭者不过陪臣，亦有辟公之相助乎？主祭者不过大夫，亦有天子之穆穆乎？既无此事，则何取于此义而歌之于堂乎？是不惟僭妄可恶，而其无谓亦甚矣。”盖礼所以辨上下之分，不可毫发僭差，人臣而敢僭用君上之礼，则妄心一生，何所不至。攘夺之祸，必由此起。孔子前一节非季氏之舞八佾，此一节讥三家之歌《雍》诗，皆所以立万世人臣之大防也。"
        },
        {
          "originalText": "子曰：“人而不仁，如礼何？人而不仁，如乐何？”",
          "explain": "仁，是心之德，敬而将之以仪文，叫做礼。和而达之于声容，叫做乐。如礼何？如乐何？譬如说没奈他何一般，是不相为用的意思。孔子说：“仁之在人，乃本心之全德，人能全此心德，使心里常是恭敬，则行出来的仪文便都是礼。心里常是和平，则播之于声容，便都是乐。”是礼不虚行，必仁人而后可行也。人而不仁，则其心放逸而不能敬，礼之本先失了。那陈设的玉帛，升降的威仪，不过是虚文耳。礼岂为之用乎？所以说如礼何。乐不徒作，必仁人而后能作也。人而不仁，则其心乖戾而不和。乐之本先失了，那钟鼓之声，羽旄之舞不过是虚器耳，乐岂为之用乎？所以说如乐何。盖礼乐不可斯须而或去，人心不可顷刻而不存，欲用礼乐者，求之心焉可也。"
        },
        {
          "originalText": "林放问礼之本。子曰：“大哉问！礼，与其奢也，宁俭；丧，与其易也，宁戚。”",
          "explain": "林放，是鲁国人。易，是节文习熟。戚，是哀痛。鲁人有林放者，见世人行礼，繁文太盛，以为制礼之初意，恐不如此，故问礼之本于孔子。孔子以时俗方逐末，而放独究心于礼之本，可谓不为习俗所移，而有志于返本复古者矣，所以称美之说：“大哉汝之问也！夫礼之全体有质有文。譬如饮食之礼，起初只是太羹、玄酒，汗尊抔饮而已，这叫做本质。先王以为太简，始制为笾豆簠簋之器，揖让周旋之仪，这叫做文。又如居丧之礼，起初只是伤痛哭泣，思慕悲哀而已，这叫做本质。先王以为太直，始制为擗踊哭泣之节，衰麻服制之等，这叫做文。文质得中，乃礼之全体，到后来习俗日侈，却只在仪文节度上究心，而制礼之初意，荡然无存矣。然则今之礼者，与其趋尚繁华，而流为奢侈，宁可敦崇朴素，而失于俭啬。盖俭啬无文，虽未合于礼之中，而犹不失为淳古之风，是即本之所在也。所以说与其奢也，宁俭。居丧者与其习熟于仪节，而无惨怛之诚，宁可过于哀痛，而少品节之制。盖徒戚虽未合于礼之中，而犹自率其天性之真，是即本之所在也。所以说与其易也，宁戚。”夫曰宁俭，曰宁戚，皆孔子不得已而矫俗之意。盖天下事物，每自质而趋文。而世之将衰，必多文而灭质。故孔子他日赞易，又以用过乎俭，丧过乎哀为言，而其论礼乐，则曰吾从先进。皆厌周末文盛而欲矫之以合于中也。有维持世教之责者，尚鉴兹哉！"
        },
        {
          "originalText": "子曰：“夷狄之有君，不如诸夏之亡也。”",
          "explain": "夷狄，是化外之地。东夷、西戎、南蛮、北狄，总叫做夷狄。诸夏，是中国。诸，是众。夏，是大。以其人民众而地方大，故称诸夏。亡字，与有无的无字同。当孔子时，季氏以大夫僭用八佾，三家以大夫僭歌《雍》诗，上下陵夷，不知有君臣之分。故孔子一日叹息说道：“中国所以尊于夷狄者，以其名分定而上下不乱也。今夷狄之国，在上的统领其下，在下的顺从其上，尚且有个君长，到不似我中夏之国，君弱臣强，以诸侯胁天子者有之，以陪臣专国政者有之，恣为僭窃，反无上下之分也。”夫以中国同于夷狄，犹且不可，况反不如乎，可慨也已。孔子此言，岂真轻中国而称夷狄哉！盖甚为之词，以见上下之分，不可一日不明于天下也。"
        },
        {
          "originalText": "季氏旅于泰山。子谓冉有曰：“女弗能救与？”对曰：“不能。”子曰：“呜呼！曾谓泰山不如林放乎？”",
          "explain": "旅，是祭告。泰山，是东岳泰山，在鲁地。冉有，是孔子弟子冉求。救，是救正。古者祭祀之礼，天子祭天地，诸侯祭山川。泰山在鲁国境内，惟鲁君当祭。季氏是鲁大夫，也要行祭告之礼于泰山之神，则其越礼犯分，僭上无君甚矣。孔子以冉求是他的家臣，有匡救之责，故问他说：“季氏此一事，甚为非礼，汝为家臣，固宜尽言匡正。今乃坐视其失礼而不能救之与？”冉求对说：“他的意思已定，吾力不能挽回之也。”孔子于是叹息说：“季氏此举只要谄事鬼神，以求福佑，殊不知礼不可僭，神不可欺。且如林放，鲁人，也知问礼之本，不肯随俗。况泰山是五岳之尊，其神聪明正直，必然知礼，岂肯享季氏非礼之祭，而反不如林放之知礼乎？”是季氏之祭泰山，非惟分不当为，而且神必不享，则亦何益之有哉！孔子此言，一则要使季氏知其无益，犹可中止；一则要使冉求以不如林放为耻，而知所以自励也。"
        },
        {
          "originalText": "子曰：“君子无所争，必也射乎！揖让而升，下而饮，其争也君子。”",
          "explain": "争，是争竞。射，是大射之礼。升，是升堂。饮，是饮酒。孔子说：“有德行的君子，他心平气和，与人恭逊，无有争竞。求他有争竞处，必也观之于行射礼之时乎！盖射有中者，有不中者，中有多者，有少者，胜负相形，似乎有所争也。然观其将射之初，则三揖三让而后升堂。既射之后，则与那同射的人，都下堂来，胜者却揖那不胜者使他升堂，自取爵盏，立饮罚酒。射礼之行如此。是虽有胜负之相较量，然自始至终，雍容揖逊，是其争也，乃君子之争，非若小人专以血气相尚，而为角力之争也。夫以射才有争而其争又如此，则君子之无所争可见矣。”"
        },
        {
          "originalText": "子夏问曰：“‘巧笑倩兮，美目盼兮，素以为绚兮。’何谓也？”",
          "explain": "“巧笑倩兮”这三句都是逸诗之词。倩，是好口辅。盼，是黑白分明。素，是粉地。绚，是彩色。逸诗上说：“人于笑时，口辅端好，其眼目黑白分明，有此自然的美质，而又妆饰以华彩，就如素地上加以彩色的一般，愈为美好矣！”子夏未达素以为绚之旨，疑其反以素为饰，乃问于孔子说：“逸诗有言：‘巧笑倩兮，美目盼兮，素以为绚兮。’夫素则无文，绚乃华饰，今言素以为绚，其言果何谓也？”"
        },
        {
          "originalText": "子曰：“绘事后素。”",
          "explain": "绘，是绘画。孔子答子夏说：“诗言素以为绚，不是说素即是绚，乃是说因素为绚耳。如今绘画之工，必先有了质素的粉地，然后加以各样彩色，是素在于先，绚在于后。犹人之相貌，必先生得自然美好，然后可加以华饰也。”"
        },
        {
          "originalText": "曰：“礼后乎？”子曰：“起予者商也！始可与言《诗》已矣。”",
          "explain": "起予，是起发我之志意。商，是子夏的名。子夏一闻孔子之言，遂有悟于心，说道：“观绘画之事，素地在先，彩色在后，可见素而非绘，固无以备其文采，绘而非素，则虽有彩色亦将安施？然则世之所谓礼文者，其犹在于后乎？必有为之先者矣。”盖礼也者，因人情而为之节文者也。如玉帛交错，揖让周旋，宾礼也。然必先有恭敬之实心，而后以是将之，是敬在于先，礼在于后矣。又如擗踊哭泣，衰麻服制，丧礼也。然必先有哀痛之本情，而后以是节之，是哀在于先，礼在于后矣。故情实者素地也。礼文者彩色也，非礼，固无以为人情之节文。然苟情不至而徒求之于礼焉，是犹画者不先布素地，而欲施文采也，有是理乎？夫孔子以绘画明，素绚之意，不过只就书旨上发挥，而子夏礼后之言，则圣言之所未及者。可谓闻一知二，触类旁通者矣。故孔子喜而称之，说道：“能起发我之志意者，是汝商也。”盖诗人之言，其旨甚微，而寓意深远。善说诗者，能求之于言语之外，而不拘泥于文字之末，乃为得之，似你这等聪明颖悟，才可与论诗也已，盖深喜之之辞也。按此章之旨，与前章林放问礼之意，大略相同。林放求礼之本，而子夏以礼为后，皆有反本尚质，挽回世道之意。故孔子于林放则以大哉称之，于子夏则以启予许之，此又圣贤未发之旨也。学者宜致思焉。"
        },
        {
          "originalText": "子曰：“夏礼吾能言之，杞不足徵也；殷礼吾能言之，宋不足徵也。文献不足故也，足则吾能徵之矣。”",
          "explain": "杞、宋是二国名。杞，是夏之后。宋，是殷之后。文，是书籍。献，是贤人。徵字，解做证字。孔子说：“昔者禹有天下，其制度文章为有夏一代之礼者，我能言其大略，然必有证而后人信之。今夏之后代，虽有杞国尚存，然不足取以为证矣。汤有天下，其制度文章为有殷一代之礼者，我亦能言其大略，然亦必有证而后人信之。今殷之后代，虽有宋国尚存，然亦不足取以为证矣。盖礼非书籍不能记载，非贤人不能诵习。今夏殷二代，传世久远，杞宋两国世祚衰微，既无书籍可以考究，又无贤人可以谘访，将何所取以证吾之言耶！若使二国之书籍尚存，贤人未谢，则考究谘访皆有所据，而吾能取之以为证，人皆信之矣。惜乎！今之不能也。”盖孔子当时，欲斟酌三代之礼，以立万世常行之法，而夏殷不可考，故为是叹息之词如此。然三纲五常古今不易，所损所益，百世可知，则二代之礼又不以杞宋无徵而遂泯也。有仪礼制度之责者，宜究心焉。"
        },
        {
          "originalText": "子曰：“禘自既灌而往者，吾不欲观之矣。”",
          "explain": "禘，是祭祀之名。古者天子既祭其始祖，又推始祖所自出之帝，祭于太庙，而以始祖配之，这礼五年一举，叫做禘。成王以周公有大勋劳，赐鲁重祭，使鲁国以周公为始祖，以文王为所自出之帝，而以周公配之，故鲁国得禘祭其先。然以诸侯而僭行天子之祭，实为非礼也。灌，是奠酒于地以降神。往字，解做后字。孔子说：“我鲁国君臣举行禘祭，我也曾在太庙中，观其行礼何如，但是他未曾降神之先，诚敬尚在，犹有可观。及到那灌地降神之后，君臣之间都懈怠了，虽有陈设的俎豆，升降的威仪，全是虚文，无一些恭敬诚恪的意思。到这时节，我之心不欲观之矣。”夫鲁国本是诸侯，僭用王者之大祭，已是失礼，及举祭之时，又不诚敬，是失礼之中又失礼焉。故孔子叹之如此。"
        },
        {
          "originalText": "或问禘之说。子曰：“不知也。知其说者之于天下也，其如示诸斯乎！”指其掌。",
          "explain": "示，与看视的视字同。斯字，解做此字。掌，是手掌。或人见鲁国尝行禘祭之礼，而不知当初制礼之意，故以禘之说问于孔子。孔子以禘乃国家之重典，先王所以报本追远之意，其妙固未易言。况又是王者之大祭，鲁国因循而僭用之，其失又所当讳。这意思有难以显言者，故只答他说：“不知也。盖以禘之为祭，礼仪重大，意义深远，知之甚不易也。若有能知其说的，则理无不明，诚无不格，识见自是广阔，精神自会运量，看得天下的道理，灿然都在目前，岂不如视诸斯之至易乎！”门人遂记说：“夫子所谓视诸斯者，乃自指其手掌而言，以其明白易见，就如看自家的手掌一般，初无难事也。”此可见幽明只是一理，神人本无二道，幽而知所以事神，则明而治人，亦何难之有哉！然非先王不能作，亦非圣人不能知，如或人者，何足以语此，此孔子所以不轻告之也。"
        },
        {
          "originalText": "祭如在，祭神如神在。子曰：“吾不与祭，如不祭。”",
          "explain": "祭，是祭先祖。祭神，是祭外神。吾不与祭，如不祭，是孔子平日的言语。门人记说：“祭以诚为主，而他人则不能。惟吾夫子，观其在家祭先祖的时节，则孝心纯笃，就如先祖在上的一般。其在官祭外神的时节，则敬心专一，就如神明在上的一般。夫鬼神无形与声，岂真有所见，乃心极其诚，故如有所见耳。”考其平日尝说：“吾于祭祀，必亲行之，乃慊于心。若或有故，不得已，而使人代之，则不得以伸吾之孝敬，故礼虽已行，而此心缺然，还似不曾祭的一般。即此言观之，则其祭祀必致如在之诚可知矣。”这是门人记孔子祭祀之诚敬如此。若天子一身，为天地宗庙百神之主，尤不可不致其诚。所以古之帝王，郊庙之祭，必躬必亲，致斋之日，或存或著，然后郊则天神格，庙则人鬼享，而实受其福也。承大祭者，宜致谨焉。"
        },
        {
          "originalText": "王孙贾问曰：“‘与其媚于奥，宁媚于灶。’何谓也？”",
          "explain": "王孙贾，是卫大夫。媚，是亲顺。奥，是室之西南隅。灶，是灶神。古者夏月祭灶，必先祭主于灶陉。然后迎尸入奥，而设馔以祭。是祭于奥则似尊崇，祭于灶则似卑亵。故当时俗语说：“奥虽有常尊，而非祭之主，灶虽卑贱，然日用饮食所司，当时用事，所以说媚奥不如媚灶。”盖奥以比君之势分崇高，难以自结；灶以比臣之专权用事，容易干求。时俗之见，浅陋如此。王孙贾乃问孔子说：“俗语有云‘与其求媚于奥，宁可求媚于灶’。夫奥本尊崇，灶甚卑亵，今乃言媚奥不如媚灶，其意果何谓也？”贾疑孔子在卫，有求仕之心，欲求附己以进用，故以此讽之耳。"
        },
        {
          "originalText": "子曰：“不然。获罪于天，无所祷也。”",
          "explain": "获字，解做得字。祷，是祈祷。孔子答王孙贾说：“俗语所谓媚奥不如媚灶，我甚不以为然。盖天下之至尊而无对者，惟天而已。作善则降之以福，作不善则降之以祸，感应之理毫发不差。顺理而行，自然获福，若是立心行事，逆了天理，便是得罪于天矣。天之所祸，谁能逃之，岂祈祷于奥灶所能免乎！”此可见人当顺理以事天，非惟不当媚灶，亦不可媚于奥也。孔子此言，逊而不迫，正而不阿，世之欲以祷祀而求福者，视此可以为鉴矣！"
        },
        {
          "originalText": "子曰：“周监于二代，郁郁乎文哉！吾从周。”",
          "explain": "监字，解做视字。二代，指夏商。郁郁，是文盛的模样。孔子说：“比先夏商之有天下，固皆有一代的典章法度，但其立法未能尽善尽美，而其流弊亦皆偏向失中。自我周之兴，有文武为之君，周公为之相，于是监视夏商之礼，或损其太过，或益其不足，是以制度仪章纤悉具备，兄行于朝廷，施于邦国，达于闺门闾巷之间者，皆尽善尽美。郁郁乎文采之盛，殆非夏商所能及也。我也生周之世，为周之民，时王之制，固当遵承而不悖，况其礼文之盛又如此。然则吾之当从者，舍周其何适哉？所以说吾从周。”尝观孔子之在当时，礼乐则从先进，梦寐不忘周公，与夫修鲁史而尊天王，此其从周之志，有未尝一日忘者，所谓圣人之为下不倍也。然则生今之世而欲反古之道者，岂不谬哉！"
        },
        {
          "originalText": "子入太庙，每事问。或曰：“孰谓鄹人之子知礼乎？入太庙，每事问。”子闻之，曰：“是礼也。”",
          "explain": "太庙，是鲁周公之庙。鄹，是邑名。鄹人之子，指孔子说。孔子父叔梁纥，曾为鄹邑大夫。故当时叫孔子为鄹人之子。昔孔子仕鲁之时，尝陪祭于周公之庙，与执事焉。那庙中陈设的器数，如笾豆、玉帛之类，周旋的仪节，如灌献酬酢之类，每事都详细访问，却似不曾知道的一般，盖惟其敬之至，故其问之详如此。或人不知而疑之，说道：“鄹人之子孔丘，素以知礼见称于人，如今看来，谁说他知礼？”盖知者不待于问，问者必有不知。观他在太庙之中，事事都问过，则其不知礼也明矣。世固有无其实而有其名者乎！孔子闻而解之说道：“礼莫大于祭，祭莫先于敬。今太庙之中陈设的都是礼器，周旋的都是礼仪，若一毫知得不真，行得不当，便是轻忽放肆，而非所以为敬矣！今我每事访问者，正以对越奔走之际，当有恭敬严肃之心，固不敢强其所不知以为知，亦不敢恃其所已知而不问，是乃所以为礼也。或人之言，岂知我者哉！”此可见圣人之心极其敬慎，故祭祀之礼尤加谨严。圣人之心极其谦虚，故每事问人，不厌详细，其与尧之钦明，舜之问察，一而已矣。学圣人者，当于此求之。"
        },
        {
          "originalText": "子曰：“射不主皮，为力不同科，古之道也。”",
          "explain": "射，是射箭。皮，是皮革。射不主皮，这一句是《乡射礼》中的说话。科字，解做等字。孔子说：“《乡射礼》有云，射以观德。但主于中的，不必穿透皮革，然后为能。所以然者，盖为人之气力，有强有弱，其等不同。若必主皮，则惟强者能之，而弱者必不能矣。此所以不主皮也。然这是古昔盛时，尚德而不尚力，其道如此。今世衰礼废，列国兵争，惟以强力为尚，虽礼射亦主于贯革，而尚德之风，不可复见矣。”可胜叹哉！孔子思古伤今之意如此。"
        },
        {
          "originalText": "子贡欲去告朔之饩羊。",
          "explain": "告，是告庙。朔，是正朔。饩，是牲牢。古时天子以季冬颁来岁十二月之朔于诸侯。诸侯受而藏之祖庙。每遇月朔，则以特羊告庙，请而行之。鲁自文公以后，把这告朔之礼，废而不行了，而有司每月犹照常办备此羊。子贡以此礼今既不行，饩羊徒为靡费，故欲去之，以省费焉。是徒知一羊之可惜，而不知制礼之初意矣。"
        },
        {
          "originalText": "子曰：“赐也！尔爱其羊，我爱其礼。”",
          "explain": "爱，是爱惜。孔子呼子贡之名而晓之说：“赐也！尔之欲去乎饩羊者，岂以告朔之礼既废，饩羊之供无实。爱惜此羊而欲去之矣乎！自我观之，所爱尤有甚于羊者。盖正朔颁于天子，所以示天下之有君，告朔行于诸侯，所以示天下之有亲，最为礼之大者。今此礼虽废，而饩羊犹存，后之人，或有因羊以求礼，举而行之者，若将此羊一并去了，则告朔之礼，随羊以亡，自此天子不复颁朔，而人不知有君，诸侯不复视朔，而人不知有亲矣。是礼之亡不尤为可惜耶？”夫孔子之意在于存礼，而子贡之言，唯求省费，圣贤度量之广狭，用心之大小，区以别矣。"
        },
        {
          "originalText": "子曰：“事君尽礼，人以为谄也。”",
          "explain": "礼，是恭敬之见于仪文者，乃道理当然的去处。谄，是求媚。孔子说：“臣之于君，既有尊卑上下的定分，便自有恭敬奉承的定礼。这礼，是先王所制，万世通行，不可违越者也。今我之事君，心里极其敬谨，不敢有一毫轻慢，故每事依着礼节，不敢有一些差失，这不过尽那礼之当然者而已，非有加于礼之外也。时人不知，乃以为求媚取悦而然，是岂知事君之礼者乎！”盖当时公室衰微，强臣僭窃，上下之际，多不循礼，惟孔子欲明礼法以挽回之。如过位则色勃，升堂则屏气，违众而拜堂下，闻命而不俟车，这等循礼，当时反以为谄，则礼法之不明于天下可知。故孔子之言如此。然尽礼与谄，其迹相似，而其心不同。君子之事君，其礼固无不尽，然却不肯阿谀顺从，如责难以为恭，陈善以为敬，一心只要成就君上的美名，干办国家的大事，这便真是尽礼。小人之事君，外面虽似尽礼，然心里未必忠实，如阿顺以为容，逢迎以为悦，一心只要干求君上的恩宠，保全自家的官爵，这便真是谄媚。君子尽礼，小人以为谄，小人谄媚，亦自以为尽礼。心术之邪正，迥然不同，人君不可不察也。"
        },
        {
          "originalText": "定公问：“君使臣，臣事君，如之何？”孔子对曰：“君使臣以礼，臣事君以忠。”",
          "explain": "定公，是鲁国之君。礼，是有节文，不简慢的意思。忠，是竭尽己心，不欺罔的意思。定公一日问于孔子说：“为人君的使令臣下，为人臣的奉事君上，都有个道理，不知当如之何？”孔子对说：“为人君者，以尊临卑，易至于简慢忽略，若简慢忽略，便失了为君的道理，是以人君之于臣下，使之须要以礼。如使之为大臣，则待之如股肱；使之居言责，则待之如耳目；使之为将帅，则有推毂命将之礼；使之为使臣，则有皇华遣使之礼，务加以礼貌，待以至诚，这乃是使臣的道理。为人臣者，以下事上，易至于欺罔隐蔽。若欺罔隐蔽，便失了为臣的道理。是以人臣之于君上，事之须要以忠。如居辅导赞襄之职，则尽心以启沃，而一毫无所隐；有官守言责之寄，则尽心以纳忠，而一事不敢欺。遇有难处之事，则虽劳瘁而不辞；遇有患难之日，则虽致命而不避。务内尽其心，外尽其力，这乃是事君的道理。”君尽君道，固非有私于臣，而所以劝下之忠者，亦在是矣。臣尽臣道，固非有要于君，而所以报上之礼者，亦在是矣！上下交而德业成，天下其有不治者哉！"
        },
        {
          "originalText": "子曰：“《关雎》乐而不淫，哀而不伤。”",
          "explain": "《关雎》，是《国风》诗之首篇。孔子说：“凡乐音不和乐，则不足以畅意；不哀婉，则不能以感人。然又贵于得中，若乐之过，则有淫荡邪僻之声；哀之过，则有忧思燋杀之病，而失其性情之正矣。惟有《关雎》之诗，其发之咏歌，而被之管弦者，优柔平中，虽欣然和乐，而不至于淫荡，虽凄然哀婉，而不至于悲伤。听之使人欲心平，躁心释，而足以为养德之助，诚盛世之遗音也。”盖诗本性情，乐以彰德。《关雎》之诗，咏后妃之德也。昔周文王之妃太姒，有圣德，不妒忌，忧在进贤，不淫于色，旁求淑女以配君子。求之未得，至于寤寐反侧而不能安；求之既得，则以钟鼓琴瑟乐之而致其喜，其德之盛如此。故其发为声诗，自然中正和平，而无过淫过伤之病，是乐音之和，本于后妃柔顺之德，后妃之德，又本之文王刑于之化。学者玩其辞，审其音，则所以基化闺门，而御于家邦者，必有得于言意之表矣。"
        },
        {
          "originalText": "哀公问社于宰我，宰我对曰：“夏后氏以松，殷人以柏，周人以栗。曰，使民战栗。”",
          "explain": "哀公，是鲁君。社，是为坛以祭地。宰我，是孔子弟子。战栗，是恐惧的模样。哀公问于宰我说：“有国家者，必有社以祭地，不知其义何如？”宰我对说：“古之立社者，必栽树木。夏后氏立社，则以松树。殷人立社，则以柏树。周人立社，则以栗树。然所以用栗树者，取于战栗之义。盖戮人必于社，欲使民见之而战栗恐惧也。”夫祭地以报其功，乃立社之本意，至于所栽的树木，则各因其土之所宜，而非有取义于其间也。宰我不知而对，谬妄甚矣。"
        },
        {
          "originalText": "子闻之，曰：“成事不说，遂事不谏，既往不咎。”",
          "explain": "遂事，是事虽未成，而势不能已者。谏，是谏正。咎，是罪责。孔子闻宰我使民战栗之言，以其所对，既非先王立社之本意，又启鲁君杀伐之心，因厉言以责之曰：“大凡事之未成者，犹可以言语说之，若事既成者，说之何益？所以不说。事之未遂者，犹可以谏诤止之，若事既遂者，谏之何益？所以不谏。事之未往者，犹可咎而罪之，若事之既往，咎之何益？所以不复追咎。今汝使民战栗之言，已出之口，而告之于君，是事之已成，已遂，已往者也。吾又何以责汝乎！”孔子以为不足责者，正所以深责之，欲其知言之不可妄发，而致谨于将来耳。"
        },
        {
          "originalText": "子曰：“管仲之器小哉？”",
          "explain": "管仲，是齐大夫，名夷吾。器，指人之局量规模说。器小，譬如说小家样。管仲相齐桓公，九合诸侯，一匡天下。当时皆以为莫大之功，然出于权谋功利之私，而不本于圣贤大学之道。故孔子讥之说：“管仲虽有大功，然其为人，局量褊浅，规模狭隘，没有正大光明的气象，其器不亦小哉！”盖深责备之词也。"
        },
        {
          "originalText": "或曰：“管仲俭乎？”曰：“管氏有三归，官事不摄，焉得俭？”",
          "explain": "三归，是台名。摄字，解做兼字。孔子以管仲为器小，或人不知而疑之说：“吾闻俭约之人，凡事吝啬，却似器小的模样。夫子以管仲为器小，得非以其俭约而然乎？”孔子答说：“凡人俭约者，必能制节谨度。今管仲筑三归之台，以为游观之所，其兴作之靡费可知。又多设官属，使每人各治一事，不相兼摄，其廪禄之冗滥可知。观其行事如此，岂得谓之俭乎？夫以俭为器小，失之远矣。”"
        },
        {
          "originalText": "“然则管仲知礼乎？”曰：“邦君树塞门，管氏亦树塞门。邦君为两君之好，有反坫，管氏亦有反坫。管氏而知礼，孰不知礼？”",
          "explain": "邦君，是有国的诸侯。树，是门屏。塞，是遮蔽。好，是宴会。坫，是放酒杯的案。凡宾主献酬饮毕，必反置酒杯于此，故谓之反坫。孔子斥管仲为非俭。或人又不知而疑之，说道：“吾闻知礼之人，凡事备具，不肯苟简，却似奢侈的模样，然则管仲之不俭，得非以知礼而然乎！”孔子答说：“礼莫大于名分，分莫大于君臣，不可一毫僭差者也。且如有国的诸侯，才得设屏于门，以蔽内外，非大夫所宜有者。今管氏也设屏于门以蔽内外，与邦君一般，其僭礼一也。诸侯为两国的宴会，那时献酬，有反爵之坫，非大夫所宜用者。今管氏也有反爵之坫，与邦君一般，其僭礼二也。这等僭上，决不是知礼的人。若说管氏知礼，则天下之人，谁是不知礼者乎？”盖人之器量大小，固不在于行事之广狭。大禹恶衣菲食，不害为圣。周公之富，不病其奢。或人既以器小为俭，又以不俭为知礼，其心愈惑，而失之愈远矣。然孔子竟亦未明言器小之意，岂或人之浅陋，不足以语此欤？"
        },
        {
          "originalText": "子语鲁大师乐，曰：“乐其可知也。始作，翕如也；从之，纯如也，皦如也，绎如也，以成。”",
          "explain": "语，是告语。鲁大师，是鲁国掌乐之官。翕，是合。从，是放。纯，是和。皦，是明白。绎，是相续不绝的意思。成，是乐之一终。当时鲁国衰微，音乐废阙，乐官多失其职者。故孔子告鲁大师以作乐之道说：“汝为典乐之官，必知道乐之节奏，然后可以作乐。今先王之乐，犹未尽亡，其始终条理之妙，可得而知也。吾试为汝言之。盖乐有六律、五声、八音，有一不备，不足以言乐。故始作之时，必须声音律吕，件件都全，而翕然其合焉。然备而不和，亦不足以言乐，故乐之既放，必须清浊高下，皆中其节，而纯然其和焉。和，则易至于混乱，又必一音自为一音，而皦然其明白。皦，则易至于间断，又必众音相为起伏，而绎然其连续。夫翕合之后有纯和，纯和之中有明白，明白之中无间断。自始至终，曲尽条理节奏之妙，是乃乐之一成也。由此而至于九成，其道理不过如此，汝太师岂可以不知乎？”盖声音之道，与政相通，不但可以养人之性情，而亦可以移易天下之风俗，所系甚重。故孔子自卫反鲁，既汲汲于正乐，而其于太师，又谆谆以告戒之如此。"
        },
        {
          "originalText": "仪封人请见，曰：“君子之至于斯也，吾未尝不得见也。”从者见之。出曰：“二三子何患于丧乎？天下之无道也久矣，天将以夫子为木铎。”",
          "explain": "仪，是卫邑名。封人，是掌封疆之官。见，是相见。从者，是随从，孔子的门人。丧，是失位去国。木铎，是古人施政教时，用以警众的器具。其器金口木舌，摇之则有声，即今之铃是也。昔孔子周流四方，到卫国之仪邑，有个掌封疆的官，来请见说：“敬贤者，吾之素心。凡贤人君子来到这地方，我必求见，未尝拒我而不得见也。今夫子幸至于此，独不容我一见乎？”门人以其求见之诚，为之引见于孔子。封人既见孔子而出，乃对门人说：“夫子之失位去国，固其一时之不遇，然二三子何必以此为忧乎？盖治乱相因，是乃必然之数，而易乱为治，必待非常之人。今世教陵夷，人心陷溺，天下之无道，亦已久矣。世无终乱之理，必当复治。吾观夫子之道德，正可以易乱而为治者。天生斯人，岂是偶然，必将使之得位行道，施政教于四方，以开生民之耳目，以觉天下之愚昧，就如那警众的木铎一般，岂终于不遇也哉！”夫圣人盛德感人，能使封人尊敬而笃信之如此。然当时列国之君，不能委国而授之以政。至于辙环天下，卒老于行，此春秋之时，所以终不能挽而为唐虞之世也欤！"
        },
        {
          "originalText": "子谓《韶》：“尽美矣，又尽善也。”谓《武》：“尽美矣，未尽善也。”",
          "explain": "韶，是舜的乐名。武，是武王的乐名。尽美，是说声容到极盛的去处。尽善，是说盛美之中到极妙的去处。门人记说：“自古帝王有成功盛德于天下，则必作乐以宣之，故观乐之情文，便可以知其功德，然其间自有不同。吾夫子尝说，帝舜之乐，叫做《大韶》。他作于绍尧致治之后，其声音舞蹈至于九成，固极其盛美而可观矣。然不但尽美，而美之中又极其善焉。盖舜以生知安行之圣人，雍容揖逊而有天下，故心和气和，而天地之和应之。至于格神人，舞鸟兽，其妙有不可形容者，所以说又尽善也。武王之乐，叫做《大武》。他作于伐暴救民之日，其节奏行列，至于六成，固极其盛美而可观矣。然就其美之中而求之，则有未极其善者焉。盖武王以反身修德之圣人，征诛杀戮而得天下，故虽顺成和动之内，未免有发扬蹈厉之情，比于韶乐，则微有所不足者，所以说未尽善也。”然孔子此言，虽评论古乐之不同，而二圣之优劣，亦可概见矣。"
        },
        {
          "originalText": "子曰：“居上不宽，为礼不敬，临丧不哀，吾何以观之哉？”",
          "explain": "孔子说：“凡事有本，必得其本，而后其末有可观。且如宽弘简重，乃居上之体也；恭敬严肃，乃行礼之实也；伤痛悲哀，乃临丧之道也。这都是本之所在，有其本，则推之于行事者，自然可观。若使居上的，苛刻琐碎，而不知宽弘之大体；行礼的怠惰简慢，而无恭敬之实意；临丧的专事矫饬，而无哀痛之真情，则其本已先失了。虽其政教号令之施、进退周旋之节，缞麻擗踊之文，未必尽无可观。然大本既失，则末节无可言者，吾何以观之哉？”盖甚言其不足取也。盖当时王道不举，而苛政至子残民，古礼不复，而繁文至于灭质，故孔子矫时之敝如此。"
        }
      ]
    ]
  },
  {
    "chapterName": "里仁第四",
    "introduction": "凡二十六章。",
    "paragraphs": [
      [
        {
          "originalText": "子曰：“里仁为美。择不处仁，焉得知？",
          "explain": "二十五家为一里。仁，是仁厚的风俗。择，是拣择。处，是居处。孔子说：“人之居处甚有关系，不可不择。若使一里之中，人人都习于仁厚，在家庭，则父子相亲，兄弟相爱，在邻舍，则出入相依，患难相恤，没有残忍浮薄的人，此乃俗之至美者也。这等的去处，不但相观而喜，可以养德，亦且各守其业，可以保家，但有见识的人，必然择居于此。”若卜居者，不能拣择仁厚之里而居处之，则不知美恶，不辨是非，其心昏昧而不明甚矣，岂得谓之智乎！夫择居不于仁，尚谓之不智，况夫存不仁之心，行不仁之事，则其为害有不可胜言者矣。又岂非不智之尤乎！此圣人立言之意也。"
        },
        {
          "originalText": "子曰：“不仁者不可以久处约，不可以长处乐。仁者安仁，知者利仁。",
          "explain": "约，是穷困。乐，是安乐。安，是自然合理。利，是贪得的意思。孔子说：“仁之在人，乃本心之天德，人能全此德，而后中心有主，不为外物所摇。若那不仁之人，私欲锢蔽，失其本心，中既无主，则外物得以移之。使处贫贱困穷之时，起初或能强制。久之，则愁苦无聊，凡苟且邪僻之事，无不为已，岂可以久处约乎？使处富贵安逸之地，暂时犹能矫饬，久之，则意得志满，凡骄淫奢纵之事，无不为已，岂可以长处乐乎？”惟仁者之人，纯乎天理，无一毫私欲，其于这仁道，不待勉强，而心与之相安，处约处乐皆相忘而不自知也。所以说仁者安仁。知者之人，中有定见，无一毫昏昧，其于这仁道，深知笃好，而求必欲得之，处乐、处约皆确然不易其所守也。所以说，知者利仁。仁、知之分量虽殊，而其能全乎仁则一，此所以久约而不滥，久乐而不淫也。"
        },
        {
          "originalText": "子曰：“惟仁者能好人，能恶人。",
          "explain": "惟字，解作独字。仁者，是纯乎天理而无一毫私意的人。好，是喜好。恶，是憎恶。孔子说：“好善恶恶，天下之同情也。人惟心有私系，是以好恶鲜有当于理者。独是那仁人，其心至公而无私，故有所好也。必其人之贤而可好者，而后好之。好，当于理而无私，这才是能好人。有所恶也，必其人之不肖而可恶者，而后恶之。恶，当于理而无私，这才是能恶人。”夫好人恶人惟仁者能之，可见人当以仁为务，克去己私而后可。至于人君之好恶，其于进退用舍关系匪细，尤不可不先纯其心于仁也。"
        },
        {
          "originalText": "子曰：“苟志于仁矣，无恶也。",
          "explain": "苟字，解作诚字。志，是心所专向的意思。孔子说：“人性本善，而所为有不善者，皆不仁之念累之也。若其心能专向于仁，而欲以克去己私，复还天理，则一时察识虽未能精，践履虽未能熟，亦可保其必无为恶之事矣。”盖天理人欲，不容并立，心既专于天理，又岂有纵欲灭理之为乎？孔子勉人为仁之意如此。"
        },
        {
          "originalText": "子曰：“富与贵是人之所欲也，不以其道得之，不处也；贫与贱是人之所恶也，不以其道得之，不去也。",
          "explain": "道，是道理，当然。处，是居处。去，是避去。孔子说：“人之所遇，有顺有逆，然取舍之间，贵于审择。且如富与贵这两件，是人人所愿欲，谁不要得而处之，然有义存焉。不可苟得，若是理上应得的，虽处之亦无不可。设使无功而受禄，无德而居位，不应得富贵而偶得之，这便是无故之获，有道者所深忧。君子见利思义，决然辞之而不处也，其能审富贵如此。贫与贱这两件，是人人所厌恶，谁不要避而去之，然有命存焉，不可苟免。若是理上该得的，其顺受固不待言。就是学成而人不见知，行修而人不我用，不应得贫贱而偶得之，这也是适然之数，于身心上无损。君子乐天知命，决然处之而不去也，其能安贫贱如此。”审富贵则可以处乐而不淫，安贫贱则可以处约而不滥。非修德体仁之君子，其孰能之。"
        },
        {
          "originalText": "“君子去仁，恶乎成名？",
          "explain": "孔子说：“审富贵，安贫贱，不徇欲恶之情，而惟要之于理，这是仁之道。而君子之所以为君子异乎人者，以其有此实也。若于富贵则贪之，于贫贱则厌之，但徇欲恶之私情，则舍去此仁，而无君子之实矣，何以成其名叫做君子。仁之不可去也如此。”"
        },
        {
          "originalText": "“君子无终食之间违仁，造次必于是，颠沛必于是。",
          "explain": "终食之间，是一顿饭的时候。违，是违背。造次，是急遽苟且之时。颠沛，是倾覆流离之际。是字，解作此字，指仁而言。孔子说：“去仁不可以为君子。”所以君子之为仁，不但处富贵贫贱而不去也。自至静之中，以至应物之处，自一时之近，以至终身之远，其心常在于仁，未尝有一顿饭的时候，敢背而去之。虽造次之时，急遽苟且，当那等忙迫，他的心也只在这仁上。虽颠沛之际，倾覆流离，遭那等患难，他的心也只在这仁上。夫当造次颠沛而其心犹在于仁，则无一时而不仁矣！所以说君子无终食之间违仁。夫君子存养之功，其密如此，由是以处富贵贫贱，又岂有不得其道者哉！此君子之所以成其名也。"
        },
        {
          "originalText": "子曰：“我未见好仁者、恶不仁者。好仁者，无以尚之；恶不仁者，其为仁矣，不使不仁者加乎其身。",
          "explain": "尚字，解做加字。孔子说：“天下之道有二，只是仁与不仁而已。仁之当好，与不仁之当恶，谁不知之。然我看如今的人，都未见有好仁者，与那恶不仁者，何以言之？盖我所谓好仁者，非寻常喜好而已，必是真知仁之可好，而好之极其笃，凡天下可好之物，无一毫可以加之者，这才是真能好仁的人。我所谓恶不仁者，非泛然憎恶而已，必其为仁也，惟恐不仁之为害，而恶之极其深，务要私欲尽绝，不使一毫不仁之事加在他身上，这才是真能恶不仁的人。此皆成德之事，故难得而见之也。然为仁在我，欲之即至，有志于仁者，可不知所以用力哉！”"
        },
        {
          "originalText": "“有能一日用其力于仁矣乎？我未见力不足者。盖有之矣，我未之见也。",
          "explain": "孔子说：“好仁，恶不仁，是成德之事，固难得而见之。然仁本各具于人，惟人不肯用力，故视之为难耳。若有人焉，当蔽痼之余，兴悔悟之念，一旦奋然用力于仁，凡仁之所在，务精以察之，而决以守之；凡不仁之所在，务精以察之，而决以去之。这等勇猛精进，则志之所至，气必至焉，自可驯致于成德之地。固未见有力量不足，做不将去的。然人之气禀不同，或者也有那昏弱之甚，力不足以副其心者。但人必求仁，而后能与不能者可见。当今之人都是因循怠惰，不肯求仁的人，则谓用力而力有不足者，果何从而见之哉？”孔子此言，所以责人之自弃者，词愈婉而意愈明矣！"
        },
        {
          "originalText": "子曰：“人之过也，各于其党。观过，斯知仁矣。",
          "explain": "过，是差失。党，是类。孔子说：“凡人心术之邪正难知，而行事之差失易见。世之观人者，但知以无过为仁，岂知有过亦可以观仁乎？”盖人有君子，有小人。君子的人，存心宽厚，就有过失，只在那厚的一边，必不苛刻。小人的人，立心奸险，他的过失，只在那薄的一边，必不宽恕。其党类各自不同如此。人惟律之以正，而不察其心，固皆谓之过而已。若观人者，因其过而察之，则过于厚的，必是忠爱的君子，而其为仁可知矣！若过于薄的，便是残忍的小人，而其为不仁，又何疑哉！此可见取人者，固不可以无过而苛求，亦不可以有过而轻弃也。是道也，在人君尤所当知，盖人材识有短长，气质有纯驳。自非上圣大贤，孰能无过，顾其立心何如耳。小人回互隐伏，有过却会弥缝；君子磊落光明，有过不肯遮饬。故小人常以欺诈而见容，君子或以真率而得罪，是不可不察也。且如汉之汲黯，面折武帝，是他狂戆之过，然其心本是爱君；矫诏发粟，是他专擅之过，然其心本是爱民。仁者之过，大概如此。人君若以此体察群臣，优容小过，则人人得尽其用，而天下无弃才矣！"
        },
        {
          "originalText": "子曰：“朝闻道，夕死可矣。",
          "explain": "闻，是闻知。道，是事物当然之理。孔子说：“道原于天而赋于人。人生下来，便有日用常行的道理。如为子便要孝，为臣便要忠，一毫亏欠不得。若不曾知得这道理明白，便是枉过了一生，虽死犹有所憾。若是平日间，着意去讲求，竭力去体认，一旦豁然贯通，无所疑惑，则凡性分之所固有，与夫职分之所当为，事事完全，无少亏欠，就是晚上没了，其心亦安，而可以无遗恨矣。”孔子此言盖甚言道之不可不闻，欲人知所以用力也。然人不学不知道，欲闻道者，可不以务学为急哉？"
        },
        {
          "originalText": "子曰：“士志于道而耻恶衣恶食者，未足与议也。",
          "explain": "士，是为学之人。道，是事物当然之理，即学之所求者也。恶衣，是粗恶的衣服。恶食，是粗恶的饮食。议，是议论。孔子说：“人之为学，有志于斯道者，必是识见高明，见得自己性分为重，外物为轻。凡富贵贫贱，都动他不得，而后于道为有得也。若夫士而为学其志将以求道也，却乃愧耻其衣服饮食之不美，则是羞贫贱，慕富贵，其识趣之卑陋甚矣。与之论道，必不能知其味而信之，何足与议哉！”大抵衣服饮食，不过奉身之具，于性分原无加损。故大舜在贫贱之时，饭糗茹草，若将终身，及其为天子，被袗衣鼓琴，若固有之。而禹之菲饮食，恶衣服，非徒以示俭，盖亦以口腹身体之欲，不足留意于此耳。孔子之所谓志于道者，岂专为为士者警哉！"
        },
        {
          "originalText": "子曰：“君子之于天下也，无适也，无莫也，义之与比。",
          "explain": "适，是必行的意思。莫，是必不行的意思。义，是事之宜。比字，解做从字。孔子说：“天下之事，都有至当不易的道理。但当随事顺应，不可先有意必之私。且如有一件事来，心里主于必行，这便是适。适，则凡事之不可行的，都看做可行了，其弊必至于轻率而妄为。心里主于必不行，这便是莫，莫则凡事之可行的，都看做不可行了。其弊必至于拘滞而不通。这两件都是私心，必然害事。君子之人，其处心公而虚，其见理明而悉，故于天下之事，未尝主于必行而失之适。也未尝主于必不行而失之莫。只看于道理如何，若道理上当行的，便行，无所顾忌。道理上不可行的，便不行，不敢轻易是非可否，一惟义之是从，而无容心于其间，此君子之所以泛应曲当，而无有败事也。然必平时讲究得精明，而后临事乃能审处，有一日万几之责者，可不慎哉！”"
        },
        {
          "originalText": "子曰：“君子怀德，小人怀土；君子怀刑，小人怀惠。",
          "explain": "怀，是思念。德，是固有之善。土，是居处之所安者。刑，是刑法。惠，是货利。孔子说：“君子小人，为人不同，而其所思念者亦异。君子之所思念者，在于固有之善，立心则欲其无私，行事则欲其合理，惟恐悖德而为不肖之人。若夫小人，则不知德之可好也，而所思念者在于土。凡居之所安适处，即依依于此，恋而不舍。盖惟知适己自便，虽违德义而不恤矣。君子之所思念者，在于朝廷之法，循理而不敢放肆，奉上而不敢违越，惟恐犯法而为有罪之人。若夫小人，则不知法之可畏也，而所思念者在于惠。凡利之可歆羡者，即营营于此，求必得之。盖惟知贪得无厌，虽触刑法而不顾矣。”夫君子小人之所怀不同，如此观人者，但看其意思何如，便可以知其为人之实矣。"
        },
        {
          "originalText": "子曰：“放于利而行，多怨。",
          "explain": "放，是依仿。孔子说：“人能好义，则事皆公平，而人亦悦服。若其处心制行，只依着利的那边，物之有利者，必欲得于己，事之有利者，必欲专于己。这叫做放利而行。夫利既在己，害必归人，则不惟受其害者有所不堪，而不受害者，亦有所不平也。岂不多取怨于人乎！”夫放利而行，本欲为身谋，为家计也。至于多怨，又岂保身全家之道哉！故君子不以利为利，以义为利也。"
        },
        {
          "originalText": "子曰：“能以礼让为国乎，何有？不能以礼让为国，如礼何？",
          "explain": "礼，是尊卑上下的礼节。让，是逊让，即礼之实处。何有，是不难的意思。如礼何，譬如说没奈他何。言礼不为之用也。孔子说：“人君为国不可专倚着法制禁令，必须以礼让为先。盖礼以别尊卑，辨上下，固有许多仪文节目，然都是恭敬谦逊的真心生发出来。如君臣有朝廷之礼，然上不骄，下不僭，名分自然相安，这就是君臣间的礼让；父子有家庭之礼，然父慈子孝，情意自然相洽，这就是父子间的礼让。是让，乃行礼之实也。若是为人君的，能以礼让为国，或修之威仪言动之间，以示之标准，或严于名器等威之辨，以防其僭踰。凡所行的礼，都出于恭敬谦逊之实，则礼教既足以训俗，诚意又足以感人，那百官万姓每，自然都安分循理，相率而归于礼让，纪纲可正，而风俗可淳，其于治国何难之有？若不能以礼让为国，都只在外面粉饰，没有恭敬谦逊的真心，则出之无本，行之无实，虽有许多仪文节目，都不是制礼的初意，虽欲用礼，亦无如之何矣！礼且不可行，而欲其治国，岂不难哉！此可见为国以礼，行礼以让，先王化民成俗之道，莫要于此。”"
        },
        {
          "originalText": "子曰：“不患无位，患所以立。不患莫己知，求为可知也。",
          "explain": "患，是忧患。位，是爵位。所以立，是所以居位之具。可知，是可以见知之实。孔子说：“天下之事，有系于人者，不必忧。有在于己者，所当忧也。如爵位之不得，人常忧之，君子则以人不我用，其责在人，于我无预，何忧之有。惟所以立乎其位者，乃吾职分之所当为也。苟上不能致君，下不能泽民，而吾之职分有亏，即幸而居位，亦不免尸位之诮矣！故必以为忧焉。名誉之不著，人常忧之，君子则以人不我知，其失在人，于我无预，何忧之有。惟可以见知之实，乃吾性分之所固有也。苟知未至于高明，行未至于光大，而吾之性分有亏，即幸而得名，亦不免名胜之耻矣，故必以为求焉。”夫患所以立，非修此以觊得其位，求为可知，非务此以求知于人，盖君子为己之学如此也。不然，有为而为，则亦小人儒耳。奚足贵哉！"
        },
        {
          "originalText": "子曰：“参乎，吾道一以贯之。”曾子曰：“唯。",
          "explain": "参，是曾子的名。贯，是通。唯，是应之速。曾子一日三省其身，其于斯道之用，固已随事精察而力行之矣。但于体用一原的去处，尚未能确然有见。故孔子呼其名而告之说：“参乎，汝亦知吾之道乎？盖天下事有万变，物有万殊，其实总是一个道理。若在事物上一一去讲求，则头绪多而用力难，非根本切要之学也。我于天下的事物，只是一个道理贯通将去，随他千变万化，都能应之而不穷，处之而各当。譬如川水一般，虽千条万流，只是一个泉源流行出来。譬如树木一般，虽千枝万叶，只是一个根本生发出来。散之则甚博，而操之则甚约，这便是我的道理。”曾子一闻孔子之言，豁然有悟，就答应说：“唯。”盖其工夫至到，识见高明，故不复有所疑问，而直应之如此。此圣人传授心法，惟曾子独得其宗也。"
        },
        {
          "originalText": "子出。门人问曰：“何谓也？”曾子曰：“夫子之道，忠恕而已矣。",
          "explain": "门人，是孔子弟子。实心自尽，叫做忠。推己之心以及人，叫做恕。孔子一贯之旨，惟曾子为能默契，其余门人，都不能知。及孔子既出，门人私问于曾子说：“夫子所谓一以贯之者，其说谓何？”曾子答说：“夫子之道无他，只是忠恕而已矣。”盖一人的心，就是千万人的心，我心里要尽的去处，就是人心所欲得的去处。若真实自尽，念念都出于忠，便能推以及人，事事都出于恕，可见千万人的心，只是这一个心，便都通得，所谓一以贯之者，其意不过如此，岂复有他说哉！夫一以贯万，是圣人传心的要诀；忠以行恕，是学者下手的工夫。其地位不同，而其易简切近，则未尝有二。若曾子者，可谓善发圣人之蕴矣。"
        },
        {
          "originalText": "子曰：“君子喻于义，小人喻于利。",
          "explain": "喻字，解做晓字。义，是天理之所宜。利，是人情之所欲。孔子说：“天下之道二，义与利而已，而君子小人，实于此辨焉。”君子循天理，有好义之心，又有精义之学。故其立身行己，只在义上见得分明，义当进则进，不然则退，义当受则受，不然则辞。虽有时不避形迹，而涉于为利者，亦不过委曲以成其义耳。是君子之心，惟知有义，而义之外，皆非所知矣。小人徇人欲，有怀利之心，又有谋利之巧，故其立身行己，只在利上见得分明，有利则趋，无利则避，利于己则为，利于人则否。虽有时假托形迹，似乎为义者，亦不过借此以图其利耳。是小人之心，惟知有利，而利之外，皆非所知矣。夫君子小人所喻不同如此。然喻义则君子固自成其君子，而天下之事，亦因以济。喻利则小人固终陷于小人，而天下之事亦因以坏。修己用人者，可不慎择而深辨之哉！"
        },
        {
          "originalText": "子曰：“见贤思齐焉，见不贤而内自省也。",
          "explain": "贤，是有德的人。齐，是齐一。不贤，是无德的人。省，是省察。孔子说：“人之自修者，砥砺之功，固当尽于己，观感之益，亦有资乎人。如见个有德的贤人，心必羡之，然不可徒羡之，又必自家思想说：‘善本吾性，事在人为，他有这等贤德，我何为独不能？’必勉强奋发，定要与他一般才罢，这是见贤思齐焉。如见个无德不贤的人，心必恶之，然不可徒恶之，又必自家省察说：‘为恶甚易，自知甚难，他干的这等样事，莫不我身上也有？’一或有之，必当速改以复于善才罢，这是见不贤而内自省也。”夫见贤思齐，则日进于高明，见不贤内省，则不流于污下，此君子之所以成其德也。然是道也，通乎上下者也，人君若能以古之圣哲自期，而务踵其芳规，以古之狂愚为鉴，而毋蹈其覆辙，则为圣君不难矣。"
        },
        {
          "originalText": "子曰：“事父母几谏，见志不从，又敬不违，劳而不怨。",
          "explain": "几，是微。违，是违拂。劳，是劳苦。孔子说：“人子之事父母，固以承顺为孝。然遇着父母有过失，也当谏诤。但有个进谏的道理，不可直言面诤，以伤父母之心。必须和颜悦色，下气柔声，微微的谏他，或待其闲暇而谕之以理，或乘其喜悦而动之以情，务使父母乐从而后已。若见父母的志意未肯听从，必当愈加敬谨。不可因父母不从，就发露于声色，而有违拂之意。就是父母嗔怪，或加以怒责劳苦之事，亦当从容顺受，不可因父母折挫，遂怀怨恨之心，唯积诚以感动之，委曲而开导之，久之则父母亦以幡然悔悟而改图矣。所谓几谏者如此。”昔大舜父顽母嚚，常欲杀舜。舜祗载见瞽瞍，夔夔斋慄，瞽瞍亦允若。夫以瞽瞍之恶，而大舜犹能以孝感之，况未至为瞽瞍者乎！然则孔子所谓几谏，惟大舜能之也。"
        },
        {
          "originalText": "子曰：“父母在，不远游，游必有方。",
          "explain": "方，是方向。孔子说：“父母爱子无所不至，为人子者，必能体父母之心而后可也。若是有父母在堂，不可出外远游。盖凡为人子之礼，冬温而夏清，昏定而晨省，若出外则定省旷而音问疏，不但己之思亲，亦恐亲之念己不忘也，所以不可远游。若或不得已而出游，亦必告父母以一定的方向，如往东则不更从西行，往南则不更从北行，使父母知我定在某处，可以无忧。若有呼唤，便可应期即至而无失也。”夫人子事亲，一出游而不敢轻易如此。又岂可纵肆逸乐，不惜其身，以贻父母之忧乎！所以古之孝子，不登高，不临深，出必告，反必面，无非欲安父母之心而已，为人子者不可不知。"
        },
        {
          "originalText": "子曰：“三年无改于父之道，可谓孝矣。",
          "explain": "本句与前文重复。"
        },
        {
          "originalText": "子曰：“父母之年，不可不知也，一则以喜，一则以惧。",
          "explain": "年，是年岁。孔子说：“父母的年岁，为人子者，须常记念在心，不可以不知也。盖寿数之长短，皆系于天而不可必。今父母寿考康宁，使人子得以承欢于膝下，这是难得之事，岂不可喜。然父母年纪衰迈，来日无多，安能保其长存，这又有不测之忧，岂不可惧。”若知道这一件可喜，又有这一件可惧，时常记念在心，则爱日之诚，自不能已，而所以奉事之者，不敢有一毫之不尽矣！所以说父母之年，不可不知也。"
        },
        {
          "originalText": "子曰：“古者言之不出，耻躬之不逮也。",
          "explain": "出，是发言。逮字，解做及字。孔子说：“人之言行，须要相顾，如今人说得行不得的甚多。若古之学者，沉静简默，不肯轻易出言，这是为何？盖其学务为己，志在躬行，言忠便要尽忠，言孝便要尽孝，句句言语都有下落，心里才安。若只是信口说了，都不能躬行，这便是行不及言，而为夸诞无实之人矣！古之人深以为耻，而不肯为。此其所以慎于言而不轻出也。”古之人惟其尚行，故笃实之风行，今之人只是空言，故浮华之习胜，学术既异，而世道人心亦迥然不同，孔子之言，盖伤之也。"
        },
        {
          "originalText": "子曰：“以约失之者鲜矣！",
          "explain": "约，是收敛不放肆的意思。鲜，是少。孔子说：“凡人立身行己，但是心里放肆，则其所行必有过差。若能收敛省约，件件都守着规矩，岂有差失。如在身心上省约，不为逸乐，非礼之事便不至于丧志而败德；如在用度上省约，不为奢侈无益之费，便不至于伤财而害民，过失断然少矣。”这约之一字最宜详玩。盖人情才放肆，则日就旷荡；自检束，则日就规矩。故成汤制事制心，只是一个懋敬；太甲败度败礼，只是一个纵欲。圣哲狂愚之判，实系于此，可不慎哉！"
        },
        {
          "originalText": "子曰：“君子欲讷于言而敏于行。",
          "explain": "讷，是迟钝的意思。敏，是急速的意思。孔子说：“放言甚易，力行甚难。故言常失之有余，行常失之不足。惟是成德之君子，一心只要做笃实的工夫，其于言语则务欲其讷，非惟不当言的不敢言，就是当言的，亦必谨慎收敛。讷讷然却似迟钝的一般，不敢信口便说，以取失言之悔也。于行事则务欲其敏，除是有所不知则已，若知道当行的事，便奋发勇往，急急然惟恐失了的一般，不敢少有怠缓，以致废时而失事也。”欲讷于言，则言必能顾行，欲敏于行，则行必能顾言，岂非慥慥笃实之君子乎！"
        },
        {
          "originalText": "子曰：“德不孤，必有邻。",
          "explain": "孤，是独立。邻，是邻舍。孔子说：“德乃人心之所固有，亦人情之所同好。人而无德，则人皆贱恶，固有独立而无与者。若是有德的人，则岂有孤立之理乎！必然同声相应，同气相求，见其德者，固愈加亲近，闻其风者，亦翕然信从，就似居处之有邻家一般，有不招而自来者矣！”故人君修德于上，则万姓归心，四夷向化，而天下为一家，不然，则众叛亲离，不免于孤立而已。可不慎哉！"
        },
        {
          "originalText": "子游曰：“事君数，斯辱矣；朋友数，斯疏矣。",
          "explain": "子游，是孔子弟子言偃，字子游。数，是烦数。辱，是羞辱。疏，是疏远。子游说：“人臣以匡救为忠，朋友以切磋为义，固皆理之当然，然于言语之际，也要见几。且如君有过而谏诤，使其听焉，固可以尽吾心矣。若不肯听，便当去。苟或不识进退，而专务戆直，至于烦数而无已，则君必厌闻，不以为忠，而反以为谤，未免加之以斥辱矣！事君者可不戒哉！朋友有过而相规，使其听焉，固可以尽吾心矣。若不肯听，便当止，苟或不度可否，而徒好尽言，至于烦数而不止，则彼必厌听，不以为德而反以为怨，必将日至于疏远矣。交友者可不戒哉！”然子游之说，特为进言者发耳。若夫为君为友者，又当思毒药苦口利于病，忠言逆耳利于行，优容褒奖，以求乐告之诚，虚心受善，以求切磋之益，庶德日进而过日寡，与圣贤同归矣！若一有厌恶之心，而加之以疏辱之罪，则在彼固以言为讳，而不肯再言。他人亦以彼为戒而无复直言，上下隔绝，彼此蒙蔽，其害有不可胜言者矣！听言者，又可不戒哉！"
        }
      ]
    ]
  },
  {
    "chapterName": "公冶长第五",
    "introduction": "此篇皆论古今人物贤否得失，盖修穷理之一端也，凡二十七章。胡氏以为疑多子贡之徒所记云。",
    "paragraphs": [
      [
        {
          "originalText": "子谓公冶长：“可妻也。虽在缧绁之中，非其罪也”。以其子妻之。",
          "explain": "公冶长是孔子弟子。女嫁与人为妻，叫做妻。缧，是黑索，绁，是拘挛犯罪的人，以黑索拘系之于狱中，叫做缧绁。子，是所生的女，古人男女皆谓之子。门人记孔子曾说：“人伦莫重于婚姻，匹配莫先于择德。吾门弟子，若公冶长者，可以女配之而为妻也。他平日素有德行，虽曾为事拘系于狱中，乃是被人连累，而非其自致之罪，既非其罪，则固无害其为贤矣！”于是以所生之女而为之妻焉。此可见圣人之于婚嫁，不论门族，而惟其人；不拘形迹，而惟其行。非独谨于婚姻，亦可谓明于知人者矣！"
        },
        {
          "originalText": "子谓南容：“邦有道，不废；邦无道，免于刑戮”。以其兄之子妻之。",
          "explain": "南容，是孔子弟子南宫縚，字子容。废，是弃而不用。戮，是杀戮。门人又记，孔子曾说：“吾门有南容者，尝三复白圭之诗，平日素能谨言慎行，是个有德的君子。若遇着国家有道，君子进用之时，他有这等抱负，必然人人荐举他，使之得位而行道，必不至于废弃而不用也。遇着国家无道，小人得志之日，他既言语谨慎，不至取怨于人，亦可以全身而远害，必不陷于刑戮之祸也。处治处乱，无所不宜，则其贤可知矣！”于是以其兄之女配之而为妻焉。前章以己女妻公冶长，此章以兄女妻南容，皆择贤而配，圣人致谨于婚配之礼如此。"
        },
        {
          "originalText": "子谓子贱：“君子哉若人！鲁无君子者，斯焉取斯？”",
          "explain": "子贱，是孔子弟子宓不齐，字子贱。斯字，解做此字。上一个斯字是说此人，下一个斯字，是说此德。门人记孔子曾说：“人之为学，都要学做君子。然君子之德，未易成也。吾门若宓子贱者，他的学力已造到成德的地位，君子哉！其若人乎！然子贱所以能为君子，虽是他自家向上，有志进修，亦由我鲁国多君子，人才众盛，故得以尊师取友而成其德耳。若使鲁没有许多君子，则虽要尊师，而无师之可尊；虽要取友，而无友之可取。斯人也，亦不免孤陋寡闻而已，将何所取以成此德乎！”此可见自修之功固不可废，而师友之益，又不可无也。然师友之益，不但学者为然，古之圣帝明王屈己下贤，虚心访道，尊崇师保，而资其启沃，慎择左右，而责之箴规，无非欲严惮切磋，养成君德而已。古语说：“师臣者帝，宾臣者王。”然则人君欲成其德者，当以好学亲贤为急。"
        },
        {
          "originalText": "子贡问曰：“赐也何如？”子曰：“女，器也。”曰：“何器也？”曰：“瑚琏也。”",
          "explain": "赐，是子贡的名。器，是器皿。瑚琏，是宗庙中盛黍稷的器，以玉为之，夏时叫做瑚，商时叫做琏。子贡平日，好比方人物，因见孔子以君子许子贱，故以己为问，说道：“赐也学于夫子，亦尝有志于进修，但造诣之浅深，自家不能知道。夫子试说赐之为人何如？”孔子答说：“人之为学，以致用为贵，如世间器皿，以适用为宜，汝能告往知来，料事多中，既达于政事，又长于言语，是个有用的成材，就如器之适用一般，汝其已成之器乎。”子贡又问说：“器有贵贱之不同，夫子以赐为器，不知是何等样器？”孔子答说：“器中有瑚琏者，陈之于宗庙，而饰之以玉，最是贵重而华美的。以汝之才，试之于用，必然事功可就，文采可观，而足以为邦家之光，岂非器中之瑚琏矣乎。”然则子贡虽未能如君子之不器，其亦器之贵者矣。"
        },
        {
          "originalText": "或曰：“雍也仁而不佞。”",
          "explain": "雍，是孔子弟子冉雍。仁，是有德。佞，是口才。春秋之时，人皆以口才便利为尚。而冉雍为人，重厚简默，与时俗不同。故或人谓孔子说：“夫子之弟子有冉雍者，论其为人，可谓仁而有德者矣。但惜其素性简默，无有口才，而不能为佞也。”或人之言，非惟不知仁，亦不知冉雍者矣。"
        },
        {
          "originalText": "子曰：“焉用佞？御人以口给，屡憎于人。不知其仁，焉用佞？”",
          "explain": "御字，解做当字。譬如说，抵当人一般。给，是取办。屡，是多的意思。憎，是恶。孔子答或人说：“汝以冉雍为不佞，是必以佞为贤矣。自我言之，人之立身行己，亦何用于佞乎？盖佞人所以应答搪抵人者，只是以口舌便利，取办一时。那甜言巧语，高谈阔论，外面虽似有才，其中都没有真实的意思，被人看破，却是个邪佞的小人。不足以取重，而徒多为人所憎恶耳，亦何益之有哉。今汝以雍为仁，我固不知他仁与不仁。但说他不佞，正是好处。要那口才何用乎！然则汝之所惜者，正吾之所取也。”由孔子之言观之，可见学者当用力于仁，而不可不深戒夫佞矣。然佞人不止可憎，为害甚大，盖其言足以变乱黑白，颠倒是非。或逞其私智，以纷更旧章；或巧为谗言，以中伤善类。人君若不知而误听之，未有不败坏国家者。故大舜疾谗说之殄行，孔子恶利口之覆邦，皆所以垂戒于万世也。用人者可不以远佞于九德之行。周文武克知灼见于三宅之心，这正是得知人之可信而后用之，所以能收得人之功。可见出仕者，固不可不自审其所长，而用人者尤不可不深考其所蕴也。"
        },
        {
          "originalText": "子曰：“道不行，乘桴浮于海，从我者，其由与！”子路闻之喜。子曰：“由也好勇过我，无所取材。”",
          "explain": "桴，是木筏。由，是子路的名。材与裁字同，是量度的意思。昔春秋之时，上无贤君，不能信用孔子，故孔子有感而叹说：“吾之周流四方，本欲得位行道，以致君而泽民。今人不见知，世不我用，吾道已不行于天下矣！虽居在中国，亦何为乎！不如乘着木筏，浮于海中，可以绝人而逃世。吾门弟子中求其可以从我远去者，其惟仲由欤？”盖仲由勇于为义，是个临难不避的人，故孔子许其从己。然这说话也只是孔子自伤其不遇而假设之词，非真有浮海之意也。子路闻之，以为夫子不许他人而独许己，遂信以为实然，心中喜悦。盖过于信人为急务哉！"
        },
        {
          "originalText": "孟武伯问：“子路仁乎？”子曰：“不知也。”",
          "explain": "孟武伯，是鲁大夫仲孙彘。仁，是本心之全德。孟武伯问于孔子说：“夫子之门人如子路者，果能全其心德而为仁人矣乎。”孔子以仁道至大，不可轻许，故答他说：“仁具于各人之心，难以必其有无，仲由之仁与未仁，我所不知也。”"
        },
        {
          "originalText": "又问。子曰：“由也，千乘之国，可使治其赋也，不知其仁也。”",
          "explain": "千乘之国，是诸侯大国，其地可出兵车千乘的。赋，是兵。古者军马都出于田赋中，故叫做赋。孟武伯以知弟子者莫若师。子路之仁，夫子岂有不知的，故又以为问。孔子答说：“由也好勇而果断，便是千乘的大国，若用他管理那兵赋的重事，必能训练倡率，不但使军旅强盛而有勇，抑且使亲上死长而知方，其才之可见者如此。若其心之仁与不仁，吾不得而知也。”"
        },
        {
          "originalText": "“求也何如？”子曰：“求也，千室之邑，百乘之家，可使为之宰也，不知其仁也。”",
          "explain": "求，是孔子弟子冉求。室，是家。邑，是县邑。百乘，是卿大夫之家。有采地十里，可出兵车百乘的。邑长家臣，通叫做宰。孟武伯又问：“夫子之门人若冉求者何如，抑能全其心德而为仁人矣乎？”孔子答说：“求也多才。虽是千家的大邑，百乘的大家，若用他作邑长，必能修政于其邑，而使人民无不安。用他作家臣，必能修职于其家，而使庶务无不举，其才之可见者如此。若其心之仁与不仁，吾不得而知也。”"
        },
        {
          "originalText": "“赤也何如？”子曰：“赤也，束带立于朝，可使与宾客言也。不知其仁也。”",
          "explain": "赤，是孔子弟子公西赤。束带，是着礼服而束带于其上。宾客，是四方来聘的使臣。孟武伯又问：“夫子之门人若公西赤者何如，抑能全其心德而为仁人矣乎？”孔子答说：“赤也知礼。若使他束带立于朝廷之上，应对那四方来聘的宾客，必能通两国之情，达宾主之意，而不至于失礼。其才之可见者如此。若其心之仁与不仁，吾不得而知也。”盖仁之为言，必纯乎天理，而无一私之杂，始终惟一，而无一息之间，才叫做仁。其心之纯与不纯，有非行事所可见，他人所能识者。故夫子于三子皆许其才，而未信其仁。盖以发于外者易见，而蕴于心者难知也。有志于求仁者，当省察于吾心独知之地而后可。"
        },
        {
          "originalText": "子谓子贡曰：“女与回也孰愈？”",
          "explain": "愈字，解做胜字。昔孔子因子贡好比较他人的短长，而或暗于自知，故问之说：“你与颜回同游吾门，你自家说，比他所学，孰为胜乎？”"
        },
        {
          "originalText": "对曰：“赐也何敢望回？回也闻一以知十，赐也闻一以知二。”",
          "explain": "子贡对说：“人之资质有高下，悟道有深浅。赐也何敢指望到得颜回。盖回也是生知之亚，资禀既高，工夫又到，其于天下的义理，听得一件，就晓得十件。从头彻尾，无不默识心通，盖闻一以知十者也。赐也学而知之，资禀既庸，工夫又浅，其于天下的义理，听得一件，只晓得两件，比类思索，因此识彼，不过闻一以知二而已。”即此观之，回胜于赐远矣！赐也果何敢望回乎！"
        },
        {
          "originalText": "子曰：“弗如也，吾与女弗如也。”",
          "explain": "与，是许。孔子因子贡之言，遂激励引进之说道：“汝自谓不如颜回，此言非虚，汝委的不及他。但人莫难于自知，而亦莫难于自屈。今汝自以为弗如，则是自知之明，而又不难于自屈矣。夫能自知，则必不安于所已知，能自屈则必益勉其所未至，今日之不如，安知他日之终不如乎？我诚取汝这弗如之说也。”其后子贡终闻性与天道，不止于闻一知二而已。岂非夫子激励造就之欤！然这弗如之一念不但是学者上进的机栝，若使为人君者能以古之帝王为法，而自视以为不如，必欲仰慕思齐而后已，则其进于圣帝明王也不难矣！"
        },
        {
          "originalText": "宰予昼寝。子曰：“朽木不可雕也，粪土之墙不可杇也。于予与何诛？”",
          "explain": "宰予，是孔子弟子，姓宰名予。昼寝是当昼而睡。朽木，是腐坏的木植。雕，是刻。墙壁上盖着泥粉，叫做杇。诛，是责。何诛，是说不足怪责。昔孔门设教，只是要人好学。盖能好学，则志气精明，工夫勤密，然后可以入道。宰予学于孔子之门。一日当昼而寝，这便是昏昧怠惰，不肯好学的人。故孔子责之说：“凡木之坚者，然后可雕。若朽腐之木，虽欲雕刻成文，必然坏烂，岂可得而雕乎？凡墙之固者，然后可杇。若粪土之墙，虽欲饰以泥粉，必然剥落，岂可得而杇乎？譬如人必有志向学，然后可教，今予之昏惰如此，就似那朽腐之木，粪土之墙一般，虽欲教之，而无受教之地矣！然则我之于予，又何用于责备乎！”言不足责乃所以深责之也。夫宰予以一昼寝之失，而孔子责之严切如此，可见人当以勤励不息自强，以怠惰荒宁为戒。故禹惜寸阴，成汤昧爽丕顕，文王日旻不遑息，孔子发愤忘食，此皆生知之圣人，其勤如是。况未及圣人者乎！学者不可不深省也。"
        },
        {
          "originalText": "子曰：“始吾于人也，听其言而信其行；今吾于人也，听其言而观其行。于予与改是。”",
          "explain": "宰予平日每自言其能学，今乃当昼而寝，志气昏惰，则行不及言甚矣！故孔子又警之说：“听言甚易，知人甚难。我始初与人相处，只道会说的便会行。故听人之言，就信其行，而不复疑其素履之何如。如今看来，凡人能言者多，躬行者少。若闻言便信，未免为人所欺，故自今以往，听人之言，必观其行，而不敢遽信其言，行之相顾也。夫既听其言，又观其行，则虽善为词说者，无所用其欺，而可免于轻信之失矣。然我所以能改此失者，只为宰予能言而行不逮。我起初曾信其行，而今日始觉其非，故以此为戒，而改我之失耳。”孔子此言，所以深警宰予，使之惕然而悔悟也。夫师弟子之间，朝夕相与，其为人贤否易见，而孔子犹谓以言取人，失之宰予。盖人之难知如此，况人君之于臣下，尊卑之分悬殊，接见之时甚少，欲尽知其心术之微，得其行事之实，岂不难哉！盖敷奏必以言，而明试必以功，此即听言观行之法，用人者所当加意也。"
        },
        {
          "originalText": "子曰：“吾未见刚者。”或对曰：“申枨”。子曰：“枨也欲，焉得刚？”",
          "explain": "刚，是坚强不屈的意思。申枨，是孔子弟子。姓申名枨。欲，是贪欲。孔子说：“凡人立身于天地间，须是有刚强之德，乃为可贵。然我看如今的人，都未见有刚强者。”孔子之所谓刚，不但是血气强勇而已，是说入得天地之正气，而又有理义以养成之，其中磊落光明，深沉果毅，凡富贵贫贱，祸福死生，件件都动他不得。然后能剖决大疑，而无所眩惑，担当大事，而不可屈挠，此乃大丈夫之所能，而非人之所易及者，故孔子叹其难见耳。或人不知其义，止见申枨血气强勇，就以为刚。乃对孔子说：“夫子之门人如申枨者，其为人岂不刚乎！”孔子答说：“凡刚强的人，必不屈于物欲。枨也多欲，不能以理义为主，则凡世间可欲之事，皆足以动其心。其心一动，则意见必为之眩惑，志气为之屈挠矣，焉得谓之刚乎！”观孔子此言，可见有欲则无刚，惟刚则能制欲，凡学为圣贤者，不可以不勉也。然先儒有言，君德以刚为主。盖人君若无刚德，则见声色必喜，闻谀佞必悦，虽知其为小人，或姑息而不能去，虽知其为弊政，或因循而不能革，至于优游不断，威福下移，其害有不可胜言者，欲求致治，岂可得哉！然则寡欲养气之功，在人君当知所务矣。"
        },
        {
          "originalText": "子贡曰：“我不欲人之加诸我也，吾亦欲无加诸人。”子曰：“赐也，非尔所及也。”",
          "explain": "子贡自言其志于夫子，说道：“天下之人，皆同此心。大凡非礼之事，我心固所不欲。度量他人的心，也是不欲的。若以己所不欲者而加之于人，是知有己，而不知有人者之所为也。赐则视人犹己，视己犹人。凡我不欲人加于我之事，我亦不以此而加之于人。”夫观子贡此言，固是他志量高处，然此乃仁者之事，子贡之学尚未能到此地位。夫子恐其自许太过，而行不逮言也，故呼其名而抑之，说道：“最难克者己私，未易全者仁德。如汝所言，凡己之所不欲者，即不以加之于人，则是视天下为一人，而略无形骸之间，以万物为一体，而溥其兼利之仁，这非是心德纯全，而己私克尽者不能。汝之所学，岂能遽及于此乎？所以说非尔所及也。”然孔子此言，不是言难以阻人之进，盖欲子贡知其难而加勉也。"
        },
        {
          "originalText": "子贡曰：“夫子之文章，可得而闻也；夫子之言性与天道，不可得而闻也。”",
          "explain": "文章，是德之见乎外者，指威仪文词说。性，是人所受于天之理。天道，是天理自然之本体。子贡说：“凡人学力有浅深，故其闻道有难易。吾夫子平日，凡动作威仪都有法度，言词议论都有条理，这是德之著，见乎外的，所谓文章也。夫子固常以教人，无所隐秘，故不待深造者而后闻之。凡浅学之士，从游门墙者，皆可得而闻也。若夫仁义礼智，禀于有生之初的，叫做性。元亨利贞，运于於穆之中的，叫做天道。夫子亦尝言之矣。但道理极其微妙，言语难以形容，若不是学力既深，可与上达的人，决不轻告。故不但浅学之士，不得而闻，虽久于门墙者，亦不可得而闻也。”盖子贡晚年进德，乃始得闻性与天道，故叹之如此。然圣门教人，循序渐进，于此亦可见矣。"
        },
        {
          "originalText": "子路有闻，未之能行，唯恐有闻。",
          "explain": "这是门人记子路之勇于为善，说道：“人固贵于闻善，然闻而不行，与不闻同。行而不力，与不行同。惟子路之为人，有兼人之才，负刚果之气，每闻一善言，必即时行之而后已，若或未之能行，则此心惕然不宁，惟恐复有所闻，而前闻者，或壅滞而不得行焉。”曰惟恐有闻者，非不欲后闻之至也，乃其惟日不足之心，欲急行其所已闻，而预待其所未闻耳。观未行而惟恐有闻，则既行而惟恐不闻可知矣！子路之勇于体道如此。"
        },
        {
          "originalText": "子贡问曰：“孔文子何以谓之‘文’也？”子曰：“敏而好学，不耻下问，是以谓之‘文’也。”",
          "explain": "孔文子，是卫国的大夫，姓孔名圉，谥文子。敏，是聪敏。下问，是问于在下的人。古时生有爵位者，没必有谥。人有贤否，则其谥有美恶。孔圉得谥为文，是个美谥。子贡疑其为人不足以当之。乃问于孔子说：“卫大夫孔文子者，不知何以得谥为文也。”孔子答说：“凡人资性明敏的，便恃着他的聪明，不肯向学。孔圉虽有明敏之资，他却不敢自是。凡礼乐名物，古今事变，一一讲习讨论，而无有厌心，其勤学如此。爵位尊显的，便看得自己过高，耻于下问。孔圉虽居大夫之位，他却不敢自亢，凡事有未知的，一一访问于人，虽下僚之卑，小民之贱，也虚己问之，而不以为耻，其好问如此。盖谥法中有云：勤学好问曰‘文’。今孔圉之行，正与之相合，此其所以得谥为‘文’也。”然勤学好问，不但是卿大夫之美行，虽古帝王之盛节亦不外此。盖人君有聪明睿智之资，尤易于自用；居崇高富贵之位，尤难于自谦。然不学，则义理无由而明；不问，则闻见无由而广。故虞舜好问好察，所以为圣；高宗逊志典学，所以为贤，真万世人君所当法也。"
        },
        {
          "originalText": "子谓子产：“有君子之道四焉：其行己也恭，其事上也敬，其养民也惠，其使民也义。”",
          "explain": "子产，是郑大夫公孙侨，字子产。恭，是谦逊。敬，是谨恪。惠，是恩惠。义，是裁制经画，事事都有条理的意思。昔孔子尝称说：“郑大夫子产之为人，有君子之道四件，何以见之？彼恭以持己，君子之道也。子产之行己也，则有善不矜，有劳不伐，推贤让能，退然恭逊以自居，是有君子之道一也。敬以事君，君子之道也。子产之事上也，则内修国政，外睦诸侯，小心尽职，始终敬谨而无怠，是有君子之道二也。仁以育民，君子之道也。子产之养民也，则利必为之兴，害必为之去，件件都替百姓留心，而有厚下之深恩，是有君子之道三也。义以正民，君子之道也。子产之使民也，则辨上下之等，均彼此之利，事事都有个限制，而无姑息之弊政，是有君子之道四也。”子产备这四美于上下人己之间，是以能尊主庇民，而郑国赖之，岂非春秋之贤大夫欤！然郑以区区小国，能用子产，故虽介于晋楚二强国之间，而竟能杜其侵陵之患，若人君以天下之大，任用得人，则其长治久安之效，又当何如哉！此用人者所当加意也。"
        },
        {
          "originalText": "子曰：“晏平仲善与人交，久而敬之。”",
          "explain": "晏平仲，是齐大夫。姓晏名婴，字平仲。善与人交，是说能尽交友之道。孔子说：“朋友五伦之一，人所必有者也。但交友者多，善交者少，惟晏平仲则善与人交，而能得其道焉。何也，人之交友，起初皆知相敬，至于既久，则习狎而怠忽矣！怠忽则必生嫌隙，嫌隙既生，交不能全矣。平仲之与人交也，始固相敬，至于久而亦然，不以其习狎而生怠忽之心，故交好之义，始终无替，此平仲之所以为善与人交也。”"
        },
        {
          "originalText": "子曰：“臧文仲居蔡，山节藻棁，何如其知也？”",
          "explain": "臧文仲，是鲁大夫，姓臧名辰，谥为文仲。素以智名者也。居，是藏。蔡，是大龟，用以为卜者，以其获之于蔡地，遂名为蔡。节，是柱头斗栱。藻，是水草。棁，是梁上短柱。孔子说：“人都以臧文仲为智，然明智之人必然见理不惑，试举他一事言之。且鲁之有大龟，虽所以为占卜之用，然不过以决疑示兆而已，非能司其祸福之柄也。文仲乃为屋室以居之，又将那柱头斗棋上，都刻为山形，梁上的短柱，都画上水草，真若大龟居处于其中，而能降福于人者，斯不亦大惑矣乎。”盖人有人之理，神有神之理。人之理所当尽，而神之理，则幽昧而不可知。惟尽其所当务，而不取必于其所难知，斯可谓智矣。今文仲不务民义，而谄渎鬼神如此，则是不达幽明之理，而惑于祸福之说，其心之不明亦甚矣。何如谓之智乎？夫文仲之智，人皆称之。夫子独据实而断其不然，这正是众好之必察焉者。所以为人物之权衡也，观人者宜取以为法。"
        },
        {
          "originalText": "子张问曰：“令尹子文，三仕为令尹，无喜色；三已之，无愠色。旧令尹之政，必以告新令尹。何如？”子曰：“忠矣！”曰：“仁矣乎？”曰：“未知，焉得仁？”",
          "explain": "令尹，是楚国执政的官。子文，是楚人。仕，是进用。已，是罢官。愠，是怒意。子张问于孔子说：“楚国之令尹，有子文者，曾三次进用而为令尹，人都羡他尊荣，他却无喜悦之色。及至三次罢官，人都替他称屈，他也无愠怒之色。其喜怒不形如此。他既罢了令尹，又把旧日所行的政事，一一告与新任的令尹。略无猜嫌妒忌之心。其物我无间如此。这等为人，夫子以为何如？”孔子答说：“凡人患得患失，妒贤嫉能者，都是只顾自己，不为国家，此乃不忠者之所为也。子文这等行事，是不贪恋朝廷的名爵，只要干济国家的政事，是个实心为国的人，可以为忠矣。”子张又问说：“制行如此，人所难能，亦可谓之仁人矣乎？”孔子答说：“仁在于心，不在于事。子文之行虽忠，然未知他心里如何，若有一毫修名为人之意，便是私心，而非纯乎天理之公者矣！焉得便信其为仁矣乎！故不敢以轻许之也。”"
        },
        {
          "originalText": "“崔子弑齐君，陈文子有马十乘，弃而违之。至于他邦，则曰：‘犹吾大夫崔子也。’违之。之一邦，则又曰：‘犹吾大夫崔子也。’违之。何如？”子曰：“清矣。”曰：“仁矣乎？”曰：“未知，焉得仁？”",
          "explain": "崔子，是崔杼。陈文子，是陈须无。都是齐国的大夫。马四匹为一乘，十乘是四十匹。违，是去。犹，是相似。子张又问说：“当初齐大夫崔子弑了齐君，那时也有同恶相济的，也有隐忍不去的。独有陈文子者，恶其为逆，不肯与之同列，虽以大夫之官，有马十乘之富，飘然弃而去之，略无贪恋顾惜之意。及到他国，见其臣皆不忠，便说道：‘这就与吾国大夫崔子一般，不可与之共事，遂违而去之。’又到一国，见其臣亦不忠，又说道：‘这也与吾国大夫崔子一般，亦不可与之共事。’又违而去之，其审于去就如此。夫子以为何如？”孔子答说：“凡人与恶人居，便要污坏了自己的名节，清者不为也。今陈文子不恋十乘之富，不居危乱之邦，是个洁白不污的人，可以为清矣。”子张又问说：“制行如此，人所难能，亦可谓之仁人矣乎？”孔子答说：“仁在于心，不在于事。文子之行虽清，未知他心里如何？若有一毫愤俗自高之意，而后来不免于怨悔，这也是私心，而非纯乎天理之公者矣！焉得遽信其为仁矣乎！故亦不敢轻许之也。”大抵人之行事易见，而心术难知。其念虑之纯与不纯，存主之实与不实，有非他人所能尽察者，故虽以文子之忠，文子之清，而夫子犹未肯以仁许之。观此，则仁之所以为仁，其义可知，而人之有志于仁者，当知所务矣。"
        },
        {
          "originalText": "季文子三思而后行，子闻之，曰：“再，斯可矣。”",
          "explain": "季文子，是鲁大夫，名行父，谥为文子。三思，是思了又思，展转无已的意思。再，是两次思量。昔鲁大夫季文子者，是个用心周密的人，每事必反复计虑，思了又思，展转数次，然后施行。孔子闻之说道：“人之处事，固不可以不思，而亦不可以过思。故凡事到面前，造次未可轻动，从而仔细思量一番，及思之已得，犹恐见不的确，又平心易气，再加斟酌一番。如此，则事理之可否从违，裁度已审，行出来自然停当，斯亦可矣！何必三思为哉！”盖天下之事，虽万变不齐，而其当然之理，则一定不易，惟在义理上体察，则再思而已精，若用私意去揣摩，则多思而反惑。中庸教人以慎思者，意正如此。善应天下之事者，惟当以穷理为主，而济之以果断焉，则无所处而不当矣！"
        },
        {
          "originalText": "子曰：“宁武子，邦有道，则知；邦无道，则愚。其知可及也，其愚不可及也。”",
          "explain": "宁武子，是卫大夫宁俞，谥武子。知，是明知。愚，是昏愚。盖世有明知之人，有昏愚之人。又有一等明知之深，韬光用晦，权以济变，反似昏愚的，则所谓大知若愚者也。宁武子能然，故孔子称之说：“宁武子之为卫大夫也，当国家有道，治平无事之时，则明目张胆，知无不为，直道而行，无少委曲，他的才能智识，都昭然可见，真是个明智的人。及至国家无道，危急存亡之日，则韬晦隐默，不露形迹，而卒以济艰难之业，成国家之事。他的才能智识都暗然内用，却似个昏愚的人。夫观人者，但据其迹而未窥其深，则必以愚不如智矣。自我而言，治平之世，公道昭明，君子可以行其志，但有才能的都会干济，有见识的都会主张，武子之智犹或可得而及也。至于昏乱之朝，则国势倾危，人心疑忌，忠君为国之深意，既难以自明，扶危定乱之微权，又难于先泄，最人之所难处者。武子之愚，乃能上济其君，下保其身，正是他善藏其用的妙处，非天性忠义，而才足以运之者，不能如此，人岂可得而及哉？”盖处常易，处变难，用其智以立功者易，藏其智而成功者难。所以说其智可及也，其愚不可及也。夫自人之分量而言，知固不如愚，然时乎无道，乃使君子不敢用知而用愚，则岂国家之幸哉！"
        },
        {
          "originalText": "子在陈，曰：“归与！归与！吾党之小子狂简，斐然成章，不知所以裁之。”",
          "explain": "陈，是陈国。党，是乡党。小子，指门人之在鲁者说。狂简，是志大而略于事的意思。斐，是有文采。裁，是裁正。昔孔子周流四方，至于陈国淹留既久，知道之终不能行，乃发叹说道：“吾之初心本欲行其道于天下，今周流至此，而竟不一遇，是世终无用我者矣。我其归于鲁国欤？我其归于鲁国欤？然我之道虽不行于当时，犹当传于后世。今吾乡党后生中，尽有识见高明，志趣远大，不拘拘于小节的人，看他规模体段，已是斐然有文理之可观。但其志愿太高，学力未至，不知以中正之道自裁，而时出于规矩之外耳。若就其才性之所近者，因而抑其过，矫其偏，以归于中，则皆可以任斯道之重，而寄吾欲行之心，又何必栖栖遑遑以求用于世哉！此吾之所以欲归也。”是可见圣人为当时计，固欲其道之行，为后世计，又欲其道之传，其心真有视天下为一家，通古今为一息者。此所以继往圣开来学，而教万世无穷也欤？"
        },
        {
          "originalText": "子曰：“伯夷、叔齐，不念旧恶，怨是用希。”",
          "explain": "伯夷、叔齐，是孤竹君之二子。长曰伯夷，幼曰叔齐。念，是追念。怨，是恨。希字，解做少字。孔子说：“伯夷、叔齐，古之至清介者也。大凡清介的人，疾恶太甚，其中多褊狭而不能容物，故人亦多有怨之者。惟伯夷、叔齐，持身虽介，处心甚平，人有不善，固尝恶而绝之矣。然只是恶其为恶，而非有心以绝其人也。若其人能改而从善，则止见其善，而不复追念其旧日之恶，其好恶之公，度量之广如此，所以人皆尊敬而悦服之，就是见恶的人，亦乐其后来之能恕，而谅其前日之无他。怨恨之心，自然少矣。”此可见疾恶固不可以不严，而取善尤不可以不恕。古圣贤处己待人之道，莫善于此。若人君以此待下，尤为盛德。盖凡中材之人，孰能无过，惟事出故为，怙终不悛者，虽摈斥之，亦不足惜，然或一事偶失，而大节无亏，初时有过，而终能迁改，以至迹虽可议，而情有可原，皆当舍短取长，优容爱惜，则人人乐于效用，而天下无弃才矣。虞舜宥过无大，成汤与人不求备，皆此道也。此可以为万世人君之法。"
        },
        {
          "originalText": "子曰：“孰谓微生高直？或乞醯焉，乞诸其邻而与之。”",
          "explain": "鲁人有微生高者，素以直见称于时。人但慕其名而不察其实，故孔子举一事以断之说：“人皆以微生高为直，如今看来，谁说他是直人。盖所谓直者，必诚心直道，有便说有，无便说无，无一毫矫饰，而后谓之直。今微生高者，人曾问他求醋，其家本是没有，却不肯直说，乃转问邻家求来与他，这是曲意徇物，掠人之美以市己之恩矣。即此一事推之，则其心之私曲，行之虚伪可知，焉得谓之直乎？”夫微生高之直，人皆信其行，而孔子独断其非，所谓众好之必察焉者如此。然当时似是而非，虚名无实者，不止一事，利口之人乱信，乡愿之人乱德，孔子皆深恶而痛绝之。盖欲人致谨于名实之辨也，然则用人者岂可徒采虚名而不考其实行哉！"
        },
        {
          "originalText": "子曰：“巧言、令色、足恭，左丘明耻之，丘亦耻之；匿怨而友其人，左丘明耻之，丘亦耻之。”",
          "explain": "巧言，是言词工巧。令色，是颜色和柔。足恭，是过于恭敬而不中礼者。左丘明，是当时贤人。耻，是羞愧。丘，是孔子的名。匿，是藏。怨，是恨。孔子说：“人莫善于诚心直道，莫不善于谄媚奸险。盖人之相接，词色体貌，本自有个正礼。若乃巧好其言，务以悦人之听，令善其色，务以悦人之观，足过其恭，务以悦人之意，是谄媚之人也。左丘明为人方正，尝耻之而不为，我亦耻之而不为焉。人之相交，恩怨亲疏自有个真心，若心里本是怨恨其人，却深藏不露外面，佯与交好，是奸险之人也。左丘明存心诚笃，尝耻之而不为，我亦耻之而不为焉。”夫观此二者为圣贤之所共耻，学者可不省察乎此，而立心以直哉！然此等人不止可耻，尤有害于国家。盖谄媚之人，阿谀逢迎，非道取悦，人情易为其所惑。奸险之人，内怀狡诈，外示恭谨，人情易为其所欺。若不识而误用之，则其流祸有不可胜言者，所以古之圣王，远佞防奸，如畏鸩毒而避蛇虺，盖为此也。"
        },
        {
          "originalText": "颜渊、季路侍。子曰：“盍各言尔志。”",
          "explain": "盍，是何不。志，是心之所向。昔颜渊、季路尝侍于孔子之侧。孔子问他说道：“二子学于吾门，都各有个志向，何不各言尔之志于我乎！”"
        },
        {
          "originalText": "子路曰：“愿车马，衣轻裘与朋友共，敝之而无憾。”",
          "explain": "衣，是着衣。裘，是皮服。敝，是坏。憾，是恨。子路因孔子问其志，遂对说道：“人不可以自私，且如乘的车马，着的轻裘，虽是我之所有，然天下之物当为天下用之，不得专之以为己私也。我若有此车马轻裘，则愿与朋友共之，虽至敝坏亦无所恨焉。”盖子路勇于为义，识见高明，不屑为鄙吝之事，故其言如此。"
        },
        {
          "originalText": "颜渊曰：“愿无伐善，无施劳。”",
          "explain": "伐，是矜夸。善，是有德。施，是张大的意思。劳，是有功。颜渊因孔子问其志，遂对说道：“人不可以自足，且如人能修德，虽有善可称，然亦不过复吾性分之所固有而已。我若有善，不欲矜夸于人人，而自以为善焉。人能立功，虽有劳可表，然不过尽吾职，分之所当为而已。我若有劳，不欲张大于人，而自以为劳焉。”盖颜子几于无我，气象浑厚，无一毫满假之心，故其言如此。"
        },
        {
          "originalText": "子路曰：“愿闻子之志。”子曰：“老者安之，朋友信之，少者怀之。”",
          "explain": "安，是安逸。怀，是抚恤的意思。子路问于孔子说：“吾二人之志，已各言于夫子矣。但不知夫子之志何如？愿有闻焉。”孔子答说：“吾之志无他，只愿天下之人各得其所而已。盖天下之人不同，有老者焉，有朋友焉，有少者焉。老者当安，吾愿养之以安，而使之各享其逸。朋友当信，吾愿与之以信，而使之各全其交。少者当怀，吾愿抚恤之以恩，而使之各适其性，随其心之所欲得，而与之以理之所本然。此则吾之志也。”合而观之，子路公其物于人，而有难于兼济。颜子忘其善于己，而犹出于有心。惟夫子之志兼利万物而不知其功，仁覆天下而不见其迹，真与天地之量一般，又岂二子之所能及哉！使得君师之位，以行其政教，则时雍风动之化，当与尧舜比隆，惜乎不得其位，徒有志而未遂也。"
        },
        {
          "originalText": "子曰：“已矣乎！吾未见能见其过而内自讼者也。”",
          "explain": "已矣乎，是绝望之辞。内自讼，是心里自家悔责。孔子说：“人不能以无过，而能改则可为君子。然必自知其过，而内自讼责，则即其悔悟深切，而能改可必矣。我尝以此望于天下之人，自今看来，凡人有过，不是饰非以自文，便是委靡以自安，并未见有自家知所行的不是，而内自悔责者也。然则欲求其能改过，岂可得乎！昔之所望于人者，今则已矣。”这是孔子欲人悔过迁善，故为是绝望之辞，以激励天下人的意思。大抵悔之一字，乃为善之机。《易》曰：“震无咎者存乎悔。”太甲悔过，自怨自艾，故终为有商之令主。然能居敬穷理以预养此心，则自然邪念不萌，动无过举。圣人所以能立无过之地者，其要在此。若待其有过而后悔之，不亦晚乎？孔子之言，盖为中人以下者发也。"
        },
        {
          "originalText": "子曰：“十室之邑，必有忠信如丘者焉，不如丘之好学也。”",
          "explain": "十室之邑，是十家的小邑。忠信，是资质纯实，可进于道者。丘，是孔子的名。孔子说：“人之造道，固在于天资，而尤须乎学力。我之得闻斯道，非徒以资质之美而已，实由好学以成之也。若但以资质言之，则岂必天下之广，就是那十家的小邑，也必有纯朴笃实，可进于道如我者焉。则天下之如我者，可胜言乎！但人皆恃其美质，不如我之勤敏好学以扩充其资，所以不能闻道，而有成者鲜也。”夫人乃不咎其学之不至，而徒诿于资之不美，岂不过哉！盖美质易得，至道难闻，故君如尧舜，必孳孳于精一，圣如孔子，犹汲汲于敏求，况其他乎！欲法尧舜孔子者当知所以自勉也。"
        }
      ]
    ]
  },
  {
    "chapterName": "雍也第六",
    "introduction": "凡二十八章。篇内第十四章以前大意与前篇同。",
    "paragraphs": [
      [
        {
          "originalText": "子曰：“雍也，可使南面。”",
          "explain": "雍，是孔子弟子冉雍。南面，是人君之位。冉雍素以德行著名，故孔子称许他说：“吾门弟子如冉雍者，其器宇识量，恢恢乎有人君之度，就使之居南面之位，以总理众务，统驭庶民，亦无不可者。”盖仲弓为人宽洪简重，惟宽洪则不失之苛刻，而有容物之量，惟简重则不失之琐碎，而得临下之体，故孔子称之。昔皋陶称帝舜临下以简，御众以宽，文王罔兼知于庶狱庶慎，亦是此意，读者合而观之，可以知君德矣！"
        },
        {
          "originalText": "仲弓问子桑伯子。子曰：“可也，简。”",
          "explain": "仲弓，是冉雍的字。子桑伯子，是鲁人。简，是不烦琐的意思。仲弓知孔子许己南面之意，盖因其器度之简重而取之，而疑子桑伯子之为人，亦有与己近似者。故问说：“子桑伯子之为人如何？”孔子答说：“凡人立身行事，多有过于琐碎，自为烦扰者。伯子为人，简易不烦，盖亦有可取者焉。”按：《家语》记伯子不衣冠而处，是乃率意任情，轻世傲物之徒。而孔子以为可者，毋亦以其真率简略，独超于流俗而取之欤？斯仲弓之所以致疑也。"
        },
        {
          "originalText": "仲弓曰：“居敬而行简，以临其民，不亦可乎？居简而行简，无乃大简乎？”",
          "explain": "仲弓因孔子许子桑伯子之简，而不能无疑于心，乃遂评论之说：“居上临下之道，固贵乎简，然有简当之简，有苟简之简，不可不辨也。若能自处以敬，兢兢业业，无一怠惰放肆之心，则中有主而自治严矣。如是而行简以临其民，凡事只举大纲，存大体，不至于琐屑纷更，则事有要而不烦，民相安而不扰，这才是简当之简，岂不为可贵乎！若先自处以简，恣意任情，无矜持收敛之意，则中无主而自治疏矣。而所行又概从简略，不分缓急，不论重轻，一味只是纵弛，则事无可据之规，民无可守之法，是则苟简之简而已，岂不失之过甚而为太简乎！”仲弓此言，盖以伯子为太简，而疑孔子之过许也。"
        },
        {
          "originalText": "子曰：“雍之言然。”",
          "explain": "然字，解做是字。当时孔子许子桑伯子之简，特就其所可取者而许之，盖亦未暇深论。而仲弓之言则精确至当，诚居上临下不易之定论，故孔子深许之说：“雍也以居敬之简为可，以居简之简为过，其言岂不诚然乎！”此可见仲弓平日盖能居敬而行简者，孔子许其可居南面，其意正在于此。为人君者，若能详味仲弓之言，而知敬简之义，则所谓笃恭而天下平者，亦不外是矣。"
        },
        {
          "originalText": "哀公问：“弟子孰为好学？”孔子对曰：“有颜回者好学，不迁怒，不贰过。不幸短命死矣。今也则亡，未闻好学者也。”",
          "explain": "迁，是移，本怒此人，而又移于他人，叫做迁怒。贰，是重复，已先差失了，后来重复差失，叫做贰过。昔鲁哀公问于孔子说：“夫子之门人弟子甚众，不知谁是好学的人。”孔子答说：“人之为学，必是潜心克己，深造有得，然后谓之能好。吾门弟子中，独有颜回者，是个好学的人。何以见得他好学？夫人意有所拂，孰能无怒，但血气用事的，一有触发，便不能禁制，固有怒于此而移于彼者。颜回也有怒时，但心里养得和平，容易消释，不曾为着一人，连他人都嗔怪了，何迁怒之有乎！夫人气质有偏，不能无过。但私欲锢蔽的，虽有过差，不知悔改，固有过于前而复于后者。颜回也有过失，但心里养得虚明，随即省悟，不曾惮于更改，致后来重复差失，何贰过之有乎！回之潜心克己如此，岂不是真能好学的人，惜其寿数有限，不幸短命而死。如今弟子中，已无此人，求其着实好学如颜回者，吾未之闻矣。岂不深可惜哉！”夫颜回之在圣门，未尝以辩博多闻称，而孔子乃独称之为好学，其所谓学者，又独举其不迁怒，不贰过言之。是可见圣贤之学不在词章记诵之末，而在身心性情之间矣！然是道也，在人君尤宜深省。盖人君之怒，譬如雷霆之震，谁不畏惧，若少有迁怒，岂不滥及于无辜。人君之过，譬如日月之食，谁不瞻睹，若惮于改过，岂不亏损乎大德，故惩忿窒欲之功，有不可一日而不谨者。惟能居敬穷理涵养此心，使方寸之内，如秤常平，自然轻重不差，如镜常明，自然尘垢不深，何有迁怒贰过之失哉！所以说，圣学以正心为要。"
        },
        {
          "originalText": "子华使于齐，冉子为其母请粟。子曰：“与之釜。”请益。曰：“与之庾。”冉子与之粟五秉。",
          "explain": "这一章是门人记圣人用财的道理。子华，是公西赤，字子华。冉子，是冉有。粟，粟谷。釜，是六斗四升。庾，是十六斗。秉，是十六斛。门人记说：夫子用财，惟视义之可否。如子华为夫子出使于齐国，时有母在，冉有恐其缺于养赡，乃为之请粟于夫子。夫子说：“与他一釜。”与之甚少者，所以示不当与也。冉有未达，又请增益。夫子说：“与他一庾。”益亦不多者，所以示不当益也。冉有犹未达，而终以为少，遂自以其粟与之五秉。一秉十六斛，五秉共为八十斛，则与之过多而伤惠矣！"
        },
        {
          "originalText": "子曰：“赤之适齐也，乘肥马，衣轻裘。吾闻之也：君子周急不继富。”",
          "explain": "适，是往。裘，是皮服。周，是周济。急，是贫穷窘急。继，是续。夫子因冉有之过与，乃教之说：“我非吝于财而不与之也。盖赤之往齐国也，所乘者肥壮之马，所衣者轻暖之裘，则其家之富足可知。吾尝闻之，君子但周济那贫难窘急之人，不继续那富足的人。今以赤之富足，而汝乃为之请粟，又多与之，是继富非周急也，夫岂用财之道哉！”这是不当与而与者，夫子教之以义如此。"
        },
        {
          "originalText": "原思为之宰，与之粟九百，辞。",
          "explain": "原思，是原宪，字子思。宰，是邑长。粟，是宰的俸禄。门人又记说：“夫子为鲁司寇时，弟子原思为属邑之宰。夫子与之粟九百，乃其常禄所当得者也，原思却乃辞而不受焉。”盖其素性狷介，故虽常禄亦辞而不受，则过于廉而非理之中矣。"
        },
        {
          "originalText": "子曰：“毋！以与尔邻里乡党乎！”",
          "explain": "毋，是禁止之词。五家为邻，廿五家为里，万二千五百家为乡，五百家为党。夫子因原思之辞禄，乃教之说：“尔毋辞也，盖官有常禄，乃国家之定制，安得以私意辞之。若俸禄有余，则尔之邻里乡党有贫乏者，推以与之，不亦可乎！”而何以辞为也，这是不当辞而辞者，夫子教之以义如此。大抵人之取与辞受，都有个当然的道理。当与而不与，固失之吝；不当与而与，则失之滥；当辞而不辞，固失之贪；不当辞而辞，则失之矫。夫惟圣人，一酌之于义理之中，而自不至有四者之失，视世之私恩小惠，小廉曲谨者，只见其陋而已。善用财者，当一以圣人为准可也。"
        },
        {
          "originalText": "子谓仲弓曰：“犂牛之子骍且角，虽欲勿用，山川其舍诸。”",
          "explain": "仲弓，是孔子弟子冉雍，字仲弓。犂，是杂文。骍，是赤色。角，是头角周正。周人尚赤，故牛之赤色而又头角周正者，乃用于祭祀，若杂色之牛，则贱之而不用也。山川，是山川之神。昔者仲弓之父贱而行恶，仲弓却为圣门高弟，以德行著名，当时有以其父病之者，故孔子取譬之说道：“牛之杂色者，固不可用为祭祀之牺牲，若其所生之子，纯然赤色，而又头角周正，则正祭祀之所须者。人虽以其为犂牛所生，要不用他，然那山川之神，岂能舍此而他享乎。今雍父之恶就如犂牛一般，雍之贤就如牛之骍且角的一般，人虽以其父恶而欲勿用，然有如此之德，自当见用于世，又岂能终废之哉！”是可见圣贤之生，不系乎世类，用人者但当取其才德，而不必问其世类之何如。古之帝王，立贤无方，盖为此也。"
        },
        {
          "originalText": "子曰：“回也，其心三月不违仁，其馀则日月至焉而已矣。”",
          "explain": "回，是孔子弟子颜回，离此至彼，叫做违，从彼来此叫做至。孔子说：“仁乃吾心之全德，必纯乎天理而无私欲之累者，乃足以为仁。若有一私之杂，一息之间，皆非仁也。吾门弟子有志于仁者多矣，其中独有颜回，天资既高，学力又到，真能克去己私，复还天理，至于三月之久，而其心之所存所发未尝有一毫私欲之间杂，盖庶几乎中心安仁者焉。其余众弟子，一般也去求仁，也有到得仁的时候，但已得而复失，暂明而复蔽。或一日之内能至于仁，不能日日如此。或一月之内能至于仁，不能月月如此，欲如回之三月不违，岂可得乎！”观孔子此言，不惟知圣门弟子之优劣，亦可以见仁道之难成矣！然孔子他日又言，我欲仁，斯仁至矣，则亦岂言难以沮人之进者哉！盖仁具于心，故欲之而即至，心惟易放，故舍之而即失，欲求仁者先收放心可也。"
        },
        {
          "originalText": "季康子问：“仲由可使从政也与？”子曰：“由也果，于从政乎何有？”曰：“赐也可使从政也与？”曰：“赐也达，于从政乎何有？”曰：“求也可使从政也与？”曰：“求也艺，于从政乎何有？”",
          "explain": "季康子，是鲁大夫。从政，是为大夫而从事于政治。果，是有决断。达，是通事理。艺，是多才能。何有，是说不难的意思。季康子问于孔子说：“夫子之门人若仲由者，可使为大夫而从政也与？”孔子答说：“凡人优柔不断者，不足以从政。由也，勇于为义，是刚强果毅的人，使为大夫，必能决大疑，定大计，当断即断，有振作而无废弛矣！其于从政，何难之有。”季康子又问说：“如端木赐者，可使为大夫而从政也与？”孔子答说：“凡人执滞不通者，不足以从政，赐也闻一知二，是明敏通达的人，使为大夫，必能审事机，通物理，斟酌处置，有变通而无窒碍矣！其于从政，何难之有？”季康子又问说：“如冉求者，可使为大夫而从政也与？”孔子答说：“凡人才力空疏者，不足以从政，求也长于政事，是多才多艺的人，使为大夫，必能理繁治剧，区画周详，随事泛应，绰乎其有余裕矣！其于从政，何难之有？”夫三子之才，各有所长而皆适于用如此。使季康子能劝鲁君尊信孔子，委任群贤，则何东周之治不可复哉！惜乎其不能用也。"
        },
        {
          "originalText": "季氏使闵子骞为费宰。闵子骞曰：“善为我辞焉！如有复我者，则吾必在汶上矣！”",
          "explain": "季氏，是鲁大夫。闵子骞，是孔子弟子闵损，字子骞。费，是季氏的属邑。辞，是言词，复是再来。汶，是水名。在鲁之北境上。昔季氏为鲁大夫，专执国政。一日使人召闵子骞，着他做费邑之宰，闵子骞是个有德行的人，心恶季氏，不肯入于其党，而又不敢显言，乃对使者说：“大夫虽欲用我，然我之心，不愿仕进，汝其为我从容委曲，善为说词，以达吾不仕之心，而止其用我之意，必不可再来召我也。若不肯见信，而再来召我，则吾当逃避于汶水之上，而不复居于鲁国矣。大夫岂能强我之必仕乎！”夫闵子隐而不仕，既不失身于权臣，其言逊而不阿，又能免祸于乱世，真可以为贤矣！然以闵子之贤，鲁君不能用之以匡公室，而使季氏欲引之以为私人，此鲁之所以微而不振也。"
        },
        {
          "originalText": "伯牛有疾，子问之，自牖执其手，曰：“亡之，命矣夫！斯人也而有斯疾也！斯人也而有斯疾也！”",
          "explain": "伯牛，是孔子弟子冉耕，字伯牛。牖，是窗。古之病者，卧于北窗下，若人君来视，则暂时移在南窗下，使人君得以南面视己，所以尊君也。亡，是丧亡。命，是天命。昔者伯牛有疾，孔子往问之，伯牛乃迁于南牖下，使孔子南面视己，盖以尊君之礼尊之也。孔子不敢当，故不入其室，但自牖中执其手，而与之诀曰：“病势危笃如此，其丧亡必矣，然此乃天之所命，非由于人者也。何则？人而无德，或不能谨疾，或有以召灾，固不足言矣。今以如此之贤人，而何乃有如此之恶疾也。”以如此之贤人，而何乃有如此之恶疾也。岂非莫之致而至者耶！信乎其为命也已！盖夫子痛惜之深，故重言以叹之如此。"
        },
        {
          "originalText": "子曰：“贤哉！回也。一箪食，一瓢饮，在陋巷，人不堪其忧，回也不改其乐。贤哉！回也。”",
          "explain": "贤，是有德之称。箪，是竹器。食，是饭。不堪，是受不得的意思。孔子称许颜回说：“凡人学道者多，得道者少。我看颜回是个有德的贤人。如何见得？盖人莫难于处贫，而回则贫之至者。他的饮食不过是一箪之饭，一瓢之饮，又居处于荒陋的巷中，其困穷一至于此。若使他人处之，有不胜其愁苦者。然颜回之心自有乐处，但见其优游自得，不以身之困穷而遂改其乐也。这是所见者大，故中心自无不足，所得者深，故外物自不能移，非贤而有德者能如是乎？所以说贤哉回也！”大抵处富贵而佚乐，居贫贱而忧戚，乃人情之常。圣贤之所乐，盖有超于贫富之外者，舜禹有天下而不与，孔子饭蔬饮水，乐在其中，颜子箪瓢陋巷，不改其乐，其心一也。善学者当自得之。"
        },
        {
          "originalText": "冉求曰：“非不说子之道，力不足也。”子曰：“力不足者，中道而废，今女画。”",
          "explain": "说，是喜悦。中道，是半途。废，是止。画，是自家限量的意思。冉求自言于孔子说道：“夫子之道高矣美矣，我非不欣慕而求以至之，但资禀昏弱，心虽欲进，而力有所不足，故不能至耳！”孔子教之说：“所谓力不足者，非不用其力也，乃是心诚向道尽其力以求之，至于中道，气力竭了，莫能前进，而不得不废，这才叫做力之不足。今汝本安于怠惰，不肯用力向前，譬如画地以自限的一般，乃能进而不欲，非欲进而不能者也，奚可自诿于力之不足哉！”大抵人之勇往力行，生于真知笃好，盖志之所至，气必至焉。若冉有者，还是不曾真知道中之味而悦之。使其果悦之深，则必如颜子之欲罢不能矣，而岂以力不足为患哉！学者不可不勉也。"
        },
        {
          "originalText": "子谓子夏曰：“汝为君子儒，无为小人儒！”",
          "explain": "儒，是学者之称。孔子尝教门人卜子夏说：“如今为学的人，都谓之儒，不知儒者亦有分辨。有一样君子之儒，有一样小人之儒。所谓君子儒者，其学道固犹夫人也，但其心则专务为己，不求人知，理有未明，便着实去讲求，德有未修，便着实去体验，都只在自己身心上用力，而略无干禄为名之心，此君子之儒也。所谓小人儒者，其学道亦犹夫人也，但其心专是为人，不肯务实，知得一理，便要人称之以为知，行得一事，便要人誉之以为能，都只在外面矫饰而无近里着己之学，此小人之儒也。汝今但学那君子之儒，而专务为己，不可学那小人之儒，而专务为人。能审乎此，则趋向正而心术端，自然日进于高明，而不流于污下矣，可不谨哉！”这君子、小人之儒，不但学术所关，亦世道之所系。人君若得君子之儒而用之，则必能守正奉公，实心为国，而社稷苍生皆受其赐。若用了小人之儒，则背公营私，附下罔上，而蠹国殃民之祸，有不可胜言者。故用人者，既观其行事，而又察其心术，斯得之矣。"
        },
        {
          "originalText": "子游为武城宰。子曰：“女得人焉尔乎？”曰：“有澹台灭明者，行不由径，非公事，未尝至于偃之室也。”",
          "explain": "子游，是孔子弟子，姓言，名偃，字子游。武城，是鲁国的邑名。宰，是邑长。人，指贤人。澹台，是姓。灭明，是名。径，是小路。公事，是官府中公举的事，如乡饮、乡射、读法之类。昔者子游为武城宰。孔子问说：“为政以人才为先。武城一邑之中，必有德行道谊可以表正风俗者。女今为宰，亦曾得这样人与之相处否乎？”子游对说：“有个澹台灭明者，乃武城之贤人也。其存心正直，制行端严，寻常行路，必由坦然之正途，而捷径之小路则不肯由。岁时谒见，必是为邑中的公事，而非公事，则未尝轻至于偃之室。夫行不由径，则动必以正，而无欲速见小之心可知。非公事不见邑宰，则有以自守而无枉己徇人之私可见。此灭明之所以为贤，而偃之所知者，唯斯人而已。”夫子游以一邑宰，其取人犹若是，等而上之，宰相为天子择百僚，人主为天下择宰相，必以此类观焉，则刚方正大之士进，而奔竞谄谀之风息矣！"
        },
        {
          "originalText": "子曰：“孟之反不伐，奔而殿，将入门，策其马，曰：‘非敢后也，马不进也。’”",
          "explain": "孟之反，是鲁大夫。伐，是矜夸。奔，是败走。殿，是居后。策，是鞭。孔子说：“凡人但有功劳未有不矜夸自足者。我看鲁大夫孟之反，是个谦退不伐的人。大凡进军，则以当先者为勇；军退，则以殿后者为功。当时齐与鲁战，鲁师败绩。众人都往前奔走，孟之反独在后面堵截敌人，保全士卒，可谓有功矣！他却不以自为功，及将入国门之时，正众人瞩目之地，乃鞭策其所乘之马，向众人说：‘我不是敢于拒敌，故意在后，只为马疲乏不能前进耳。’”盖归罪于马，正所以自掩其功，非有功而不伐者乎！此可以为贤大夫矣。大抵不伐二字最为美德，盖谦虚乃能受益，盈满必然招损。颜渊无伐善，无施劳，故孔子许之。大禹不矜不伐，故帝舜称之。读者所宜深玩也。"
        },
        {
          "originalText": "子曰：“不有祝鮀之佞，而有宋朝之美，难乎免于今之世矣。”",
          "explain": "祝鮀，是卫大夫。佞，是有口才。宋朝，是宋国的公子名朝。美，是容色之美。难免，是说不免为人所恶。孔子说：“方今世道不古，人情偷薄，不好直而好谀，不悦德而悦色。故必言词便佞如祝鮀，容色美好如宋朝，然后可以取人之悦。若不有祝鮀之佞口，宋朝之美色，则无以投时俗之好，人将厌而弃之，求免于今世之憎恶，亦难矣。”夫巧言令色本尧舜之世所深恶者，而春秋之时，乃以为好，则习俗之浇漓可知，圣人所以伤叹之也。有世道之责者，可不谨其所好尚哉！"
        },
        {
          "originalText": "子曰：“谁能出不由户，何莫由斯道也。”",
          "explain": "户，是门户。道，是人伦事物日用之理。人所当共由者也。何莫，是怪叹之辞。孔子说：“事必有道，譬如室必有户一般。人若能出不由户，则其行不由道可也。然天下之人，其谁有能出不由户者乎？何故乃不由此道也。”盖为人之道，各在当人之身，既非有所禁而不得由，又非有所难而不能由，则夫人独何为而不由乎？是诚可怪也已。圣人警人之意莫切于此，人能反而求之，道岂远乎哉！"
        },
        {
          "originalText": "子曰：“质胜文则野，文胜质则史。文质彬彬，然后君子。”",
          "explain": "质，是质实。文，是文采。野，是村鄙的人。掌管文书的，叫做史。彬彬，是匀称的意思。孔子说：“凡人固要质实，也要文采。二者可以相有，而不可以相胜。若专尚质实，胜过乎文，则诚朴有余，而华采不足，就似那村野的人一般，一味是粗鄙简略而已，岂君子之所贵乎！若专尚文采，胜过乎质，则外虽可观，而中无实意，就似那掌管文书的一般，不过是虚浮粉饰而已，亦岂君子之所贵乎？”惟是内有忠信诚恪之心，外有威仪文词之饰，彬彬然文质相兼，本末相称，而无一毫太过不及之偏，这才是成德之君子。德至于君子，则岂有野与史之弊乎？盖周末文胜古道尽亡，孔子欲矫其偏而归之正，故其言如此。但当时之君，安于弊政，而不能变更，公卿大夫习于流俗，而不知救正，此周道之所以日衰也。有挽回世道之责者，其念之哉！"
        },
        {
          "originalText": "子曰：“人之生也直，罔之生也，幸而免。”",
          "explain": "直，是真实公正的意思。罔，是虚罔不直。幸，是侥幸。孔子说：“人得天地之正理以生，其是是非非，善善恶恶存之于中，发之于外者，都有个本然的公心，当然的正理，所谓直也。人能全此道理，则生于天地之间乃为无愧。若使存心虚妄，行事私邪，或作伪以沽名，或昧心而徇物，则是矫罔不直，而失其有生之理矣！生理既失，便不可以为人，就是生在世间，不过侥幸而得免于死耳，岂不深可愧哉！”譬之草木，或夭或乔，畅茂条达者，乃其生理也。今乃矫揉造作，或扭直以为曲，或移此以接彼，则戕其有生之理，其不死者幸耳。人之不直，何以异于是哉！孔子深恶不直之人如此。故圣王在上，举用正直之士，斥远憸邪之徒，则举措当而人心服矣。"
        },
        {
          "originalText": "子曰：“知之者，不如好之者；好之者，不如乐之者。”",
          "explain": "知之，是知此道。好之，是好此道。乐之，是乐此道。孔子说：“人之造道，有浅深之不同，然必到那至极的去处，乃为有得。彼不知道者，固不足言，若能识其为当然不易之理，而不可以不求，是固胜于不知者矣！然这只是心里晓得，未能实用其力也，不如好之者，悦其义理而爱慕之深，玩其旨趣，而求为之力，然后可以进于道也，岂徒知者之可比乎？所以说知之者不如好之者。夫好固胜于知，然这才是用力进修，未能实有诸己也。不如乐之者融会于心，而充然自得，全体于身，而浩然自适，然后乃为学之成也，岂徒好者之可比乎！所以说好之者不如乐之者。”夫是三者以地位言，则知不如好，好不如乐。以工夫言，则乐原于好，好原于知。盖非知则见道不明，非好则求道不切，非乐则体道不深。其节次亦有不可紊者。学者诚能逐渐用功，而又深造不已，则斯道之极，可驯至矣！此圣人勉人之意也。"
        },
        {
          "originalText": "子曰：“中人以上，可以语上也；中人以下，不可以语上也。”",
          "explain": "中人，是中等的人。语，是告语。上，是上等精微的道理。孔子说：“凡人资质有高下，学问有深浅。教人者，要看他力量如何。若是中等以上的人，其资禀既不凡，功夫又精熟，已是有上达之机了。然后告以精微的道理，则言者适当其可，而听者不苦其难，就似登山的一般，将到高处，才说与高处的景象，便理会得，所以说可以语上也。若是中等以下的人，资质既是寻常，功夫又未积累，但当就其力之所及而引进之。若遽告以精微的道理，不惟强其所不能，亦终茫然而无得，就似行路的一般，才在近处，便说与远处的路途，如何知道，所以说不可以语上也。”然则君子之教，但当因人而施，岂可躐等而进乎！然此为施教者言耳。若学者之学，又当自加勉励，盖奋发勇往，则下学皆可以上达。因循怠惰，则中人亦流于下愚，是在人立志何如耳。孔子他日告鲁君说，果能此道矣，虽愚必明，虽柔必强。此又进学者所当加意也。"
        },
        {
          "originalText": "樊迟问知。子曰：“务民之义，敬鬼神而远之，可谓知矣。”问仁。曰：“仁者先难而后获，可谓仁矣。”",
          "explain": "樊迟，是孔子弟子。务，是专用其力的意思。民义，是人所当为的道理。难，是切己难尽的工夫。获字，解做得字。樊迟问于孔子说：“如何叫做智。”孔子答说：“所谓智者，见理之明而已。盖人生日用，自有当为的道理。若鬼神之福善祸淫，虽与人事相为感通，然其事则幽昧而难知者也，不可知而谄事以求之，惑之甚矣。今惟用力于人道之所宜，凡伦理所当尽，职分所当为者，一一着实去做。至于鬼神，则惟敬以事之而已，却不去亵近，而谄渎祷祀以求福也。这是他心有定见，故祸福之说不足以动其念，幽远之事不足以眩其明，岂不可谓之智乎？”樊迟又问：“如何叫做仁。”孔子答说：“所谓仁者，存心之公而已。盖为人之道，本是难尽，若为之而有所得，虽功效相因，理之自然，然不可有心以预期之也。有心以期之，则涉于私矣。今惟先其事之所难，凡身心之所切，性分之所关者，只管上紧去做。至于后来的效验，则惟俟其自至而已，却不去计较，而有意以期必之也。这是他心有定守，故能纯乎正谊明道之公，而绝无计功谋利之念，岂不可谓之仁乎。”按夫子此言，虽是分言仁智，其实只是一理，盖媚神之念，即是望效之心。先难之功，即是务民之义，人能用力于人道之所难，而祸福得失，皆置之于不计，则仁智之道，兼体而不遗矣。此又学者之所当知。"
        },
        {
          "originalText": "子曰：“知者乐水，仁者乐山，知者动，仁者静。知者乐，仁者寿。”",
          "explain": "知者，是明理的人。乐，是喜好。仁者，是全德的人。孔子说：“天下有明智之人，有仁德之人，人品不同，则其性情亦异。大凡知者之所喜好，常在于水，仁者之所喜好，常在于山。盖知者于天下之理，见得明白，其圆融活泼，无一些凝滞，就似水之流动一般，此其所以乐水也。仁者于吾心之德，养得纯粹，其端凝厚重，不可摇夺，就似山之镇静一般，此其所以乐山也。夫人惟心有拘系，所以多忧。知者既流动不拘，则胸次宽弘，遇事便能摆脱。凡世间可忧之事，皆不足以累之矣，岂不乐乎！人惟嗜欲无节，所以损寿。仁者既安静寡欲，则精神完固，足以养寿命之源。凡伐性丧生之事，皆不足以挠之矣，岂不寿乎！”夫人情莫不欲乐，亦莫不欲寿，而惟有知仁之德者，为能得之，则反身修德之功，人当知所以自勉矣！"
        },
        {
          "originalText": "子曰：“齐一变，至于鲁；鲁一变，至于道。”",
          "explain": "齐、鲁是二国名。变，是变易而作新之。道，是先王文武之治道。孔子说：“我周初有天下，封太公于齐，封周公于鲁。二国皆被圣人之治，其政教风俗固纯然文武之盛也。至于今日，则齐、鲁皆与旧时不同，然齐经桓公霸政之后，其习俗相传，遂急功利，喜夸诈，而太公之治已荡然无存。鲁则无所变更，至今犹知重礼教，崇信义，而周公之遗风尚在，但人亡政息，不能无废坠耳。若齐之君臣，能变其政而作新之，则仅可如今日之鲁。盖功利既革，方可望于礼教，夸诈既去，方可望于信义，而文武之盛，固难以遽复也。若鲁之君臣能变其政而作新之，则便可至于先王之道。盖礼教信义莫非先王之旧，但修举其废坠，则纪纲制度焕然维新，而文武之盛可复见于今日矣！所以说齐一变至于鲁，鲁一变至于道耶！”此可见夫子经纶的次第，使二国能用之，则虽至道有难易，而一变再变之余，治功无不成者，惜乎其不能也。"
        },
        {
          "originalText": "子曰：“觚不觚，觚哉！觚哉！”",
          "explain": "觚，是木简。古时未有纸札，唯削木为数方，书字其上。用以记事，以其器有棱角，故谓之觚。觚哉！觚哉！言不得为觚也。孔子发叹说道：“天下的事物有其实，乃可以称其名，如器之所以名为觚者，本内其有棱角故名为觚也。若为觚而去其棱角，则失其觚之本制矣！既失其制，则名虽存而实已废，尚得谓之觚哉！尚得谓之觚哉！”然圣人之意，非为一觚，盖见世之有名无实者多因感于觚而发叹也。故君尽君道，而后可以为君，臣尽臣道，而后可以为臣，不然亦皆觚而不觚者也。若其所关系则又岂特一器之小而已哉！"
        },
        {
          "originalText": "宰我问曰：“仁者，虽告之曰‘井有仁焉’，其从之也？”子曰：“何为其然也？君子可逝也，不可陷也；可欺也，不可罔也。”",
          "explain": "宰我，是孔子弟子宰予。井有仁的仁字，当作人物的人字。从，是随。逝，是往救。陷，是陷溺。欺，是欺诳。罔，是诬罔。宰我有志于仁，而不知为仁之道，乃问于孔子说：“仁者既以爱人为心，则闻人有难便当往救，虽是人告他说，有人溺于井中，亦当随之入井而救之乎？不救，则无恻隐之心；救之，则有沉溺之患。然则为仁岂不难哉！”孔子答说：“仁者虽切于救人，然必己身得生而后可以救人之死，若从人入井，则无益于彼，而先丧其身，愚亦甚矣！仁者何为而若此乎？大凡仁人君子闻人有难，便有恻然哀怜之心，使之奔走而往救则可，若使之入井而自陷其身则不可。盖凡事自有个道理须要斟酌，若是理之所有的，人虽欺诳他，也要信了。若是理所必无的，人虽欲诬罔而使之轻信，岂可得乎？然则井中有人，理之所有也，故可使之往救；入井救人，理所必无也，故不可使之陷溺。子欲为仁，亦详审于轻重缓急之间而已。”盖利济兼爱者，仁之心也。揆度事理者，智之事也。有智以行仁，而后仁为无蔽，宰我忧为仁之陷害，其不智可知，故孔子晓之如此。"
        },
        {
          "originalText": "子曰：“君子博学于文，约之以礼，亦可以弗畔矣夫！”",
          "explain": "博，是广。文，是《诗》、《书》六艺之文。约字，解做要字，是敛束的意思。礼，是天理之节文。畔字，解做背字。孔子说：“君子之学，将以求道也。然道散于万变，而文则所以载之，使非博之以文，则闻见浅陋，而不能旁通。道本于身心，而礼则所以检之。若徒博而不能约之以礼，则工夫汗漫而无所归宿，便与这道理相背了。所以君子之学，务要旁搜远览，凡天地民物之理，《诗》、《书》六艺之文，一一去讲习讨论，以广吾之闻见，这是博学于文。然又不徒务博而已，必收敛约束，举凡视听言动之间，都守着天理之节文，不敢少有放肆，这是约之以礼。夫博学于文，则闻见日多，既不病于孤陋；约之以礼，则身心有据，又不涉于支离。如此用工，虽未必便能与道为一，然由此进之，则亦可以至于道矣！何相背之有乎？”圣人示人为学之方莫切于此。若就君道上说，则凡亲贤纳谏，读书穷理，即是博文的工夫，以其所闻所见者，而检束其身心，体验于政事，即是约礼的工夫。人主务此，则二帝三王之治可几而至矣！"
        },
        {
          "originalText": "子见南子，子路不说。夫子矢之曰：“予所否者，天厌之！天厌之！”",
          "explain": "南子，是卫灵公的夫人。矢字，解做誓字。否，是不合道理。厌，是弃绝。昔孔子曾到卫国，卫君之夫人有南子者，素知尊敬孔子之道德，要与相见。孔子辞谢不得已而见之。盖古人仕于其国，有见小君之礼。南子据礼以求见，故孔子不轻绝之，圣人所为，无一而非礼之所在也。子路不知此义，只说南子是个淫乱的人，不该见他，心里不说。孔子也不明言其意，但出誓言以告之说：“凡人立身行事，须是依着道理，不愧于天，则天必佑之。若使我之所为不合于礼，不由于道，有一毫得罪于天，天必将弃绝我矣！天必将弃绝我矣！”重言之者，欲使子路笃信乎此，而深思以得之也。盖孔子道大德宏，不为己甚，故其待南子者如此。至于灵公问陈，则明日遂行。孔子岂屈己以徇人者哉！合而观之，可以知圣人之心矣！"
        },
        {
          "originalText": "子曰：“中庸之为德也，其至矣乎！民鲜久矣。”",
          "explain": "中，是无过不及。庸，是平常。人所同得的道理，叫做德。至，是极至。鲜，是少。孔子说：“天下之事但有一毫太过，便可减损。有一毫不及，便可增益，都不是至善的道理。惟是中庸之为德，本于天命人心之正，而不离乎民生日用之常，既不偏于太过，亦不偏于不及，而其理经久可行，乃是至精至粹，尽善尽美的道理，岂非极至而无以加者乎！然这道理是人人之所同得，亦人人之所当行，自古圣贤所以治世修身都不外此。但如今的人，或拘于气禀之偏，或安于习俗之敝。贤智的，则失之太过，而不能裁抑以合乎中；愚不肖的，则终于不及，而不能黾勉以求其至。少有此德者，亦已久矣。”孔子深有感于世道之衰，故叹之如此。"
        },
        {
          "originalText": "子贡曰：“如有博施于民而能济众，何如？可谓仁乎？”子曰：“何事于仁，必先圣乎！尧、舜其犹病诸！”",
          "explain": "博，是广施，是施恩于人。济众，是济度众人，使各得其所。何事，是说不止如此。病，是心里不足的意思。子贡未得为仁之方，而徒志于高远，乃问于孔子说：“吾闻无所不爱之谓仁。如有人焉，广施恩惠于天下之民，能使万民之众，各得其所，而无有不济，这等为人，夫子以为何如，亦可以谓之仁矣乎？”孔子答说：“仁者之心无穷，而分量亦有限。如必博施而济众，则岂止于仁而已。必是圣人全体仁道而造其极者，然后能之乎。然圣如尧、舜可谓至矣！而尧、舜之治天下，犹有下民其咨之叹，黎民阻饥之忧，其心歉然常若有所不足也，况他人乎！”夫圣人且以为难，而子以是求仁，失之远矣！"
        },
        {
          "originalText": "“夫仁者，己欲立而立人，己欲达而达人。”",
          "explain": "立，是成立。达，是通达。孔子告子贡说：“汝以博施济众为仁，只为未识仁体故耳。夫所谓仁者，只是纯乎天理之公，而无私欲之间，看得天下的人，就如自己一般，疾痛疴痒，都有相关的意思。如自己要成立，便不忍他人之颠危，必思以扶持调护，使之同归于成立而后已；自己要通达，便不忍他人之穷困，必思以开导引掖，使之同归于通达而后已。”这等立心就是天下一家，万物一体的气象，虽不必遍物而爱之，而本体已具，则功用在其中矣。此乃所以为仁，而非博施济众之谓也。"
        },
        {
          "originalText": "“能近取譬，可谓仁之方也已。”",
          "explain": "譬字，解做喻字，是比方较量的意思。方，是术。承上文说：“仁之本体，只是一个公心，则为仁者，亦不必求之于远矣！若能近取诸身，将自己的心，比方他人的心。如自己欲立便知人之欲立与我一般，即推之以立人；自己欲达便知人之欲达与我一般，即推之以达人。这就是为仁的方法，所谓纯乎天理之公，而无私欲之间者，不过如此。岂复有他术哉！”盖子贡之说，是在功用上求仁，故其效愈难而愈远。孔子之论，只在心体上求仁，故其术至简而至易。况能知为仁之方，则虽尧、舜之所以为圣，亦不外此。盖尧舜之圣岂能遍物而爱之，只是其心常在安民而已。人君若能以安民为心，而推之以治天下，则仁圣之事，一以贯之，而何尧舜之不可及哉！"
        }
      ]
    ]
  },
  {
    "chapterName": "述而第七",
    "introduction": "此篇多记圣人谦己诲人之辞及其容貌行事之实。凡三十七章。",
    "paragraphs": [
      [
        {
          "originalText": "子曰：“述而不作，信而好古，窃比于我老彭。”",
          "explain": "述是传旧。作是创始。窃字解做私字。比是仿效。老彭是商时的贤大夫。昔孔子删诗书，定礼乐，赞周易，修春秋，传先王之道，以教万世。然犹不敢以作者之圣自居，乃谦逊说道：“大凡天下之事，有前人已为，而后人传之者，谓之述；有前人未为，而自我创始者，谓之作。作非圣人不能，而述则贤者可及也。我今虽有所修为，只是传述先王之旧，或考之方册而重加发明，或闻之故老而更为裁定，实未尝重新创造而有所作也。盖天地间的道理，哪一件不是古人说过的？就中讲求，自有无穷的妙处。我则深信而笃好之，惟日孜孜，不能自已，故但见其可述，而无容于复作也。然此岂我之独见哉？比先商时贤大夫有老彭者，他能信古而传述，我尝慕其为人，今我所为不过私自仿效我老彭耳！”夫孔子于古之贤人，犹不敢显然自附如此，其德愈盛而心愈下，盖可见矣。"
        },
        {
          "originalText": "子曰：“默而识之，学而不厌，诲人不倦，何有于我哉？”",
          "explain": "默是不言。识是记。诲人是教人。孔子说：“人之求道，如徒务口语而不能存之于心，则闻见虽多，终非实得。必须沉静简默，只在心上去理会。凡所闻所见的都不费辞说，而自无所遗忘，然后能深造而自得也。人之为学，若只是始初奋发，到后来便厌烦了，则工夫间断，岂能有成？必须深信义理之无穷，而实用其力，自始至终都只是这等勤学，无一毫厌怠之意，然后谓之好学也。人之设教，若不能尽心开导，到费力去处，便都倦了。则私意未忘，岂能成物？必须真知物我之无间，而有教无隐，随人问难，都因材而造就之，无一毫倦怠之心，然后谓之善教也。这三件都是成德之事，而我之尝所致力者。然反而求之，何者能有于我哉？”夫圣人会道全体而曲成不遗，乃犹自以为不能，其谦己诲人之意至深切矣！"
        },
        {
          "originalText": "子曰：“德之不修，学之不讲，闻义不能徙，不善不能改，是吾忧也。”",
          "explain": "义是理之所当为者。徙字解作迁字。孔子说：“德必修而后成，学必讲而后明。闻义能徙而后善可积，不善能改而后恶可去。这四件是切实紧要的功夫。凡欲为圣贤者皆当用力于此也。今我之于德，未能省察克治，以涵养其本源；我之于学，未能讲习讨论而研穷其精奥；义有当为的，未能闻斯行之而迁徙以从其新；不善当改的，未能务于决去而惩创以革其旧。则是德有不成，学有不明，善不能积，恶不能去，将日流于污下，而不可进于高明矣，岂非吾之深忧者乎？”夫孔夫子之圣，非真有所不能也，亦非自知其能而故为是言也。盖其好学无已之心，自视常若有不能耳！然此四者，在人君尤为切要。古之帝王或懋敬厥德，终始典学，或取人为善，改过不吝皆是道也。欲法古帝王者，宜三复孔子之言。"
        },
        {
          "originalText": "子之燕居，申申如也，夭夭如也。",
          "explain": "燕居是闲居无事之时。申申是舒畅的意思。夭夭是和悦的意思。门人记说：凡人在闲暇之时，有怠惰放肆的，便自亵其威仪；有矜持矫饰的，或反过于严厉，皆非盛德之气象也。惟吾夫子在闲居无事之日，以四体则从容舒展，而略无拘迫，何其申申如也！以颜色则融和润泽而自然愉悦，何其夭夭如也！盖德性极其纯粹，故容貌合于中和者如此。门人此言可谓善形容有道气象者矣。"
        },
        {
          "originalText": "子曰：“甚矣，吾衰也！久矣，吾不复梦见周公！”",
          "explain": "衰是血气既衰。孔子发叹说：“凡人年有老少，则血气有盛衰，甚矣，我血气之衰也。如何见得？盖我当强壮之年，常常梦见周公，恍然若与之相遇。到如今来，许久不复梦见周公矣，则吾之衰岂不集乎？”盖孔子生于周时，一心要做周公的事业。方其精力壮盛，寤寐不忘，故常形之于梦。及其既老，则自谅其力不能为，无复是心，而亦无复是梦矣，故其发叹如此。可见贤才之生于世，其可以有为者，每在其强壮之时。而人君之用贤，亦当趁其强壮而任之。若精力既衰，则事功所就，已不能副其初心矣，况于终不用乎？然则孔子之自叹其衰，固为可惜，而当时之君不能及时用之，以再见周公之化，而使之卒老于下位，则尤为可惜也。"
        },
        {
          "originalText": "子曰：“志于道，据于德，依于仁，游于艺。”",
          "explain": "这一章是孔子示人为学之全功。志是心之所向。据是执守。依是依止。游是游衍玩习的意思。孔子说：“学莫先于立志，而道乃人伦事物当然之理。志不于是，则趋向差矣。故必以道为终身之准的，而专心致志以求之，则所适者正，而无他歧之惑矣。行此道而有得于心，叫做德。德而不据，则持守之功不继，能保得者之不失乎？必拳拳服膺，务使此德常有诸己，而日积月累，不至于若存若亡而后可。体此道而心德纯全，叫做仁。仁而不依，则私欲有时复萌，能保全者之不亏乎？必念兹在兹，务使此仁存养愈熟而周流贯彻，无一毫间断错杂而后可。夫志道、据德、依仁，是本之在内者，无不尽矣。至于礼、乐、射、御、书、数之事，虽艺文之末，非德行之本，然亦至理所寓，而日用之不可缺者，亦必游息于藏修之余，从容而玩味其理，用以收敛身心，调养性情，而成其道德焉。则本末兼该，内外交养，而忽不自知，其入于圣贤之域矣。”学之全功，何以加此？然此章之旨，不但是学者所当知，在人君尤为切要。盖道、德、仁，乃人君修身治天下之本，必当深造其极，方可无歉，而凡游心于艺文者，又须务求实用，始为有益。古之帝王所以学古有获，道积厥躬，德修罔觉者，正是如此。善学者当以圣言为法程可也。"
        },
        {
          "originalText": "子曰：“自行束修以上，吾未尝无诲焉。”",
          "explain": "俺是脯，乃干肉也。十脡为一束。古人初相见，必执贽以为礼。一束之修乃其至薄者。自行束修以上，言随其厚薄之不同也。诲是教诲。孔子说：“无不善者，人之性。而无不欲其入于善者，吾之心。但人不知来学，吾固无往教之理。苟知求教，自行束修以上之礼而来者，即是可与为学之人，吾则未尝不教诲之焉。”盖天生圣人，非徒使自圣而已，正欲其先知觉后知，以先觉觉后觉，而为时人之耳目也。所以圣人教人之心，惓惓无已如此。使其得君师之位，则必能大行其政教，使人人皆为君子而后已。惜乎不得其位，但能成就后学，以传道于来世也。"
        },
        {
          "originalText": "子曰：“不愤不启，不悱不发。举一隅不以三隅反，则不复也。”",
          "explain": "愤是心求通而未得的意思。启是开其意。悱是口欲言而未能的模样。发是达其词。隅是四方转角处。反是反复问难。复是再告。孔子说：“君子之教人，固当尽言而无隐，然必其人有受教之地，而后可以施吾造就之方。且如人之求道，有用心思索而未能即通者，谓之愤。愤则有可通之机，吾因而为之开其意，彼将豁然而无疑矣。若未至于愤，则在彼本无求通之心，我何从而开之乎？此所以不启也。有心知其意而口未能言者，谓之悱。悱则有可达之势，吾因而为之达其词，彼将沛然而莫御矣。若未至于悱，则在彼本无欲言之心，我何从而达之乎？此所以不发也。至于我之所启发者，又看他了悟如何。若能于我所言，触类旁通，因此识彼，我举其一隅，而彼即能以三隅反。譬如提起东方一角的事，他就并西、南、北方的道理都晓得了，提起西方一角的事，他就并东、南、北方的道理都晓得了，一一回答将来，相与质证。这等的人是其机圆而不滞，其心通而无碍，然后详以告之，则彼此相契，而其言易入矣。若示之以一隅，而不能以三隅反复问难，则是资禀庸下，而不能推测，意见凝滞而未能旁通，虽谆谆而语之，亦终茫然而无得耳。我何为而强聒乎？此吾所以不复告也。”夫以孔子之诲人不倦，犹必因人而施如此！然则学者可不勉于用力，以为受教之地哉。"
        },
        {
          "originalText": "子食于有丧者之侧，未尝饱也。子于是日哭，则不歌。",
          "explain": "侧是边傍。哭是吊丧而哭。歌是咏歌。盖古人以歌咏养性情，遇心有所乐则歌也。门人记说：夫子哀死之心真切而不能自已。如人有死丧之事，而夫子食于其侧，则未尝饱。盖临丧哀，故食之而不能甘也。又如夫子于是日吊丧而哭，则其一日之间不复咏歌。盖余哀未忘，而自不能为乐也。然此乃是不忍之心，古之帝王见百姓之饥寒困苦流离死亡，则必为之减膳、撤乐，急急救恤，即是此心。有天下者能推此心以仁民，则无一夫不得其所，而仁覆天下矣。"
        },
        {
          "originalText": "子谓颜渊曰：“用之则行，舍之则藏，惟我与尔有是夫。”",
          "explain": "行是出而行道，舍是不用，藏是隐而不出。昔颜子深潜纯粹，学已几于圣人。故孔子称许他说：“吾人出处进退，只看时之所遇何如。或以仕为通，而至于枉己徇人，固不可；或以隐为高，而务于绝人逃世，亦不可。惟是人能用我，时可以有为，则出而行道，以图济世之功；人舍我而不用，时不可以有为，则隐而不出，以全高尚之志。或出或处，无一毫意必于其间，这才是随时处中的道理。此惟我与尔为能有之，在他人则不敢以轻许也。”盖孔子为时中之圣，自然合乎仕止久速之宜。颜子具圣人之体，能不失乎出处进退之正。观孔子有东周之志，而疏食饮水，乐在其中。颜子有为邦之问，而箪瓢陋巷，不改其乐，盖可见矣。然以大圣大贤，而皆不过于春秋之世，则岂非世道之不幸哉！"
        },
        {
          "originalText": "子路曰：“子行三军，则谁与？”子曰：“暴虎冯河，死而无悔者，吾不与也。必也临事而惧，好谋而成者也。”",
          "explain": "一万二千五百人叫做一军，大国则有三军。暴虎是不用兵器而徒手搏虎。冯河是不用舟楫而徒步涉河。子路见孔子独美颜子，乃就问说：“用舍行藏，夫子固与颜回共之矣。设使夫子统领三军，而行战伐之事，则将与谁共事乎？”盖自负其勇，意夫子行军必与己同也。孔子答说：“君子之所贵者，在乎义理之勇，而不在乎血气之刚。若是徒手搏虎，徒步涉河，甘心必死而无怨悔，这是轻举妄动，有勇无谋的人。使之用兵，必然取败，吾不与之行三军也。必是平昔为人不敢轻忽以误事，亦不敢苟且以成事，但事到面前常有兢兢业业，凛然危惧的意思。又好用计谋，预先斟酌停当，然后果决以成之，这才是持重详审，智勇兼备的人。使之用兵，必能全胜，吾方与之行三军耳！亦何取于徒勇哉？”子路好勇而无所取材，故孔子以是抑而教之。其实行军之道，亦不外此。故赵括好谈兵，而致长平之败，充国善持重而收金城之功。任将者当知所择矣。"
        },
        {
          "originalText": "子曰：“富而可求也，虽执鞭之士，吾亦为之。如不可求，从吾所好。”",
          "explain": "这是孔子设词以警人的说话。执鞭是贱者之事。孔子说：“人之所以役役焉以求富者，意以富为可求也。若使富而可以人力求之，则虽执鞭之事，吾亦为之。盖执鞭虽贱者之役，而苟足以致富，则亦无不可为者。但人之富贵贫贱，莫不有命存焉，决非人力所能强求者。如其不可强求，则在我自有义理可好。吾惟从吾所好，而安于命耳。何必终日营营，为是无益之求，以徒取辱哉。”夫孔子之圣，非真屑为执鞭之士也，特见当世之人，多自决其礼义之防，而甘心于苟贱之羞，故甚言以警人之妄求耳。所以他日又曰：“不义而富且贵，于我如浮云。”观此，则自修者固不当愿乎其外，而取人者尤必先观其所守可也。"
        },
        {
          "originalText": "子之所慎：齐、战、疾。",
          "explain": "齐是将祭时斋戒。战是统兵而行战阵之事。疾是疾病。门人记说：“夫子之所最谨慎者有三件事，其一曰斋，盖斋以交神，苟有不慎则志意涣散，神必不享。所以夫子之于斋也，内秉寅恭，外敦俨恪，务致其精诚，而后承祭以交于神焉。其一曰战，盖战者众之死生，国之存亡系焉。苟有不慎，则机宜不审，何以能胜？所以夫子之于战也，临事而惧，好谋而成，务出于万全，而不敢轻率以取败焉。其一曰疾，盖疾乃吾身之所以死生存亡者，苟有不慎，能无伤乎？所以夫子于无疾之时，则薄滋味，寡嗜欲，时节其起居，而不敢宴游无度；和平其性气，而不敢喜怒过当。不幸有疾，则加意调养，审择医药，而不敢有一毫之忽略焉。”盖圣人无所不慎，而此三者关系尤大，故谨之又谨如此。"
        },
        {
          "originalText": "子在齐闻《韶》，三月不知肉味，曰：“不图为乐之至于斯也。”",
          "explain": "《韶》是舜乐名。不图是不意。古者圣王作乐以象德，帝舜以至圣之德，当极治之时，故所作《韶》乐最为美盛。舜之后封于陈，犹传其乐，至陈敬仲奔齐，而《韶乐》遂在齐矣。夫子周流至齐，得闻其音，乃从而学之，至于三月之久，一心只在乐上，虽当食之时，有不知肉味之为甘者。盖不特习其声容节奏之末，而其契合之深，就如亲见虞舜之圣，身在雍熙之时者矣。遂不觉发叹说道：“吾向也但知《韶》乐之美，犹未能得于亲闻。今也始得闻而学之，不意其所作之乐至于如此之美也。”盖夫子中和之蕴本自与舜合德，故一闻《韶》乐而叹息之深如此！他日又称其尽善尽美，而颜渊问为邦，则以韶乐告之，其上嘉于虞舜者至矣。"
        },
        {
          "originalText": "冉有曰：“夫子为卫君乎？”子贡曰：“诺，吾将问之。”",
          "explain": "为字解做助字。卫君名辄，是灵公之孙，世子蒯聩之子。诺是应答之词。昔卫灵公时，世子蒯聩得罪出奔，灵公薨，国人遂立蒯聩之子辄。及晋人送蒯聩归国，辄拒之不受。当时卫国之人都说道：“蒯聩得罪于父，于义当绝。辄以嫡孙嗣立，于礼为宜。未有明言拒父争国之非者。”那时孔子在卫，冉有疑孔子亦以为宜，乃私问子贡说：“卫君之立，国人固皆助之矣，不知夫子亦以为当然而助之否乎？”子贡即诺而应之说：“吾将入见夫子而问之。”盖未能深谅孔子之心，而不敢遽答冉有之问也。"
        },
        {
          "originalText": "入曰：“伯夷、叔齐何人也？”曰：“古之贤人也。”曰：“怨乎？”曰：“求仁而得仁，又何怨？”出曰：“夫子不为也。”",
          "explain": "伯夷、叔齐是孤竹君之二子，长子叫做伯夷，第三子叫做叔齐。孤竹君曾有遗命，要立叔齐为君。及卒，叔齐又逊伯夷而不肯立。伯夷说父命不可违，叔齐说伦序不可乱，两人互相推让，都逃去了。这是兄弟逊国的事，正与卫君父子争国的相反。子贡不敢直斥卫君，乃入而问孔子说：“伯夷、叔齐是何等人也？”子贡之问是要看孔子之取舍何如。若以争国为是，则必以让国为非。若以让国为当然，则必以争国为不可矣。孔子答说：“二子逊国而逃，制行高洁，是乃古之贤人也。”子贡又问说：“二子固是贤人，不知让国之后，其心亦有所怨悔否乎？”子贡之意，盖以让国之事人所难能，若贤如二子者，尤出于一时之矫激，而未免于他日之怨悔，则不可概责之他人，而卫君犹或可恕也。孔子答说：“凡人有所求而不得则怨，今伯夷以父命为尊，叔齐以天伦为重。只要合乎天理之正，即乎人心之安，所以求尽乎人也。今既不违父命，不悖天伦，是求仁而得仁矣。求之而得，则其心已遂，又何怨悔之有乎？”夫孔子之于夷、齐，既许其贤而又谅其心如此，则让国之事乃孔子之所深取也。以让国为是，则必以争国为非，而其不为卫君之意不问可知矣！故子贡出而谓冉有说：“夫子不助卫君也。”盖惟孔子为能谅夷、齐之心，惟子贡为能谅孔子之心。一问答之间，而父子兄弟之伦，昭然于天下矣。为国者可不以正名为先乎？"
        },
        {
          "originalText": "子曰：“饭疏食，饮水，曲肱而枕之，乐亦在其中矣。不义而富且贵，于我如浮云。”",
          "explain": "饭是吃，疏食是粗饭，肱是手臂。孔子自叙其安贫乐道之事说道：“人生日用之间，无不欲饮食充足，居处安逸者。我所食的不过是粗饭，所饮的不过是水，其奉养之菲薄如此；夜卧无枕，但曲其肱而枕之，其寝处之荒凉如此。贫困可谓极矣！只是我心中的真乐，初不因是而有所损，亦自在其中焉。若彼不义而富且贵，苟且侥幸以得之，虽胜于疏食饮水，以我视之，漠然如浮云之无有，何尝以此而动其心耶！”盖圣人之心，浑然天理，故不以贫贱而有慕乎外，不以富贵而有动于中如此。"
        },
        {
          "originalText": "子曰：“加我数年，五十以学《易》，可以无大过矣。”",
          "explain": "加字当做假字。五十字当作卒字。假是借。卒是终。《易》即是如今《易经》所载的道理。孔子说：“《易》之为书，广大悉备。凡天道之吉凶消长，人事之进退存亡，都具载于其中，学者所当深察而玩味也。但其理深奥精微，我尝欲学之而尽其妙，然今则老矣。天若假借我数年，使我得终其学《易》之功，或观其象而玩其辞，或观其变而玩其占。凡道理精微的去处一一都讲究得明白，则吉凶消长之理，进退存亡之道，我皆能融会于一心。由是见诸行事，必能审动静之时，得趋避之正。虽未必全然无过，而亦可以无大过矣。”夫圣人全体易道，行不逾矩，岂待假以数年而学《易》，亦岂待学《易》而后能免过？正谓易理无穷，欲人当及时以勉学耳。欲寡过者当以讲学穷理为先。"
        },
        {
          "originalText": "子所雅言，《诗》、《书》、执礼，皆雅言也。",
          "explain": "雅字解做常字。执是执持。人能事事循礼，才有执持，所以叫做执礼。门人记说：夫子之设教，固必因人而施。然平日所常言者，则有三件：一是《诗》，盖《诗》之为言有美有刺，美者可以劝人为善，刺者可以戒人为恶。吾人所以养性情者莫切于此。一是《书》，盖书之所载有治有乱，与治同道则无有不兴，与乱同事则无有不亡，吾人所以考政事者莫切于此。一是执礼，盖礼主恭敬而有节文，既可以防闲其心志，又可检饬其威仪。吾人欲养其德性，使有所执持者莫切于此。这三件都是切实的道理，紧要的功夫。故夫子常以为言，欲人念念在此而不忘，时时用力而不懈也。夫以孔子之圣犹汲汲于学易，而于《诗》、《书》、执礼则雅言之。可见圣人之道具在六经，学者必讨论讲习，乃可以明理。人君必体验推行乃可以致治，读者宜致思焉。"
        },
        {
          "originalText": "叶公问孔子于子路，子路不对。子曰：“女奚不曰：其为人也，发愤忘食，乐而忘忧，不知老之将至云尔。”",
          "explain": "叶公是叶县的令尹，谮称公。奚字解做何字。愤是急于求通之意。昔者叶公问孔子之为人于子路，子路不对。盖圣人之德未易名言，故子路不敢轻对也。孔子闻而教之说：“叶公之问盖欲知我也，而汝之不对，何也？汝何不说：‘其为人也，惟知好学而已。方其理之未得，则发愤以求之。虽终日不食，有不知者。愤而至于忘食，是其愤之极也。及其既得，则欣然自乐，虽事之可忧有不知者。乐而至于忘忧，是其乐之至也。然天下之义理无穷，未得而求之以至于得，则愤者又未尝不乐也。有得而尚有所未得，则乐者又未尝不愤也。二者循环，日有孜孜，而无所止息，虽老年将至，有不自知焉者，是乃我之为人也。’汝何不以告叶公乎？”这是孔子自言其好学之笃如此！然其全体至极，纯一不已之心，于此亦可见矣。欲学圣人者，其可不以勤励不息自勉哉？"
        },
        {
          "originalText": "子曰：“我非生而知之者，好古，敏以求之者也。”",
          "explain": "古是古人的典籍。敏是急速的意思。孔子说：“天地间的道理，凡精粗小大，那一件不是吾人之所当知。但人之气禀不同，有天生上智，自然知此道理者；有必待学习然后能知此道理者。我今虽有所知，岂是聪明睿知，生来自然能知而不待学习者乎？只是见得这个道理，都具于古人之典籍，若非心里喜好，则志向不专，非上紧讲求，则功夫有间，所以笃信好古，汲汲焉勉力以求之。将古人的言语，字字去体认；将古人的行事，件件去思索，就似饥之求食，渴之求饮一般，惟日孜孜，不敢有一毫之懈怠。是以学力至到，义理固然贯通，而能有所知耳，岂真生而知之者哉！”此虽孔子自谦之辞，其实学问之功，虽圣人亦不能废。故尧、舜舍己从人，大禹不自满假，成汤之得师，武王之访道，皆不敢自恃其聪明，而必从事于学问也。傅说说学以古训，逊志务时敏，正与好古敏求之言相合，为人君者不可不知。"
        },
        {
          "originalText": "子不语：怪、力、乱、神。",
          "explain": "语是言语，怪是怪异，力是勇力，乱是悖乱，神是鬼神。门人记说：夫子教人，固无所隐，然亦有所不语者，怪、力、乱、神是也。夫怪者诡异无据，虚诞不经，最能骇人之听闻，惑人之心志者也。力者以强凌弱，以众暴寡，专用血气而不顾义理者也。乱者臣子叛君父，妻妾弃其夫，乃人伦之大变，天理所不容者也。鬼神者视之而弗见，听之而弗闻，其感应之理幽远而难测者也。前三件非理之正，后一件非理之常。言之，则有以启人好奇不道之心，渺昧荒唐之想，故夫子绝不以为言。其所雅言者不过《诗》、《书》、执礼，其所立教者不过文、行、忠、信而已。"
        },
        {
          "originalText": "子曰：“三人行，必有我师焉。择其善者而从之，其不善者而改之。”",
          "explain": "师是师范。孔子说：“学无常师，随在有益。人能存心于为己，斯无往而非进德之地，便是三人同行，亦必有我之师范存焉。盖人的所为非善则恶，而师也者，所以引人为善，教人去恶者也。今三人虽寡，而观其所行，岂无合于义理而为善者乎？亦岂无悖于义理而为不善者乎？善者我则景仰欣慕，取法其善而从之；不善者我则反观内省，恐己亦有是恶而改之。夫择善而从，则足以长吾之善，是善固我之师也。见不善而改，则足以救我之失，是不善亦我之师也。所以说三人行必有我师焉。”三人且如此，则天下之人无往而非师矣！人能随处而自考，触类以求益，进善岂有穷乎？即此推之，可见人君之学，尤须广求博采，凡臣下之忠言嘉谟，古今之治乱得失，盖无非身心治理之助者，诚能以圣哲为芳规而思与之齐，以狂愚为覆辙而深用为戒，是谓能自得师，而德修于罔觉矣。"
        },
        {
          "originalText": "子曰：“天生德于予，桓魋其如予何？”",
          "explain": "桓魋是宋之司马。如予何，是说没奈我何，言不能害己也。昔孔子周流四方，行到宋国，那时宋国的司马有桓魋者，忌孔子而欲杀之，门人都惧其不免。孔子晓之说：“人之死生祸福皆系于天。若天无意于我，必不生我以如是之德。既生我以如是之德，则我之命，天实主之，必将佑我于冥冥之中矣。桓魋亦人耳，其将奈我何哉？盖必不能违天而害我也。”然孔子虽知天意之有在，而犹必微服过宋以避之，则可见天命固不可以不安，而人事亦不可以不尽。故知祸而避，则为保身之哲，以义安命，则为乐天之仁。观圣人者于此求之可也。"
        },
        {
          "originalText": "子曰：“二三子以我为隐乎？吾无隐乎尔。吾无行而不与二三子者，是丘也。”",
          "explain": "二三子指众弟子说。隐是隐讳而不言。与字解做示字。昔孔门弟子专以言语求圣人，以为夫子之道本自高深，而其教人则甚平易，必有秘而不传者，故以有隐为疑。孔子乃教之说：“二三子之学于吾门久矣，其将以我为吝教，有所隐讳而不言乎？不知吾之于尔初未尝有所隐也。盖道理在人，本自明白简易，固不待言而显，亦不可执一而求。我今一动一静，一语一默，凡身之所行都依着道理，这是二三子所共见共闻的。则是以身立教，无一事不以昭示于二三子者，此乃丘之为人也，何尝有隐于尔哉？二三子不能随处体认，而徒以言语求之，非惟不知我，抑亦不善学矣。”然孔子之道，不但晓然昭示于门人，而亦灿然大明于万世。善学圣人者若能反之身心之间，而不徒泥于言语之末，则何圣道之不可及哉？"
        },
        {
          "originalText": "子以四教：文、行、忠、信。",
          "explain": "文是《诗》、《书》、六艺之文。行是体道于身。尽己之心叫做忠。待物以实叫做信。门人记说：夫子以成就后学为心，其为教虽无所隐，然大要不过四件。四者何？文、行、忠、信是也。盖天下之义理无穷，皆载于《诗》、《书》、六艺之文，使不有以讲明之，则无以为闻见之资，而广聪明之益，故夫子每教人以学文也。然道本于身，使徒讲明，而不一一见之于躬行，则所学者不过口耳之虚，而非践履之实，故夫子每教人以修行也。然道原于心，使发乎己者有不忠，应乎物者有不信，则所知所行皆为虚伪，而卒无所得矣。故夫子每教人以忠，使其发于心者肫肫恳至，而无一念之欺；教人以信，使其应乎物者，慥慥笃实，而无一事之诈。苟能此四者，则知行并尽，表里如一，而德无不成矣。为学之道，岂有加于此哉？此夫子所以为善教也。"
        },
        {
          "originalText": "子曰：“圣人，吾不得而见之矣；得见君子者，斯可矣。”子曰：“善人，吾不得而见之矣；得见有恒者，斯可矣。亡而为有，虚而为盈，约而为泰，难乎有恒矣。”",
          "explain": "圣人，是神明不测之号。君子，是才德出众之名。善人，是志仁无恶的人。有恒，是存心有常的人。亡字即是有无的无字。虚是空虚。盈是充满。约是寡少。泰是侈泰。孔子说：“天下之人品等第，每有不同，而随其才器造诣，皆可上进。彼神明不测，大而化之的圣人，乃人之至者，吾不得而见之矣，得见才德出众而为君子者，斯亦可矣。然君子去圣人不远，岂易得哉？不惟君子不可得而见，至于天资粹美，志仁无恶的善人，吾亦不得而见之矣，得见存心之有常者，斯亦可矣。夫有恒者之与圣人，高下固为悬绝，而实为入德之门，然谓之有恒，不过质实无伪耳。盖天下之事，必有其实，乃能常久。若是存心虚伪，本无也，却做个有的模样；本空虚也，却做出个盈满的模样；本寡少也，却做个侈泰的模样，似这等虚夸无实，虽一时伪为以欺人，而本之则无自将不继于后，欲其终始如一，守常而不变，岂可得乎？所以说难乎有恒矣。夫无恒者如此，则所谓有恒者可知。人若能纯实无伪而充之以学，则固可由善人而为君子，由君子而为圣人，不止于有恒而已，此吾所以思见其人也。”然《中庸》言达道达德，九经而归本于一诚。先儒说：诚者圣人之本。孔子此言，岂徒以引进学者哉？要其极则参赞位育之化，亦不过自有恒之实心以充之耳。欲学二帝三王者，宜体验于此。"
        },
        {
          "originalText": "子钓而不纲，弋不射宿。",
          "explain": "钓是钓鱼，以大绳系纲，截水取鱼叫做纲。弋是以丝系矢而射。宿是鸟之栖者。门人记说：吾夫子在贫贱时，为奉养、祭祀亦尝取鱼、鸟以为用矣。但常人都有贪得之念，而夫子每存好生之心。其取鱼也只用钓饵以钓之而已，不曾以大绳系纲拦截水中而尽取之也；其射鸟也只以丝系矢，射其飞者而已，如鸟之宿者，则未尝出其不意而射取之也。盖于取物之中，而寓爱物之意，圣人之仁如此！古之圣王网罟之目，必以四寸，田猎之法，止于三驱，皆以养其不忍之心，而使万物各得其所也。人君能举斯心以加诸民，则人人各遂其生而天下治矣。"
        },
        {
          "originalText": "子曰：“盖有不知而作之者，我无是也。多闻，择其善者而从之；多见而识之，知之次也。”",
          "explain": "不知而作是不知其理而妄有作为。识字解做记字。孔子说：“天下之事，莫不有理，必先知得此理明白，然后处事停当而无有过差。今天下之人，盖有不知其理而妄有所作为者，若我则无是也。然吾所以无不知而作者，岂是生来便晓得许多道理？盖我以天下之义理无穷，非闻见广博，则无以开聪明而扩智虑。于是多闻天下之理，择其善者而体之于身，务使有得而不敢不勉；又多见天下之事，不论善恶皆记之于心，以备参考而不敢遗忘。夫闻见既多，而又有所抉择参考，则得于人者无穷，而裁于己者有据，虽是闻见之知与生而知之者不同，然自此进之，则智虑日广，义理日明，亦可次于知之者矣。知之既明，则处之自当，又何妄作之有哉？”夫圣人本生知安行，而其自谦之词如此。则知学为圣人者，必先造其理，而后可以履其事。此讲学穷理之功，不可一日而不勉也。"
        },
        {
          "originalText": "互乡难于言，童子见，门人惑。",
          "explain": "互乡是地名。昔孔子时，有地名互乡者，其人都习于不善，难于言善。那时有道之君子皆恶而绝之。一日有个童子，慕孔子而求见，孔子许其进见，不加拒绝。门人都疑惑说道：“君子持身贵正，疾恶贵严。今互乡童子乃不善之人，夫子何为见之？”此所以疑而未解也。"
        },
        {
          "originalText": "子曰：“与其进也，不与其退也。唯何甚！人洁己以进，与其洁也，不保其往也。”",
          "explain": "与字解做取字。洁是舍旧从新的意思。往是前日。孔子因门人之惑而晓之说道：“君子之处己固当谨严，至于待人也要宽恕。今互乡虽不善之俗，而童子之求见，是乃向善之心，我今特取其进而求见耳，非取其退而为不善也。若因其习俗而峻拒之，则太甚矣。我何为而绝人于己甚乎？盖凡天下之人，不患其旧习之污染，而患其终身之迷惑。若能幡然悔悟，舍旧从新，而洁己以求进，这就是改过迁善可与入道的人，但取其能自洁耳，不能保其前日所为之善恶也。盖来者不拒，往者不追，君子待人之道，固当如此。今互乡童子正洁己以进者，我又何为而拒之？二三子亦可以无疑矣。”当时，教化陵夷，风俗颓败，孔子欲化导天下之人，以挽回天下之风俗，故其不轻绝人，不为己甚如此。惜乎有志未遂，非惟时君莫能用，而门人亦莫能尽知也。"
        },
        {
          "originalText": "子曰：“仁远乎哉？我欲仁，斯仁至矣。”",
          "explain": "仁是本心之全德。孔子因人不肯用力于求仁，故言此以勉之说道：“世之惮于求仁者，盖将以仁为远于人也，自我观之，仁之为德也，果远于人乎哉？不远也，何以见其不远？盖凡物之远者，求之或未必得，得之或未必速。若夫仁者乃心之德，有此人即有此心，有此心即具此仁，本非在外之物也。人但迷于私欲而不知反求，故遂流于不仁，而视以为远耳。我若欲仁，反而自思曰：仁在吾心，不可失也，而求以得之，则一念方动，本体具见，仁固即此而在矣，何远之有？”夫以仁本不远如此，则人而不仁者，岂非自离其仁也哉？然仁具于心，至之虽甚易，而失之亦不难，必须于既至之后常加操存之功，则心德渐以纯全，而可造于中心安仁之地矣。此又求仁者所当知。"
        },
        {
          "originalText": "陈司败问：“昭公知礼乎？”孔子曰：“知礼。”",
          "explain": "陈是国名，司败是官名，即司寇也。昭公是鲁君。昔者鲁昭公习于威仪之节，当时以为知礼。陈司败以昭公娶同姓为夫人是失礼之大者，而乃负知礼之名，有所不足于心。故问于孔子说：“人皆以鲁君为知礼，果知礼乎？”孔子答说：“知礼。”盖人臣与君，称美不称恶，而陈司败亦未显言所以不知礼之事，故夫子直以知礼答之。"
        },
        {
          "originalText": "孔子退，揖巫马期而进之，曰：“吾闻君子不党，君子亦党乎？君取于吴，为同姓，谓之吴孟子。君而知礼，孰不知礼？”",
          "explain": "巫马期是孔子弟子，姓巫马，名施，字子期。党是庇护的意思。孟是长。子是宋国的姓。陈司败因孔子以昭公为知礼，心中不以为然。及孔子既退，适遇其弟子巫马期在前，乃迎揖而进之，与他说道：“吾闻君子之为人，平心直道而公其是非贤否于人，不私其人而为之党也。由今观之，君子亦阿党于人乎？何以言之？盖周家礼制，同姓不得为婚姻。吴，泰伯之后，鲁，周公之后，同是姬姓，而鲁君乃娶吴国之女为夫人，正犯此礼。却乃假辞遮饰，不称之曰吴孟姬，而称之曰吴孟子，夫子是宋姓也，娶吴国之女而冒宋国之姓，其能掩乎？是其任情越礼，明知故为，鲁君之不知礼甚矣！若君而可谓之知礼，则人人皆可谓之知礼矣，谁为不知礼者乎？夫君不知礼，而夫子以知礼与之，是私之而为掩其过也，非党而何？”司败品评昭公，固为确论。但疑孔子为党，则圣人用意之忠厚，彼盖有所不知也。"
        },
        {
          "originalText": "巫马期以告。孔子曰：“丘也幸，苟有过，人必知之。”",
          "explain": "巫马期述司败之言，以告孔子。孔子既不可自谓讳君之恶，又不可以娶同姓为知礼，乃自引以为己之过失说道：“这委的是我说差了。然凡人有过不得闻，则过无由改，此不幸之大者也。丘也可谓幸矣，苟有过失，人必知之。既知于人，则得闻于己，而可以改图于后日矣，岂非幸乎？”夫善则称君，过则归己，本理之当然。然孔子既自任以为过，则昭公之不知礼亦自有不可讳者。一则不昧天下是非之公，一则不失臣子忠厚之至。圣人一问答之间，真可以为万世法矣。"
        },
        {
          "originalText": "子与人歌而善，必使反之，而后和之。",
          "explain": "歌是歌咏。善是歌得好，反是反复再歌。自歌以应人之歌叫做和。门人记说：夫子好善之心无穷，不惟取人之善，而又以助人之善。如与人同歌，而其人之所歌，或辞意相协，音律相和，是歌之善者也。此时夫子之心，与之契合，要与之相和而歌，然不遽和也。必使之反复再歌，凡其辞意音律所以为善处，皆审察而详味之。既得其善矣，然后自歌以和之，使彼此迭奏，而同声相应焉。盖不但取彼之善为我之善，而又以我之善助彼之善矣。夫孔子一咏歌之间，而气象从容，诚意恳至如此。其心与舜之取人为善，汤之用人惟己一般。此其所以为至圣也。"
        },
        {
          "originalText": "子曰：“文，莫吾犹人也。躬行君子，则吾未之有得。”",
          "explain": "言语成章叫做文。莫是疑词。犹人是说犹可以及人。孔子说：“人之所以为君子者，不在于言，而在于行。世间有能言的人，或讲论道理，或敷陈政事，焕然有文采之可观，这不过在言语上求工而已。我虽未能过人，而犹或可以及人也。惟是身体力行，事事都实有诸己，而不为空言，这乃是成德之君子。我反而求之，则全未有得，虽欲勉焉以求至，而力有所不及矣。”观孔子此言，可见言易而行难，文在所缓，而行在所急。进德者固当先行而后言，用人者尤当听言而观行也。"
        },
        {
          "originalText": "子曰：“若圣与仁，则吾岂敢！抑为之不厌，诲人不倦，则可谓云尔已矣。”公西华曰：“正唯弟子不能学也。”",
          "explain": "大而化之叫做圣。心德浑全叫做仁。抑是反语辞。公西华是孔子弟子。昔孔子至圣至仁，当时必有以是称之者。故孔子谦说：“人各有能，有不能。若是那道德浑化的圣人与那心德纯全的仁人，则吾岂敢当乎？只是以仁圣之道而为之于己，则孜孜焉以求之，未尝以少有所得而遂生厌足之心；以仁圣之道而教诲乎人，则谆谆焉以语之，未尝以劳于开导而或萌倦怠之意，这便是我之所能，不过如此而已矣。若圣与仁则吾岂敢乎？”门人中有公西华者，闻夫子之言，乃仰而叹之说：“夫子辞仁圣之名，而自任夫不厌不倦者，岂以不厌不倦为易能乎？殊不知这正是弟子不能学处。”盖为之可能也，使非全体仁圣，而至诚无息者，孰能无厌乎？诲人可能也，使非全体仁圣，而善与人同者，孰能无倦乎？然则夫子虽欲辞仁圣之名，而其实自有不容掩者矣。昔祗德如大禹，而不自满假；缉熙如文王，而望道未见。孔子之心即禹、文之心也。圣人且然，况其他乎？欲学为圣人者，诚不可以自足矣。"
        },
        {
          "originalText": "子疾病，子路请祷。子曰：“有诸？”子路对曰：“有之。《诔》曰：‘祷尔于上下神祗。’”子曰：“丘之祷久矣。”",
          "explain": "祷是祈祷。诔是哀词。上下神祗是天神地祗。昔孔子曾有疾病，门弟子都以为忧。于是子路请命于孔子，欲祷祠鬼神以祈福佑。盖疾病行祷虽弟子事师迫切之至情，然不达于人鬼之理，而溺于祸福之说，惑亦甚矣。孔子不直斥其非，乃先问说：“疾病行祷，果有此理否乎？”子路对说：“于理有之，吾闻诔词中有云：‘祷尔于上下神祗。’是说人有疾时曾祷告于天地神祗，欲以转祸而为福，则是古人有行之者矣。今以病请祷，于理何妨？”于是孔子晓之说：“夫所谓祷者，是说平日所为不善，如今告于鬼神，忏悔前非，以求解灾降福耳。若我平生，一言一动不敢得罪于鬼神，有善即迁，有过即改。则我之祷于鬼神者，盖已久矣。其在今日，又何以祷为哉？”盖圣人德与天合，虽鬼神不能违，岂待于祷？至于死生修短，则有命存焉，虽圣人亦惟安之而已，祷祀亦奚益乎？观孔子晓子路之言，可见当修德以事天，不必祷祀以求福。当用力于人道之所当务，不必谄渎于鬼神之不可知矣。"
        },
        {
          "originalText": "子曰：“奢则不孙，俭则固。与其不孙也，宁固。”",
          "explain": "奢是奢侈。孙字与逊顺的“逊”字同。不孙是僭越不循理的意思。俭是省约。固是鄙陋。孔子说：“先王制礼自有个中道，不可加损。若专尚侈靡而过乎中者，谓之奢。奢则意志骄盈，纵肆无节。虽理之所不当为者，亦将僭越而为之，其弊至于不孙。若专务省约，而不及乎中者，谓之俭。俭则悭吝鄙啬，规模狭小，虽理之所当为者，亦将惜费而不为，其弊必至于固。这不孙与固，皆不免于失中。但就这两样较来，则与其为不孙也，宁可为固。”盖奢而不孙，则越礼犯分，将至于乱国家之纪纲，坏天下之风俗，为害甚大。若俭而固，则不过鄙陋朴野而已。原其意犹有尚质之风，究其弊亦无僭越之罪，不犹愈于不孙者乎？盖周末文胜，孔子欲救时之弊，故其言如此！然俭，乃德之共；奢，乃恶之大，二者之相去岂特过与不及之间而已哉？帝尧茅茨土阶，大禹恶衣菲食而万世称圣，汉之文帝，宋之仁宗皆以恭俭化民，号为贤主。至如骄奢纵欲，横征暴敛，以败坏国家者，往往有之。然则去奢崇俭乃帝王为治之先务，有国家者所当深念也。"
        },
        {
          "originalText": "子曰：“君子坦荡荡，小人长戚戚。”",
          "explain": "坦是平坦，荡荡是宽广貌。戚戚是忧愁不宁的意思。孔子说：“欲知君子、小人之分，但观其心术气象自然不同。盖君子心循乎天理，素位而行，不愿乎外。故仰焉不愧于天，俯焉不怍于人，利害不能为之惊，毁誉不能为之惑，但见其坦然荡荡，无适而不宽舒自得也。小人心役于物欲，行险侥幸，惟日不足，故非切切以谋利禄，则汲汲以干名誉。其未得也，患得之；其既得也，患失之。但见其长是戚戚，无时而不忧虑愁苦也。”夫坦荡荡者，作德心逸日休也；长戚戚者，作伪心劳日拙也。一念既差，而人品遂顿殊矣，可不慎辨之哉！"
        },
        {
          "originalText": "子温而厉，威而不猛，恭而安。",
          "explain": "温是和厚。厉是严肃。威是有威可畏。猛是暴戾。恭是庄敬。安是安舒。门人记说：容貌乃德之符。人惟气质各有所偏，故其见于容貌者亦偏。惟夫子则容貌随时不同，而无有不出于中和者。如人之温者难于厉也，夫子和厚可亲是固温矣。然和厚之中自有严肃者在，可亲也，而不可犯也，又何其厉乎？温而厉，是温之得其中也。人之威者易于猛也。夫子尊严可畏，是固威矣，然尊严之内自无暴戾者存，可畏也亦可近也，何至于猛乎？威而不猛，是威之得其中也。人之恭者难于安也。夫子庄敬自恃，是固恭矣，然舒泰而不拘迫，自然而非勉强，盖周旋中礼而有忘其恭者焉，又何其安乎？恭而安，是恭之得其中也。盖圣人全体浑然，阴阳合德，故其中和之气见于容貌之间者如此。欲取法其盛德之容者，当先涵养其中和之蕴可也。"
        }
      ]
    ]
  },
  {
    "chapterName": "泰伯第八",
    "introduction": "凡二十一章。",
    "paragraphs": [
      [
        {
          "originalText": "子曰：“泰伯，其可谓至德也已矣。三以天下让，民无得而称焉。”",
          "explain": "泰伯是周太王之子。昔周太王古公生三子。长的即泰伯，次的是仲雍，少的是季历。季历生子昌，乃文王也。太王因见昌有盛德，欲传位季历以及昌。泰伯知之，遂与其弟仲雍，托名采药，逃去于荆、蛮地方，断发文身，自毁其形，从夷之俗以示不可用。于是太王乃立季历，传国至文、武而有天下焉。三让是固让。孔子追原周家王业之所由起，因见泰伯之事历世久远，几于泯灭，故特表而出之说道：“人但知我周太王肇基王迹，王季勤劳王家，至于文、武，遂成王业，都是周家贤圣之君。不知太王之长子泰伯者，其德可谓极至而无以复加也已矣。何以言之？周家王业之兴，实始于太王，而泰伯嫡长当立，则后来的天下乃泰伯之所宜有者也。泰伯因见太王意在贤子圣孙，即与仲雍逃去不返。因此，王季、文王承其统绪，遂开八百年之周。是名虽让国，实以天下固让其弟侄而不居也。然却托为采药，毁体自废，其让隐微泯然，无迹可见，故人莫得以窥其心事而称颂之焉。夫以天下让，其让大矣。三以天下让，其让诚矣。而又隐晦其迹，使民无得而称，是能曲全于父子兄弟之间，而绝无一毫为名之累，其德岂非至极而不可加者乎？”然要之太王之欲立贤子圣孙，为其道足以济天下，非有爱憎利欲之私也，是以泰伯去之不为狷，王季受之不为贪。亲终不赴，毁伤肢体不为不孝。盖处君臣父子之变，而不失乎中庸，此所以为至德也。夫子叹息而赞美之，宜哉。"
        },
        {
          "originalText": "子曰：“恭而无礼则劳，慎而无礼则葸，勇而无礼则乱，直而无礼则绞。”",
          "explain": "礼是节文。劳是烦劳。葸是畏惧的模样。乱是悖乱。直是径直。绞是急切的意思。孔子说：“人之立身行事，必合乎天理之节文，而后可以无太过不及之弊。如待人固以恭敬为贵，然亦有中正之准则，若恭敬而无礼以为限制，则仪节烦多，奉承过当而不免于劳矣。处事固以谨慎为贵，然亦有事理之当然，若谨慎而无礼以为裁度，则逡逡畏缩，小心太过，而不免于葸矣。勇敢而不可屈挠，固是美德，然不能以礼自守，则不顾名分，而逞其血气之刚，必将至于悖乱矣。径直而无所私曲，固是善行，然不能以礼自防，则任情喜怒，而略无含容之意，必将至于急切矣。”夫恭、慎、勇、直，四者皆人之所难，而无礼则各有其弊如此！可见君子当动必以礼，而不可须臾离也。"
        },
        {
          "originalText": "“君子笃于亲，则民兴于仁；故旧不遗，则民不偷。”",
          "explain": "君子是在上位的人。笃是厚。兴是起。故旧是平日相与或有功劳的旧人。遗，是弃。偷字解做薄字。孔子说：“在上位的君子，凡有举动，百姓每都瞻仰而仿效之，不可不慎也。若能孝顺父母，友爱兄弟，和睦宗族，笃厚于一家之亲，则自己能尽乎仁矣。将见百姓每都感发兴起，而各亲其亲，自然伦理正而恩义笃，岂不兴于仁矣乎？若能信用老成，尊礼耆旧，凡平时相与的旧人，皆不以其迹之疏远，年之衰迈而遗弃之，则自己能处于厚矣。将见百姓每都欢欣联属，而各厚于故旧，自然教化行而风俗美，又岂有偷薄者乎？”夫一处亲故之间，而上行下效，其应如响如此。为人君者可不正心修身，以为化导斯民之本哉。"
        },
        {
          "originalText": "曾子有疾，召门弟子曰：“启予足！启予手！《诗》云：‘战战兢兢，如临深渊，如履薄冰。’而今而后，吾知免夫！小子！”",
          "explain": "召是呼喊。门弟子是曾子的门人。启是开。《诗》是《诗经·小旻》之篇。小子就指门弟子说。曾子在圣门素以孝称，平日所以守身事亲者，不但正心修德为圣贤之学，以求显亲扬名，虽至于身体发肤之微，亦以其受之父母加以谨守，不敢毁伤，至于有疾将终，追思平生守身之道，至此可以无愧，故呼其在门弟子而教之说：“父母全而生之，子全而归之，不亏体，不辱亲才叫做孝。汝辈试开衣衾而视吾之足，视吾之手，曾有一之伤毁不全者乎？然所以得全此身者，亦非容易！盖我平日所以保守之者，就是《诗经》上所谓战战然恐惧，兢兢然戒谨，如临在深渊之上，常恐坠下去一般；如行于薄冰之上，常恐陷下去的一般。我惟是这等谨慎，所以得保其全也。夫使吾生尚存，则犹未敢必他日之何如？今则已矣，自今以后，吾始知其得终免于污玷，而可以无恐矣！汝小子其念之哉？”语毕而又呼小子者，盖所以致丁宁之意，亦欲其如己之戒谨恐惧，一举足而不敢忘亲也。夫以曾子之保身如此，则凡纵欲以伤其本，亏行以辱其亲者，固在所必无矣。为人子者，宜以曾子为法，庶可以体亲心而尽子道也。"
        },
        {
          "originalText": "曾子有疾，孟敬子问之。曾子言曰：“鸟之将死，其鸣也哀；人之将死，其言也善。”",
          "explain": "孟敬子是鲁大夫仲孙捷。昔曾子有疾，孟敬子往问其疾。曾子将有言以告之，恐其忽略而不加之意，故先发言说道：“大凡鸟之将死，恐惧迫切，故其鸣叫必哀。人之将死，本然之良心发见，故其言语必善。今我既将死矣，有言则善言也，子其听而念之哉！”"
        },
        {
          "originalText": "“君子所贵乎道者三：动容貌，斯远暴慢矣；正颜色，斯近信矣；出辞气，斯远鄙倍矣。笾豆之事，则有司存。",
          "explain": "贵是贵重。道是道理。暴是粗厉。慢是放肆。信是信实。辞是言词。气是声气。鄙是凡陋。倍字与违背的“背”字同。笾是竹器，豆是木器，都是祭祀所用的。有司是执事之人。曾子因孟敬子平日好琐屑于细务，而忽略了大体，故告之说：“道虽无所不在，然有紧要的，有可缓的，不可以泛求也。吾观君子于日用之间所贵重的道理，只有三件。三者何？盖人之容貌彰于一身，易至于粗粝放肆，此所以多失容也，惟君子不动容貌则已，才动容貌便雅饬恭谨，而远于暴慢。人之颜色形于面，对人多勉为端正，而中心不然，此所以多失色也。惟君子不正颜色则已，才正颜色便表里如一，而近于信实。辞气宣于口，易至于凡陋背理，此所以多失言也。惟君子不出辞气则已，才出辞气便成章顺理，而远鄙背。此三者乃修身之要，为政之本，所当操存省察，而不可顷刻违者，故君子所重在此而已。若夫用笾豆以供祭祀之事，如此类者，不过器数仪文之末，则自有执事者司之，君子亦何用屑屑留心于此哉？”盖人之为学，贵识其大，大行既无不善，而小节亦无所遗，固为全德。若舍其大而务其小，则大本既失，小者亦不足观矣。况于帝王之学，又与士庶人不同，则凡正心修身以立天下之极者，又岂在于仪文度数之末哉？有志于圣贤者，当知所务矣。"
        },
        {
          "originalText": "曾子曰：“以能问于不能，以多问于寡；有若无，实若虚；犯而不校。昔者吾友，尝从事于斯矣。”",
          "explain": "犯是触犯。校是计较。吾友指颜渊说。从事是用功。昔颜子既没，曾子追思其贤而称之说道：“凡人志意盈满的少有所得，便说自己有余，他人不足，谁肯下问？度量狭小的，遇有触犯，便说自己的是，他人的不是，谁肯容忍？若是自己学力至到，本是能的，乃问于不能的人；自己学问充足，本是多的，乃问于寡少的人。其心歉然自视，虽有也，却似无的一般，虽充实也，却似空虚的一般，略无一毫自满之意，其谦虚如此！人有触犯于我，我则以情恕人，以理自遣。初未尝发露于颜色，藏蓄于胸中，而有（当作无）一毫计较之心，其宽恕如此！这等的人不可多见，惟旧日我友颜渊，乃尝用力于此，盖其真知义理之无穷，而有善不伐，不见物我之有间，而有怒不迁，其所以潜心好学拳拳服膺者，惟此而已。今也则亡，岂不重可惜哉！”夫孔门传授心法，颜子独得其宗，而其平日用功，不过如此！盖谦虚以受人，则闻见多而学问日广，宽恕以容物，则私意泯而德性益纯。凡为贤为圣，皆不出此二者。盖学者当致力于斯。"
        },
        {
          "originalText": "曾子曰：“可以托六尺之孤，可以寄百里之命，临大节而不可夺也。君子人与？君子人也。”",
          "explain": "托是付托。六尺之孤是幼君。寄也是付托的意思。百里是侯国。命是政令。大节是大关系处。与是疑词，也是决词。曾子说：“天下之言成德者，期于君子。然才者德之用，节者德之守。二者兼备，而后为德之成也。若有人于此，不但可辅长君而已，虽亲受顾命，把六尺幼冲之君付托与他，亦可以承受而辅佐之。既能保卫其国家，而又能养成其令德，不但可共国政而已。虽侯国无君，把一国之政令委寄与他，亦可以担当而总摄之。既能安定其社稷，而又能抚辑其人民，其才之过人如此！至于事变之来，国势仓皇，人心摇动，其从违趋避，乃大节之所关也。其人临此时，而所以辅幼君，摄国政者，卓乎见理之精明，确乎持志之坚定，惟以义所当然为主，虽议论纷沓，终不能摇，虽死生在前，亦不能夺，其节之过人又如此。若此人者，果可谓之君子人乎？”吾知既有其才，又有其节，信非君子不能也。然是人也，自学者言，则为君子；自国家言，则所谓社稷之臣者也。盖有才无节，则平居虽有干济之能，而一遇有事，将诡随而不能振；有节无才，则虽有所执持，而识见不远，经济无方，亦何益于国家之事哉？所以人君用人，于有才而未必有节者，则止用之以理繁治剧；于有节而未必有才者，则止用之以安常守法。至于重大艰难之任，则非才、节兼备之君子，不可以轻授也。"
        },
        {
          "originalText": "曾子曰：“士不可以不弘毅，任重而道远。仁以为己任，不亦重乎？死而后已，不亦远乎？”",
          "explain": "弘是宽广。毅是强忍。任是责任。道字解做路字。曾子说：“士立身于天地间，要为圣为贤，必须有大涵养，方才做得。故规模广大，心不安于自足，叫做弘，不弘则隘矣。执守坚定，事必期于有终，叫做毅，不毅则馁矣。士岂可以隘焉而不弘，馁焉而不毅哉？所以然者为何？盖以士所负之任甚重，而其所行之路又甚远也。惟其任之重，必弘而后能胜其重；惟其道之远，必毅而后能致其远，此所以不可不弘毅也。然果何以见其任之重而道之远？盖仁者，人心之全德，兼众理，备万善者也。士乃以之为己任，必欲身体而力行之，则是举天下之善，尽万物之理，皆在于我之一身，其任不亦重乎？且其任是仁也，直至没身而后已，若一息尚存，此志亦有不容少懈者，则是向前策励再无可驻足之时，其道不亦远乎？”夫其任重而道远如此，此士之所以贵弘毅也。大抵孔门为学，莫要于求仁，而仁之为道，则非全体不息者，不足以当之。惟其全体也，则无一理之不该，所以不可不弘；惟其不息也，则无一念之间断，所以不可不毅。这正是曾子平生所学得力处，故其示人亲切如此。"
        },
        {
          "originalText": "子曰：“兴于《诗》，立于《礼》，成于乐。”",
          "explain": "兴是兴起。立是卓立。成是成就。昔孔子删诗书，定礼乐，以教学者，正欲其实体于身而有所得，故特举以示人说道：“君子立教，不过要人为善去恶而已。然所以兴起其好善恶恶之良心者，每得之于《诗》。盖《诗》本性情，有邪有正，其言词明白易知，而吟咏之间，抑扬反复，其感人又易入。于此学之，则其好善恶恶之心，有油然感发而不能自已者，所以说兴于《诗》。此可见《诗》之当学也。善念既兴，又必卓然有以自立，然后善在所必为，恶在所必去。而其立也，则得之于《礼》。盖《礼》以恭敬辞让为本，而有节文度数之详，可以敛束人之身心，坚定人之德性。于此学之，则自能卓立持守，而不为外物之所摇夺。所以说立于《礼》，此可见《礼》之当学也。既能自立，又必造到那纯粹至善的地位，乃为成就，而其成也，则得之于乐。盖乐以和为主，其声容节奏可以养人之性情，而荡涤其邪秽，消融其渣滓。于此学之，则自然义精仁熟，而和顺于道德矣，所以说成于乐，此可见乐之当学也。”然古人《诗》、《礼》乐之教，皆发于性情之正，本于中和之德，故能成就人才如此，若后世以吟咏声韵为诗，而无关于性情，以虚饰仪文为礼，而不本于恭敬，以嬉戏淫哇为乐，而反乖于中和，则于《诗》、《礼》乐之本然者失之远矣，亦何足务哉？善学者辨之。"
        },
        {
          "originalText": "子曰：“民可使由之，不可使知之。”",
          "explain": "民是凡民。由是身行其事。知是心悟其理。孔子说：“道理在天地间，件件都是人所当知的。然为人上者之于凡民，但可使之由于是理之当然，而不能使之知其所以然。”盖所当然者，如父当慈，子当孝之类，皆民生日用之事，就是寻常庸众的人也都行得，故能使之由。若其所以当然之故，则皆出于天命人心之本然，其理精微奥妙，必须资质高明，学力至到者，乃能脱然有悟。其在凡民，如何便会晓得？所以不能使之知也，然知之之理，亦不外于所由之中。圣人在上以先知觉后知，以先觉觉后觉，至于渐摩既久，天下自然化成矣，亦何不可知之有哉！"
        },
        {
          "originalText": "子曰：“好勇疾贫，乱也。人而不仁，疾之已甚，乱也。”",
          "explain": "勇是勇敢。两个疾字都是疾恶的意思。乱是悖乱。已甚是过甚。孔子说：“柔懦之入，虽恶贫无能为也；安贫之人虽好勇，固无害人。惟是那好勇尚气的人，身处穷困，乃疾恶其贫，而不肯安分守己，则必以血气之强而济其苟得之念，虽为盗贼从悖逆皆不顾矣，岂不至于为乱乎？至若不仁的人，本心已失，如其恶未著，尚可容恕，则化之以善可也。若其罪当诛，而吾又得以诛之，则遂诛之可也。不然而徒疾恶过甚，使之无所容其身，则事穷势迫，必将求泄其忿恨，而逞凶肆暴，无所不至矣，岂不足以致乱乎？”夫好勇疾贫者，是身自为乱，固为天下之首恶，至于恶不仁者，本为正理，特以处之不善，乃亦足以致乱，而徒为祸阶。则君子之待小人，岂可以轻发而不审处哉！"
        },
        {
          "originalText": "子曰：“如有周公之才之美，使骄且吝，其馀不足观也已。”",
          "explain": "骄是以人皆不能，而夸己独能的意思。吝是但欲己有是能，而不欲人之皆能的意思。孔子说：“人之处世，固贵于有才，而不可自恃其才。自古言才能技艺之美者，莫如周公。如或真有周公之才之美，固是难及，然须持之以谦虚可也。设使以己有是才也，而忲然自骄，谓人皆不如己，又忌人有是才也，而执吝自私，不欲善于人同，则无其德而大本失矣，其余才艺之美，亦何足观哉？”夫有周公之才之美，而一涉骄吝，尚不足观，况无周公之才而骄吝者乎？人当常加自省而存抑畏之心可也。故圣如帝舜，而舍己从人，功如大禹，而不自满假。诚知谦虚之受益，而骄吝之丧德也。然则孔子之言，岂徒在下位者所当知哉。"
        },
        {
          "originalText": "子曰：“三年学，不至于谷，不易得也。”",
          "explain": "至字当作心志的志字。谷是俸禄。孔子说：“古人之学将以明善诚身，求尽其为人之理而已。然学既成矣，则君必见用而养之以禄。此乃理之自然，而其本心则不为此也。后世人心不古，见学之可以得禄，乃遂有为干禄而后学者，亦有学问之功始加，而利禄之念随之者。此不惟失学之本意，而心逐于利，其学亦无所得，乃天下之通患也。若有人焉专精为学至于三年之久，而其心不志于谷禄，则是谋道而不谋食，为己而不为人，志高识大，超出乎时俗之表者也，这等的人岂易得哉？”所以人君用人，于那有实学的必录用而尊显之，使得以展尽底蕴。若夫假学以沽名干进者，则摈抑而不用。庶乎贪位慕禄之徒，不至于滥窃名器，而无补于国家世。"
        },
        {
          "originalText": "子曰：“笃信好学，守死善道。危邦不入，乱邦不居。天下有道则见，无道则隐。”",
          "explain": "笃是深厚牢固的意思。孔子说：“君子之修身处世，必须学问、操守，兼造其极，乃为尽善，甚不可苟也。若有人焉于道理的确有见，则信之极其诚笃，虽议论纷纭，一毫都动移他不得，其志向之专如此，而又能孜孜务学，格物穷理，以求其是非之真，而尽其精微之奥，则讲究明而辨别审，所信者一出于正矣。遇事心里主定在此，则守之极其坚固，虽死生利害，一切都摇夺他不得，其执持之果如此，而又能事必由理，行必合义。初未尝劝匹夫之小信，而乖中庸之大道，则关天常而扶人纪，所守者允得其当矣。夫笃信好学是有学也，守死善道是有守也。为君子而有学有守，则知之必明，行之必勇，出处去就，焉往而不善哉？故其遇危邦也，则避之而不入；其在乱邦也，则去之而不居。当天下之有道也，则显身而仕；天下无道也，则退藏而隐。”此其去就之义洁，出处之分明，非有学有守者，何足以与此？然这样人，不但可以善一己之行藏而已，使人君得而用之，则有大涵养，自有大设施。平时必能尊主庇民，建功立业。有事必能砥砺名节，匡扶世运，所补殆非浅浅矣！学问、操守之系于人也，大矣哉！"
        },
        {
          "originalText": "“邦有道，贫且贱焉，耻也；邦无道，富且贵焉，耻也。”",
          "explain": "耻是愧耻。孔子说：“士之处世，既贵有可用之才，又贵有能守之节。若乃邦国有道，有明君以出治于上，有贤臣以辅治于下，贤者必使之在位，能者必使之在职，正君子向用之时也。当此时而乃为世所弃，困处于贫贱之中，则其无善可称，无才可录可知矣。岂不可愧耻乎？至若邦国无道，上无明君，下无贤臣，非贿赂不可得官，非谄佞不能固宠，正小人向用之时也。当此时而乃与世相合，致身于富贵之地，则其贪位慕禄，卑污苟贱可知矣，岂不可愧耻乎？”盖惟其不能笃信好学，守死善道，故世治而无可行之道，世乱而无能守之节，乃碌碌庸人而已，何足取哉？士之不可以无养也如是夫！"
        },
        {
          "originalText": "子曰：“不在其位，不谋其政。”",
          "explain": "谋是图议，政是政事。孔子说：“凡人有是职位，则有是责任，则有是谋为，如任公卿大夫之职，则当谋公卿大夫之政。若不在其位，则其政事本与我无预者，而乃商度其可否之宜，条陈其利害之故，是为思出其位，犯非其分矣，奚可乎？故凡不在其位，则当介然自守，虽知识见得到，才力干得来，亦不可图谋其政事。”盖所以安本然之分，而远侵越之嫌，人之自处当如是也。然士人之学期于用世，则匹夫而怀天下之忧，穷居而抱当世之虑，亦有所不容已者。要之，潜心讲究，则为豫养非分干涉，则为出位。豫养者待用于不穷，出位者轻冒以取咎，此又不可不辨也。"
        },
        {
          "originalText": "子曰：“师挚之始，《关雎》之乱，洋洋乎盈耳哉！”",
          "explain": "师是太师，掌乐之官。挚是太师之名。《关雎》是《诗经·国风》首篇。乱是乐之卒章，洋洋是美盛的意思。盈是满。孔子说：“昔吾自卫反鲁之时，既曾正乐，适遇师挚在官之始，又能审音，故其时乐之残缺者已为之补，失次者已为之序。但见大乐之作，自其始奏之时，直至于《关雎》之卒章，一皆清浊相济，高下相宜，洋洋乎极其美盛，满耳而可听也，惜乎今也不得而复闻矣。”盖以孔子之圣而正乐，以师挚之贤而掌乐，故一时音节美盛如此。自师挚适齐，继者皆不能及，圣人所以追思而叹美之也。"
        },
        {
          "originalText": "子曰：“狂而不直，侗而不愿，悾悾而不信，吾不知之矣。”",
          "explain": "狂是疏狂。侗是昏昧无知的模样。愿是谨厚。悾悾是愚拙无能的模样。信是诚实。吾不知之者是甚绝之之词。孔子说：“赋性疏狂的人，宜乎行事直率方好，今却只好高夸大，及至到那有利害处，自家要讨便宜，外面却以道理责人。这等样奸狡不直，赋性昏昧的人，凡事既不知道，宜乎谨厚方好，今却轻举妄动，又不谨慎重厚。赋性愚拙的人，凡事既不能干办，宜乎诚实方好，今却诡谲虚诈，又不诚信笃实。这三样人，我也不知道他是何等的人。”盖狂而直，侗而愿，悾悾而信，虽是气质有偏，然犹不失其本然之真，尚可以陶镕。若不直、不愿、不信，则本真已失，而习染愈蔽，终不可以化诲者也，故孔子绝之。"
        },
        {
          "originalText": "子曰：“学如不及，犹恐失之。”",
          "explain": "如不及，是如有所追而不能及的意思。孔子说：“人之为学将以致知力行，而求进乎圣人之道也。然使无勤敏之功，则其心徒劳而无益，使无警省之心，则其功终怠而不前。所以，君子之为学也，研穷以求进其知，体验以求进其行，孜孜汲汲，惟日不足，常如有所追而不能及的一般。其用功之勤如此，而其心犹不敢有一时之或惰，当日进之时，怀日退之惧，惟恐失其所学，而果有所不及也。”夫以君子之学，其勤励警惕有如此者，此所以能成其学也，不然，则心不在焉，或作或辍，终亦岂能有成也哉？"
        },
        {
          "originalText": "子曰：“巍巍乎，舜、禹之有天下也，而不与焉。”",
          "explain": "巍巍是高大的模样。不与是不相关的意思。孔子说：“圣人之识见度量迥与常人不同。常人之情即有一命一爵之荣，未免自视侈然，志得意满，何其卑小也！若乃巍巍乎识量高大而不可及者，其惟舜、禹乎？盖舜、禹二圣人，本以匹夫之微，一旦有天下为天子，其崇高富贵可谓极矣，乃舜、禹则视之漠然，不以为乐，全似与己不相干涉的一般。此其心直超乎万物之上，而众人以为可欲而不可得者，举无一足以动其中，其胸襟气象视寻常真不啻万倍矣，是何其巍巍矣乎？”盖舜、禹之心只知天位之难居，虑四海之不治，日惟兢业万机，忧劳百姓而已。若夫有天下之可乐，奚暇计哉？此万世颂圣明者，必归之也。后世人君，诚能以其不与天下之心，而尽其忧勤天下之实，则二圣人之巍巍不难及矣！"
        },
        {
          "originalText": "子曰：“大哉，尧之为君也！巍巍乎，唯天为大，唯尧则之。荡荡乎，民无能名焉。巍巍乎，其有成功也。焕乎，其有文章！”",
          "explain": "则字解做准字。荡荡是广远之称。名是名状。成功指勋业说。焕是光明。文章是礼乐法度之类。孔子说：“自古帝王多矣，然莫有过于尧者。大矣哉，尧之为君乎，何以见其大？盖巍巍乎极其高大而无不覆冒者，唯天而已。谁能并之？独有帝尧之德高不可及，大而无外，能与之准，其包涵遍覆，就与天一般，故其德之广远，荡荡无涯，而形迹俱泯。当时之民一皆涵咏盛德而不识其功，鼓舞神化而莫测其妙，无有能指而名之者。其与天之不可以言语形容，又何异哉？惟其不可名，此所以为天也。然亦岂无可见者乎？就其治功之成就处观之，则黎民吾见其时雍，万邦吾见其协和。巍巍乎功业之隆盛，有莫可得而尚者焉，又就其治功之有文采处观之，以礼乐则极其明备，以法度则极其修明，焕乎文章之光显有不可得而掩者焉，尧之所可见者如此！若其德之不显者，则终不可名也。大哉尧之为君，非冠古今而独盛者乎？”"
        },
        {
          "originalText": "舜有臣五人而天下治。武王曰：“予有乱臣十人。”孔子曰：“才难，不其然乎？唐、虞之际，于斯为盛，有妇人焉，九人而已。”",
          "explain": "乱字解做治字。际是交会之时。妇人指武王之妃邑姜。昔门人将述孔子评论人才之言，先记说：自昔君天下者治莫盛于虞舜。其时有圣哲之臣五人，如禹平水土，稷播百谷，契敷五教，皋陶明刑，益掌山泽。凡虞舜所欲为的，五人都代为之，故能使四方风动从欲以治焉。是虞舜得人之盛如此！继夏、商而王者，治莫胜于周武王。武王尝自言曰：“予有致治之臣十人。在外有周公旦、召公奭、太公望、毕公、荣公、太颠、闳夭、散宜生、南公适为之辅理，在内有贤妃邑姜为之赞助，故能使四海永清，垂拱而治焉。”是有周得人之盛如此！孔子有感而叹之说道：“吾闻古语说，人才之生，最为难得，以今观之，岂不信然矣乎？盖自古圣圣相承，如唐虞交会之际，其时气运方隆，人才辈出，固极盛而无以加矣，自此以后，则惟我周为盛焉。唐虞固有五人，以赞成风动之功。我周亦有十人，以夹辅永清之烈，是我周真与唐虞比隆，而非夏商之所能及也。然数止十人，已为少矣，而中间有妇人焉，其实奔走御侮之臣，不过九人而已。以我周之盛而贤臣止于九人，岂不为难得哉？”然则，才难之一言，信乎其不诬矣。大抵得人固难，而知人与用人尤难，虞舜、武王惟其知之明而用之当，故能成天下之治如此。若知有未真，则取舍犹有所眩惑，用之未尽，则底蕴无由以展布，何以收得人之效乎？故知人善任，尤人君治天下之本，不可不慎也。"
        },
        {
          "originalText": "“三分天下有其二，以服事殷。周之德，其可谓至德也已矣。”",
          "explain": "服事是臣服敬事。孔子说：“人臣事君，固有一定之分，然使国家全盛，君德休明而为之臣者，能敬顺守职乃是常事，不足称也。惟殷纣暴虐无道，国祚日益衰微，文王发政施仁，人心日益归向，以天下大势计之，三分之内，二分都归于文王，盖有天下之大半矣。当是时以仁伐暴，以周代殷，特一反掌之间耳。乃文王则坚守臣节，以服事殷纣，初不以盛衰强弱二其心，则是时可为而不为，势可取而不取，非盛德之极，能如是乎？然则我周文王之德，其可谓至极而无以加者矣。”夫孔子之称至德者二，于泰伯则以其让天下，于文王则以其服事殷，皆所以明君臣之义，立万世之防，而惧乱臣贼子之心也，读者宜致思焉。"
        },
        {
          "originalText": "子曰：“禹，吾无间然矣。菲饮食而致孝乎鬼神，恶衣服而致美乎黻冕，卑宫室而尽力乎沟洫。禹，吾无间然矣。”",
          "explain": "间是有罅隙可非议处。菲是薄。鬼神是天神、地祗、人鬼。恶字解做粗字。沟洫是田间水道，旱时蓄水，涝时泄水，以便百姓每耕种的。孔子说：“帝王之治天下，事无大小，莫不各有至当不易的道理。少有未合，人即得指其罅隙而议之。我观大禹所行的事，件件合宜，无一些罅隙可以非议。如饮食，所以养生。禹之时，九州作贡，王食非不足也，乃却珍馐而进粗粝，其自用之淡薄如此！至于奉祀郊庙鬼神，则牺牲粢盛，务极丰洁，又致其诚孝而无敢简焉。衣服所以蔽体。禹之时，玉帛万国，文绣非不足也，乃舍华绮而衣粗恶，其被服之朴素如此！至于临朝承祭所尚的黻冕，则服物采章务求尽制，又极其华美而无所吝惜焉。宫室所以居身。禹之时四海为家，非不可备壮丽之观也，乃安卑隘而戒峻宇，其自处之简陋如此。至于百姓每备水旱的沟洫，则又胼手胝足以经理之，而竭尽其力，不以为劳焉。夫礼，有所当丰，事有所宜俭。当丰而俭则过于陋，当俭而丰则失之奢，皆未免于可议也。今观大禹，他自己身上一些不肯享，用至于事神勤民，却又这等周悉。丰所当丰，而不可谓之奢；俭所当俭，而不可谓之陋。虽欲议之，曾何罅隙之可窥哉？”所以又说：“禹，吾无间然矣！”盖深赞其美，以示万世为君之法也。然孔子之称赞大禹，固以其丰、俭适宜，其实还重在俭德上。盖人之常情，奉身之念每厚于事神为民。而人君富有四海，其势又得以自遂其欲。故致孝鬼神可能也，菲饮食不可能也；致美黻冕可能也，恶衣服不可能也；尽力沟洫可能也，卑宫室不可能也。书称禹克勤于邦，克俭于家，盖必俭而后能勤。若一有奉身之念，则虽以天下奉一人而犹恐不足，又乌能勤民而致力于神哉？欲法大禹者，尤当师其俭德可也。"
        }
      ]
    ]
  },
  {
    "chapterName": "子罕第九",
    "introduction": "凡三十章。",
    "paragraphs": [
      []
    ]
  },
  {
    "chapterName": "乡党第十",
    "introduction": "杨氏曰：“圣人之所谓道者，不离乎日用之间也。故夫子之平日，一动一静，门人皆审视而详记之。”尹氏曰：“甚矣孔门诸子之嗜学也！于圣人之容色言动，无不谨书而备录之，以贻后世。今读其书，即其事，宛然如圣人之在目也。虽然，圣人岂拘拘而为之者哉？盖盛德之至，动容周旋，自中乎礼耳。学者欲潜心于圣人，宜于此求焉。”旧说凡一章，今分为十七节。",
    "paragraphs": [
      []
    ]
  },
  {
    "chapterName": "先进第十一",
    "introduction": "此篇多评弟子贤否。凡二十五章。胡氏曰：“此篇记闵子骞言行者四，而其一直称闵子，疑闵氏门人所记也。”",
    "paragraphs": [
      []
    ]
  },
  {
    "chapterName": "颜渊第十二",
    "introduction": "凡二十四章。",
    "paragraphs": [
      []
    ]
  },
  {
    "chapterName": "子路第十三",
    "introduction": "凡三十章。",
    "paragraphs": [
      []
    ]
  },
  {
    "chapterName": "宪问第十四",
    "introduction": "胡氏曰：“此篇疑原宪所记。”凡四十七章。",
    "paragraphs": [
      []
    ]
  },
  {
    "chapterName": "卫灵公第十五",
    "introduction": "凡四十一章。",
    "paragraphs": [
      []
    ]
  },
  {
    "chapterName": "季氏第十六",
    "introduction": "洪氏曰：“此篇或以为齐论。”凡十四章。",
    "paragraphs": [
      []
    ]
  },
  {
    "chapterName": "阳货第十七",
    "introduction": "凡二十二章。",
    "paragraphs": [
      []
    ]
  },
  {
    "chapterName": "微子第十八",
    "introduction": "此篇多记圣贤之出处。凡十一章。",
    "paragraphs": [
      []
    ]
  },
  {
    "chapterName": "子张第十九",
    "introduction": "此篇皆记弟子之言，而子夏为多，子贡次之。盖孔门自颜子以下，颖悟莫若于贡；自曾子以下，笃实莫若子夏。故特记之详焉。凡二十五章。",
    "paragraphs": [
      []
    ]
  },
  {
    "chapterName": "尧曰第二十",
    "introduction": "凡三章。",
    "paragraphs": [
      []
    ]
  }
]